import {Injectable} from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class PatientsService {
  // private apiUrl = '/api/patients';// for InMemoryBackendService
  // old => 'app/shared/todos.json'
  public anamnesisData: any = {};
  public rehabilitationData: any = {};
  public efficiencyData: any = {};
  public biosignalsData: any = {};
  public isHealth = {value: true};

  constructor() {
    this.isHealth.value = true; // Sick
    this.rehabilitationData.isHealth = this.isHealth;
    this.efficiencyData.isHealth = this.isHealth;
    this.anamnesisData.isHealth = this.isHealth;


    // --------------------------getRehabilitationData--------------------------
    this.rehabilitationData.defaultNote = 'Примітка: ';
    this.rehabilitationData.defaultTask = 'Завдання';
    this.anamnesisData.stepOne = [
      'ТГ.Порушення мінеральної щільності кісткової тканини (МЩКТ), остеопороз',
      'ТГ.Перенесений гострий первинний або повторний інфаркт міокарда',
      'ТГ.Ішемічна хвороба серця',
      'ТГ.Артеріальна гіпертен зія (гіnертонічна хвороба)',
      'ТГ.Пневмонії',
      'ТГ.Бронхіти',
      'ТГ.Бронхіальна астма',
      'ТГ.Хронічні неспецифічні захворювання легень',
      'ТГ.Захворювання шлунково-кишкового тракту у т.ч. виразкова хвороба шлунка, і 12-палоі кишки',
      'ТГ.Професійні захворювання',
      'ТГ.Захворювання суглобів',
      'НГ.Стан після перенесених черепно-мозкових травм',
      'НГ.Наслідки гострих порушень мозкового кровообігу геморагічного інсульту',
      'НГ.Цереброваскулярні порушення разом з ішемічною хворобою серця',
      'НГ.Синдром вегетативної дистонії невротичного генезу',
      'НГ.Наслідки операцій на периферичних нервах',
      'НГ.Периферичні невропатії',
      'НГ.Вертеброгенні радикулярні синдроми',
      'НГ.Вертеброгенні рефлекторні синдроми',
      'ОТіХГ.Переломи хребта',
      'ОТіХГ.Переломи кісток тазу',
      'ОТіХГ.Переломи кісток верхніх і нижніх кінцівок',
      'ОТіХГ.Ушкодження зв\'язок і сухожиль',
      'ОТіХГ.Травми суглобів',
      'ОТіХГ.Наслідки ортопедичних оперативних втручань',
      'ОТіХГ.Множинні і сполучені травматичні пошкодження',
      'ОТіХГ.Наслідки запальних хвороб кишок',
      'ОТіХГ.Наслідки опіків і обморожень',
      'ОТіХГ.Хворі з дефектами кінцівок',
      'ОТіХГ.Хворі з наслідками синдрому здавлення тканин',
      'ОТіХГ.Облітеруючі захворювання артерій нижніх кінцівок',
      'ОТіХГ.Хворі у післяопераційному періоді',
      'ОТіХГ.Виражені рубцеві контрактури у суглобах нижніх і верхніх кінцівок',
      'ОТіХГ.Деформуючі остеоартрози',
      'ОТіХГ.Ревматоїдні артрити І го періоду'
    ];
    this.anamnesisData.selectedStepOne = undefined;
    this.anamnesisData.stepOneTitle = 'Виберіть з переліку основного контингенту хворих (присутня одна або більше ознак). ТГ-терапевтична група. НГ-неврологічна. ОТіХГ-Ортопедо-травматологічна і хірургічна.';
    this.anamnesisData.stepOneStep = 'Крок 1. ';


    this.anamnesisData.stepTwo = [
      'Протипоказання до призначення фізичної реабілітації відсутні',
      'Повна відсутність можливості спілкуватися з медперсоналом',
      'Гострі запальні захворювання, активна форма туберкульозу',
      'Некомпенсовані захворювання серця. Легень та інших внутрішніх органів',
      'Ішемічна хвороба серця з частими нападами стенокардії спокою і негативною динамікою ЕКГ',
      'Стійка артеріальна гіпертензія. Яка не піддається медикаментозній корекції',
      'Активна фаза ревматизму',
      'Некомпенсований цукровий діабет',
      'Про градієнтні неврологічні захворювання, коли не спинено процес, який викликає руйнування нервових структур',
      'Часті епілептичні напади',
      'Виражені психічні порушення',
      'Незаепітилізовані опіки',
      'Переломи, що не зростаються.',
      'Невправлені вивихи',
      'Нестабільний остеосинтез.',
      'Різке виснаження, голодування'
    ];
    this.anamnesisData.selectedStepTwo = undefined;
    this.anamnesisData.stepTwoTitle = 'Протипоказання до призначення реабілітаційних програм (присутня одна або більше з нижче відмічених ознак):';
    this.anamnesisData.stepTwoStep = 'Крок 2. ';


    this.anamnesisData.enabledPhysicalRahabilitation = 'Фізична реабілітація показана';
    this.anamnesisData.disabledPhysicalRahabilitation = 'Фізична реабілітація не показана';


    this.anamnesisData.treatmentMode = [
      '1 - Лікарняний',
      '2 - Після лікарняний'
    ];
    this.anamnesisData.selectedTreatmentMode = this.anamnesisData.treatmentMode[1];
    this.anamnesisData.treatmentModeTitle = 'Режим лікування:';


    this.anamnesisData.abilityToSelfservice = [
      '1 - Не обмежена',
      '2 - З використанням допоміжних засобів',
      '3 - З використанням допоміжних засобів та з допомогою інших осіб',
      '4 - Не здатність до самообслуговування та повна залежність від інших осіб'
    ];
    this.anamnesisData.selectedAbilityToSelfservice = this.anamnesisData.abilityToSelfservice[0];
    this.anamnesisData.abilityToSelfserviceTitle = 'Здатність до самообслуговування:';


    this.anamnesisData.majorCategoriesOfLife = 'Основні категорії життєдіяльності:';


    this.anamnesisData.psychoemocyStatusAndMotivation = [
      '1 - Хворий психологічно готовий приймати активну участь в реабілітаційній програмі, вірить в її високу ефективність',
      '2 - Хворий  байдужий до проведення фізичної реабілітації',
      '3 - Хворий психологічно не готовий приймати участь в реабілітаційній програмі не вірить в її ефективність, відмовляється від реабілітації'
    ];
    this.anamnesisData.selectedPsychoemocyStatusAndMotivation = this.anamnesisData.psychoemocyStatusAndMotivation[0];
    this.anamnesisData.psychoemocyStatusAndMotivationTitle = 'Психоемоціний статус та мотивація щодо участі в реабілітаційній програмі:';


    this.anamnesisData.criteria$ = [
      '1 - Стан пацієнта відмінний',
      '2 - Медично стабільний або відносно стабільний',
      '3 - У пацієнта спостерігається одне чи два персистуючі фізичні обмеження',
      '4 - Пацієнт здатен до навчання',
      '5 - Пацієнт спроможний  сидіти з підтримкою протягом, принаймні, однієї години, та приймати мінімальну участь у реабілітаційних інтервенціях'
    ];
    this.anamnesisData.selectedCriteria = this.anamnesisData.criteria$[0];
    this.anamnesisData.criteriaTitle = 'Критерій для призначення реабілітаційних програм:';


    this.anamnesisData.functionalCapabilitiesAssessment = [
      '1 - Хворий перевищує свої  функціональні можливості',
      '2 - Хворий недооцінює свої  функціональні можливості',
      '3 - Хворий об”ективно оцінює свої  функціональні можливост'
    ];
    this.anamnesisData.selectedFunctionalCapabilitiesAssessment = this.anamnesisData.functionalCapabilitiesAssessment[0];
    this.anamnesisData.functionalCapabilitiesAssessmentTitle = 'Оцінка хворим функціональних можливостей організму:';


    this.rehabilitationData.samosiukTitle = 'ОСНОВНІ КОНТИНГЕНТИ ХВОРИХ ДЛЯ АМБУЛАТОРНОЇ РЕАБІЛІТАЦІЇ (Самосюк)';
    this.rehabilitationData.therapeuticGroup = 'Терапевтична група';
    this.rehabilitationData.therapeuticGroupChecked = undefined;
    this.rehabilitationData.neurologicalGroup = 'Неврологічна група';
    this.rehabilitationData.neurologicalGroupChecked = undefined;
    this.rehabilitationData.orthopedicTraumatologicAndSurgicalGroup = 'Ортопедо-травматологічна і хірургічна група';
    this.rehabilitationData.orthopedicTraumatologicAndSurgicalGroupChecked = undefined;
    this.rehabilitationData.therapeuticGroupTable = [
      {checked: false, td: ['', '№', 'Порушення стану здоров\'я', 'Умови до направлення', 'Тривалість реабілітаційного (днів)']},
      {checked: false, td: ['', '1', 'Порушення мінеральної щільності кісткової тканини (МЩКТ), остеопороз', '', '']},
      {
        checked: false,
        td: ['', '2', 'Перенесений гострий первинний або повторний інфаркт міокарда', 'За умови стабілізації стану', '20-24']
      },
      {
        checked: false,
        td: ['', '3', 'Ішемічна хвороба серця', 'Крім частих приступів стенокарді і спокою і негативної динаміки ЕКГ', '16-20']
      },
      {
        checked: false,
        td: ['', '4', 'Артеріальна гіпертен зія (гrіnертонічна хвороба)', 'Можливість медикаментозногo контролю артеріальноrо тиску, відсутність гіпертонічних кризів', '12-14']
      },
      {checked: false, td: ['', '5', 'Пневмонії', 'Після гостроrо періоду, при нормалзації температури через 3-5 днів', '10-15']},
      {checked: false, td: ['', '6', 'Бронхіти', 'Після гострого періоду, при нормалізації температури через 3-5 днів', '10-15']},
      {checked: false, td: ['', '7', 'Бронхіальна астма', 'У І-ІІ стадіїі', '12-14']},
      {
        checked: false,
        td: ['', '8', 'Хронічні неспецифічні захворювання легень', 'При дихальній недостатаності І-ІІ стуnеня без загострення', '10-15']
      },
      {
        checked: false,
        td: ['', '9', 'Захворювання шлунково-кишкового тракту у т.ч. виразкова хвороба шлунка, і 12-палоі кишки', 'Після зняття больового синдрому', '14-15']
      },
      {checked: false, td: ['', '10', 'Професійні захворювання', 'Усі хворі', '10-12']},
      {checked: false, td: ['', '11', 'Захворювання суглобів', 'При функціональній недостатностi', '12-15']}
    ];
    this.rehabilitationData.neurologicalGroupTable = [
      {checked: false, td: ['', '№', 'Порушення стану здоров\'я', 'Умови до направлення', 'Тривалість реабілітаційного курсу (днів)']},
      {
        checked: false,
        td: ['', '1', 'Стан після перенесених черепно-мозкових травм', 'За умови стабілізації стану та здатності самостійного пересування і спілкування з медперсоналом', '18-24']
      },
      {
        checked: false,
        td: ['', '2', 'Наслідки гострих порушень мозкового кровообігу геморагічного інсульту)', 'За умови стабілізації стану та здатності самостійного (ішемічного або пересування і спілкування з медперсоналом)', '20-24']
      },
      {
        checked: false,
        td: ['', '3', 'Цереброваскулярні порушення разом з ішемічною хворобою серця', 'За умови стабілізації стану та здатності самостійного пересування і спілкування з медперсоналом', '20-24']
      },
      {checked: false, td: ['', '4', 'Синдром вегетативної дистонії невротичного генезу', 'Усі хворі', '12-14']},
      {checked: false, td: ['', '5', 'Наслідки операцій на периферичних нервах', 'Усі хворі', '18-24']},
      {checked: false, td: ['', '6', 'Периферичні невропатії', 'Після гострого періоду', '12-18']},
      {checked: false, td: ['', '7', 'Вертеброгенні радикулярні синдроми', 'За змоги самостійного пересування', '15-21']},
      {checked: false, td: ['', '8', 'Вертеброгенні рефлекторні синдроми', 'За змоги самостійного пересування', '10-15']}
    ];
    this.rehabilitationData.orthopedicTraumatologicAndSurgicalGroupTable = [
      {checked: false, td: ['', '№', 'Порушення стану здоров\'я', 'Умови до направлення', 'Тривалість реабілітаційного курсу (днів)']},
      {
        checked: false,
        td: ['', '1', 'Переломи хребта', 'Здатність до самостійного ресування при відсутності переломів, що не зрослися', '20-24']
      },
      {
        checked: false,
        td: ['', '2', 'Переломи кісток тазу', 'Здатність до самостійного пересування при відсутності переломів, що не зрослися', '20-24']
      },
      {checked: false, td: ['', '3', 'Переломи кісток верхніх і нижніх кінцівок', 'При відсутності переломів, що не зрослися', '20-24']},
      {
        checked: false,
        td: ['', '4', 'Ушкодження зв\'язок і сухожиль', 'При відсутності невправлених вивихів, через 2-3 тижні після травми', '12-15']
      },
      {checked: false, td: ['', '5', 'Травми суглобів', 'При відсутності невправлених вивихів, через 2-3 тижні після травми', '12-14']},
      {checked: false, td: ['', '6', 'Наслідки ортопедичних оперативних втручань', 'Здатність до самостійного пересування', '20-24']},
      {checked: false, td: ['', '7', 'Множинні і сполучені травматичні пошкодження', 'Здатність до самостійного пересування', '20-24']},
      {checked: false, td: ['', '8', 'Наслідки запальних хвороб кишок', 'При відсутності гострого запального процесу', '12-14']},
      {checked: false, td: ['', '9', 'Наслідки опіків і обморожень', 'При відсутності незаепітелізованих опіків', '20-24']},
      {checked: false, td: ['', '10', 'Хворі з дефектами кінцівок', 'Здатність до самостійного пересування', '15-20']},
      {checked: false, td: ['', '11', 'Хворі з наслідками синдрому здавлення тканин', 'Здатність до самостійного пересування', '15-20']},
      {
        checked: false,
        td: ['', '12', 'Облітеруючі захворювання артерій нижніх кінцівок', 'Здатність до самостійного пересування', '12-14']
      },
      {
        checked: false,
        td: ['', '13', 'Хворі у післяопераційному періоді', 'Після стабілізації стану та змозі самостійно пересуватись', '10-12']
      },
      {checked: false, td: ['', '14', 'Виражені рубцеві контрактури у суглобах нижніх і верхніх кінцівок', 'Після виявлення', '14-16']},
      {checked: false, td: ['', '15', 'Деформуючі остеоартрози', 'Після зняття больового синдрому', '12-14']},
      {checked: false, td: ['', '16', 'Ревматоїдні артрити І го періоду', 'Активність І-ІІ ст., після гостро', '12-14']}
    ];

    this.rehabilitationData.periodsSequenceTable = [
      {
        checked: false,
        td: ['Варіант дозування', 'Показання до застосування', 'Завдання', 'Дозування фізичного навантаження', 'Фізіологічні зміни']
      },
      {
        checked: false,
        td: ['Лікувальне дозування', 'Застосовується при тяжкому стані хворого. Ліжковий і палатний (лікарняний)', 'Для досягнення терапевтичного впливу на уражену систему чи орган, формування компенсацій, попередження ускладнень', 'Фізичне навантаження незначне і поступово збільшується від заняття до заняття', 'Змінюються незначно']
      },
      {
        checked: false,
        td: ['Тонізуюче дозування', 'Застосовується в період одужання. Вільний (лікарняний)', 'Для відновлення і удосконалення функції ураженої системи чи органу, досягнення загально зміцнювального та загально тонізуючого ефекту', 'При наростанні фізичного навантаження використовуються вправи помірної інтенсивності', 'Фізіологічні зміни незначні, залежать від захворювання і стану хворого']
      },
      {
        checked: false,
        td: ['Тренувальне дозування', 'Застосовується в період відновного лікування та в період ремісії (поза лікарняний)', 'Для тренування серцево-судинної, дихальної та інших систем. Раціональне використання великих навантажень', 'Раціональне використання великих н При наростанні фізичного навантаження використовуються вправи помірної, великої та максимальної інтенсивності. Навантажень.Для цього заздалегідь необхідно визначати фізичну працездатність', 'Фізіологічні зміни значні, але залежать від захворювання і стану хворого']
      }
    ];

    this.rehabilitationData.volumeOfRehabilitationMeasuresTable = [
      {checked: false, td: ['Процес реабілітації', 'Стаціонарне відділення']},
      {checked: false, td: ['Медикаментозна терапія', 'Медикаментозна терапія (як основний метод лікування)']},
      {
        checked: false,
        td: ['Кабінет ЛФК та інші спеціальні кабінети', 'Кінезитерапія у формі індивідуальної, малогрупової та групової лікувальної гімнастики. Масаж']
      },
      {checked: false, td: ['Психотерапія', 'Психотерапія у формі індивідуальних занять (із застосуванням мультимедійних засобів)']},
      {checked: false, td: ['Працетерапія', 'Самообслуговування']},
      {checked: false, td: ['Функції лікаря', 'Спостереження в динаміці лікарями ЛФК і ФТВ за виконанням окремих призначень']}
    ];

    this.rehabilitationData.periodsSequenceTitle = 'Послідовність періодів та відповідних їм режимів рухової активності на після лікарняному періоді реабілітації хворих за допомогою засобів фізичної реабілітації';
    this.rehabilitationData.volumeOfRehabilitationMeasuresTitle = 'Обсяг реабілітаційних заходів та функцій лікаря-реабілітолога залежно від варіанту дозування навантаження та рівня реабілітаційної допомоги (на основі Самосюк)';


    this.rehabilitationData.stepThreeTitle = 'Режими рухової активності в лікувальній фізкультурі';
    this.rehabilitationData.stepThreeStep = 'Крок 3. ';
    this.rehabilitationData.stepThreeTableSick = [
      {
        checked: false,
        td: ['Лікарняний режим', 'Вихідне положення', 'Кількість вправ', 'Кількість повторень', 'Темп', 'Амплітуда', 'Навантаження на м’язові групи', 'Зміни пульсу (максимально допустимі)', 'Форми ЛФК показані на режимі']
      },
      {
        checked: false,
        td: ['Ліжковий', 'лежачи', '8', '4-6', 'повільний', 'обмежена', 'дрібні', 'до +8', 'Лікувальна гімнастика, ранкова гігієнічна гімнастка, самостійні заняття.']
      },
      {
        checked: false,
        td: ['Ліжковий', 'лежачи', '8', '4-6', 'повільний', 'обмежена', 'дрібні', 'до +8', 'Лікувальна гімнастика, ранкова гігієнічна гімнастка, самостійні заняття.']
      },
      {
        checked: false,
        td: ['Палатний', 'лежачи, сидячи', '16', '6', 'середній', 'середня', 'дрібні, середні', 'до +16', 'Лікувальна гімнастика, ранкова гігієнічна гімнастка, самостійні заняття.']
      },
      {
        checked: false,
        td: ['Вільний', 'лежачи, сидячи, стоячи', '24', '8', 'середній і швидкий', 'повна', 'всі', 'до +24', 'Лікувальна гімнастика, ранкова гігієнічна гімнастка, самостійні заняття, піші прогулянки']
      }
    ];
    this.rehabilitationData.stepThreeTableHealth = [
      {
        checked: false,
        td: ['Режим', 'Метод проведення', 'Тривалість заняття', 'Вихідне положення', 'Кількість вправ', 'Кількість повторень', 'Темп', 'Амплітуда', ' Складність рухів ', 'Моторна щільність заняття', 'Інтенсивність навантаження', 'Ступінь силового зусилля', 'Допустима ЧСС.Пікова-Клапчук', 'Допустима ЧСС.Тренувальна-Ахмедж']
      },
      {
        checked: false,
        td: ['Щадний', 'Малогруповий', '20-25 хв з 2-4 паузами по.', 'Сидячи', '24', '8', 'Середній', 'обмежена', 'В одній-двох площинах послідовно. Середні суг-лоби та м”я-зові групи', 'До 60%', 'Помірна', 'Помірні силові зусилля. При захворюваннях ССС та дихальної системи натужування не показані', '100-130', 'До 110']
      },
      {
        checked: false,
        td: ['Щадно-тренувальний', 'Груповий', 'До 30 хв', 'Стоячи', '>24', '8', 'Усі види', 'Не обмежена', 'У всіх пло-щинах послі-довно. Усі суглоби та м”язові групи.Вправи на координацію', '60-70%', 'Середня', 'Помірні силові зусил-ля., у разі необхідності застосування засобів підвищення навантаження', '130-150', 'До 120']
      },
      {
        checked: false,
        td: ['Тренувальний', 'Груповий', '30-40 хв', 'Усі', 'Не обмежена', 'Не обмежена', 'Усі види', 'Не обмежена', 'У всіх пло-щинах. Усі суглоби та м”язові групи.Вправи на координацію рухів', '70-80%', 'Максимальна', 'Відповідно до рівня функціональних можливостей', '150-170', 'До 140']
      },
      {
        checked: false,
        td: ['Інтенсивно-тренувальний', 'Груповий', '1година', 'Усі', 'Не обмежена', 'Не обмежена', 'Усі види', '', 'У всіх пло-щинах. Усі суглоби та м”язові групи.Вправи на координацію рухів', '>80%', 'Максимальне', 'Відповідно до рівня функціональних можливостей', 'до 190 мінус вік', 'До 160']
      }
    ];


    this.rehabilitationData.stepFourTitle = 'Форми проведення процедури ЛФК показані на окремих режимах рухової активності';
    this.rehabilitationData.stepFourStep = 'Крок 4. ';
    this.rehabilitationData.stepFourTableSick = [
      {
        checked: false, td: ['Режим рухової активності',
          'РГ', 'ЛГ', 'СЗ', 'Масаж',
          'Механо-терапія', 'Фізіотерапія', 'Бальнео-терапія',
          'Мультимедійні засоби',
          'Теренкур', 'Біг', 'Туризм', 'Плавання',
          'Катання верхи на конях',
          'Катання на велосипеді',
          'Ігрові вправи',
          'Заняття на тренажерах',
          'Ходьба (Нордична)',
          'Праце-терапія']
      },
      {
        checked: false,
        td: ['Ліжковий', '+', '+', '+', '+', '', '', '', '-', '-', '-', '-', '-', '-', '-', '-', '-', '+', 'Самообслуговувальна']
      },
      {
        checked: false,
        td: ['Ліжковий', '+', '+', '+', '+', '', '', '', '-', '-', '-', '-', '-', '-', '-', '-', '-', '+', 'Самообслуговувальна']
      },
      {
        checked: false,
        td: ['Палатний', '+', '+', '+', '+', '', '', '', 'В межах палати', '-', '-', '-', '-', '-', '-', 'Настільні. Забавні', '-', '+', 'Самообслуговувальна, розважальна']
      },
      {
        checked: false,
        td: ['Вільний', '+', '+', '+', '+', '', '', '', 'В межах лікарняного закладу', '-', '-', '-', '-', '-', '-', 'Настільні. Забавні. Малорухомі', '+', '+', 'Самообслуговуанльна, розважальна Відновна']
      }
    ];
    this.rehabilitationData.stepFourTableHealth = [
      {
        checked: false,
        td: ['Режим рухової активності', 'РГ', 'ЛГ', 'СЗ', 'Масаж', 'Механо-терапія', 'Фізіотерапія', 'Бальнео-терапія', 'Мультимедійні засоби', 'Теренкур', 'Біг', 'Прогулянки ', 'Туризм', 'Плавання', 'Їзда на велосипеді', 'Катання верхи на велосипеді', 'Катання верхи на лижах', 'Ігрові вправи', 'Заняття на тренажерах', 'Ходьба (Нордична)', 'Гартування повітряні', 'Гартування сонячні', 'Праце-терапія']
      },
      {
        checked: false,
        td: ['Щадний', '+', '+', '+', '+', '', '', '', '+', '-', '-', '+', '-', '-', '-', '-', '-', 'Настільні. Забавні. Малорухомі', '+', '+', '+', '+', 'Розважальна, відновна']
      },
      {
        checked: false,
        td: ['Щадно-тренувальний', '+', '+', '+', '+', '', '', '', '-', '+', '+', '+', '+', '+', '+', '+', '+', 'Еементи спортивних ігор.Танці', '', '+', '+', '+', 'Відновна професійна']
      },
      {
        checked: false,
        td: ['Тренувальний', '+', '+', '+', '+', '', '', '', '+', '+', '+', '+', '+', '+', '+', '+', '+', 'Спортивні ігри.Танці', '+', '+', '+', '+', 'Професійна']
      },
      {
        checked: false,
        td: ['Інтенсивно-тренувальний', '+', '+', '+', '+', '', '', '', '+', '+', '+', '+', '+', '+', '+', '+', '+', 'Спортивні ігри.Танці', '+', '+', '+', '+', 'Професійна']
      }
    ];
    this.rehabilitationData.LFK = [undefined, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false];

    this.rehabilitationData.modeOfMotionActivity = [
      {
        checked: false,
        td: ['', 'Лікарняний режим', 'Стадія патологічного процесу', 'Основні завдання лікувальної фізкультури', 'Показання до призначення', 'Період курсу ЛФК', 'Режим рухової активності']
      },
      {
        checked: false,
        td: ['', 'Суворий ліжковий', 'Гостра', 'Спокій, максимальне зниження навантаження. Статичне (поглиблене) дихання.. Попередження ускладнень, зумовлених гіподинамією. Психологічний вплив.', 'Стабілізація стану хворого. Можливий психологічний контакт з хворим', 'Підготовчий', 'Значно обмежений']
      },
      {
        checked: false,
        td: ['', 'Розширений ліжковий', 'Гостра', 'Досягнення терапевтичного впливу на уражену систему чи орган. Тонізуючий (загальнотонізцючий та симптоматичний), трофічний, нормалізуючий, у разі необхідності – компенсаторний ваплив. Попередження ускладнень, зумовлених гіподина-мією. Активація рухової активності, підготовка до розширення режиму рухової активності.', 'Стабілізація клінічної симптоматики', 'Вступний', 'РР-I-Б']
      },
      {
        checked: false,
        td: ['', 'Палатний', 'Підгостра', 'Відновлення функції ураженої системи чи органу. Тонізуючий (загальнотонізцючий та симптоматичний), трофічний, нормалізуючий, у разі необхідності – компенсаторний ваплив Поступове збільшення наванта-ження, підготовка до розширення режиму рухової активності.', 'Ознаки зворотнього роз-витку клінічної симптоматики, адекватна реакція на попередні види фізичної активності', 'Основний', 'РР-II-А']
      },
      {
        checked: false,
        td: ['', 'Вільний', 'Реконвалесценція (або хрон. стадія)', 'Відновлення та удосконалення функції ураженої системи чи органу.Тонізуючий (загальнотонізцючий та симптоматичний), трофічний, нормалізуючий, у разі необхідності – компенсаторний ваплив. Поступове збіль-шення навантаження, підготовка до розширення режиму рухової активності. Розширення адаптації до навантаження. Підготовка до трудової діяльності.', 'Зворотній розвиток клінічної симптоматики, неповна ремісія захворювання, адекватна реакція на попередні види фізичної активності', 'Основний', 'РР-I']
      },
      {
        checked: false,
        td: ['', 'Щадний', 'Реконвалесценція (або стадія реміісії хронічної форми протікання захворювання)', 'Удосконалення функції ураженої системи чи органу. Розширення адаптації до навантаження. Відновлення втрачених функцій. Тонізуючий (загальнотонізцючий та симптоматичний), трофічний, нормалізуючий, у разі необхідності – компенсаторний ваплив. За показаннями – підготовка до наступних етапів реабілітації.Підготовка до трудової діяльності', 'Неповна ремісія захворювання. Адекватна реакція на попередні види фізичної активності', 'Основний', 'Щадний']
      },
      {
        checked: false,
        td: ['', 'Щадно-тренувальний', 'Реконвалесценція (або хр. Стадія, період ремісії)', 'Тонізуючий (загальнотонізцючий та симптоматич-ний), трофічний, нормалізуючий, у разі необхідності – компенсаторний вплив. Удосконалення діяльності серцево-судинної, дихальної та інших систем. Підвищення тонусу, тренованості та загартованості організму.При задовільній адаптації – підготовка до наступних етапів реабілітації. Підготовка до трудової діяльності', 'Період ремісії основ-ного захворювання.Порушення кровообігу та дихальна недостатність не вище 1 ступеня, особи старші 60 років.Адекватна реакція на попередні види фізичної активності', 'Основний', 'Щадно-тренувальний']
      },
      {
        checked: false,
        td: ['', 'Тренувальний', 'Здоровий (або хронічна стадія період ремісії)', 'Тонізуючий (загальнотонізцючий та симптоматичний), трофічний, нормалізуючий, у разі необхідності – компенсаторний вплив. Удосконалення діяльності серцево-судинної, дихальної та інших систем. Підвищення тонусу, тренованості та загартованості організму. Підготовка до трудової діяльності', 'Ліквдація патологіч-ного процесу або період ремісії основ-ного захворювання.Відсутність порушення кровообігу та дихальної недостатності. Адекватна реакція на попередні види фізичної активності', 'Заключний', 'Тренувальний']
      },
      {
        checked: false,
        td: ['', 'Інтенсивно тренувальний', 'Здоровий (або хронічна стадія. період ремісії', 'Тонізуючий (загальнотонізцючий та симптоматич-ний), трофічний, нормалізуючий, у разі необхідності – компенсаторний вплив Поступове збільшення навантаження. Розширення адаптації до навантаження. Підготовка до трудової діяльності.', 'Відсутність захворювань. Адекватна реакція на попередні види фізичної активності', 'Заключний', 'Інтенсивно тренувальний']
      }
      // { checked: false, td:["", "","","","","",""] }
    ];
    this.rehabilitationData.modeOfMotionActivityChecked = undefined;

    this.rehabilitationData.formsOfProcedureSickTitle = 'Форми проведення процедури лікувальної фізкультури та їх характерстика';
    this.rehabilitationData.formsOfProcedureSickTable = [
      {
        checked: false, td: ['Форми проведення процедури ЛФК',
          'Доступність За станом здоров’я',
          'Доступність За обладнанням',
          'Вибірковість впливу',
          'Легкість дозування',
          'Емоційність',
          'Природність',
          'Режими рухової активності']
      },
      {checked: false, td: ['Гімнастичні вправи', '', '', '', '', '', '', '']},
      {
        checked: false,
        td: ['Ранкова гігієнічна гімнастика', '+ +', '+ +', '- +', '+ +', '- +', '- +', 'Ліжковий, палатний, вільний, тренувальний']
      },
      {
        checked: false,
        td: ['Лікувальна гімнастика', '+ +', '+ +', '+ +', '+ +', '- -', '- -', 'Ліжковий, палатний, вільний, тренувальний']
      },
      {checked: false, td: ['Масаж', '+ +', '+ +', '+ +', '+ +', '+ +', '+ +', 'Ліжковий, палатний, вільний, тренувальний']},
      {checked: false, td: ['Спортивно-прикладні вправи', '', '', '', '', '', '', '']},
      {checked: false, td: ['Лікувальна ходьба', '- +', '+ +', '- -', '- +', '+ +', '+ +', 'Палатний, вільний, Тренувальний']},
      {checked: false, td: ['Теренкур', '- +', '+ -', '- -', '- -', '+ +', '+ +', 'Тренувальний']},
      {checked: false, td: ['Біг', '- +', '+ +', '- -', '+ -', '+ +', '+ +', 'Тренувальний']},
      {
        checked: false,
        td: ['Інші види (ближній туризм, дозоване плавання та ін.)', '- +', '- +', '- -', '- +', '+ +', '+ +', 'Тренувальний']
      },
      {checked: false, td: ['Ігрові вправи', '+ -', '+ -', '- -', '- -', '+ +', '- +', 'Палатний, вільний, тренувальний']},
      {checked: false, td: ['Заняття на тренажерах', '+ -', '+ -', '+ -', '+ +', '+ +', '+ +', 'Вільний, тренувальний']},
      {checked: false, td: ['Самостійні заняття', '+ +', '+ +', '+ +', '+ -', '- -', '+ -', 'Ліжковий, палатний, вільний, тренувальний']}
    ];
    this.rehabilitationData.formsOfProcedureSickNote = ['+ + - ознака характерна для розглянутої форми ЛФК',
      '+ - - для розглянутої форми ЛФК ознака не має універсального прояву',
      '- - - для розглянутої форми ЛФК ознака не має указаного прояву.'];

    this.rehabilitationData.formsOfProcedureHealthTitle = 'Загальні види тренувального режиму рухової активності';
    this.rehabilitationData.formsOfProcedureHealthSubTitle = 'Таблиця компонентів фізичного навантаження для здорових (Преварський Б.Л.та співавт.., 1998) з доповненнями (Вакуленко Д.В.)';
    this.rehabilitationData.formsOfProcedureHealthTableActive = false;
    this.rehabilitationData.formsOfProcedureHealthTable = [
      {
        checked: false,
        index: 0,
        tr0: 'Назва',
        td: ['Назва', 'Призначення', 'Режим I (щадний)', '', 'Режим II (щадно-тренувальний)', '', 'Режим III (тренувальний)', '', 'Режим IV (інтенсивно-тренувальний)<', ''],
      },
      {
        checked: false,
        index: 1,
        indexLFK: 11,
        tr0: 'Загальні повітряні ванни',
        td: ['Загальні повітряні ванни', 'ээт', '19-20 С', false, 'не нижче 20 С', false, 'Без обмежень', false, 'Без обмежень', false]
      },
      {
        checked: false,
        index: 2,
        indexLFK: 11,
        td: ['', 'Холодовая навантаження', 'Слабка (20-25 ккал)', false, 'Середня (30-35 ккал)', false, 'Сильна (40-45 ккал)', false, 'Сильна (40-50 ккал)', false]
      },
      {
        checked: false,
        index: 3,
        indexLFK: 11,
        tr0: 'Загальні повітряні ванни',
        td: ['', 'Середня експозиція', 'Від 15-20 до 30-80 мін', false, 'Від 20 мін до 1,5 година', false, 'Від 1 до 2 година', false, 'Від 1 до 2,5 година', false]
      },
      {
        checked: false,
        index: 4,
        indexLFK: 13,
        tr0: 'Купання в морі або відкритих водоймищах',
        td: ['Купання в морі або відкритих водоймищах', 'водоймищах	Т°С води', '>22°С', false, '>19 С', false, '16-17 С', false, '15-17 С', false]
      },
      {
        checked: false,
        index: 5,
        indexLFK: 13,
        tr0: 'Купання в морі або відкритих водоймищах',
        td: ['', 'Холодовая навантаження', 'Слабка (20-25 ккал)', false, '	Середня (30-35 ккал)', false, 'Сильна (до 45 ккал)', false, 'Сильна (до 50 ккал)', false]
      },
      {
        checked: false,
        index: 6,
        indexLFK: 13,
        tr0: 'Купання в морі або відкритих водоймищах',
        td: ['', 'Експозиція', '1-3 мін', false, '5-10 мін', false, '5-10 мін', false, '10-20 мін', false]
      },
      {
        checked: false,
        index: 7,
        indexLFK: 13,
        tr0: 'Купання в морі або відкритих водоймищах',
        td: ['', 'Темп плавання', 'Повільний', false, 'Повільний і середній', false, 'Середній', false, 'Середній і швидкий', false]
      },
      {
        checked: false,
        index: 8,
        tr0: 'Загальні сонячні ванни',
        td: ['Загальні сонячні ванни', 'Інтенсивність РЭЭТ=18-29 С', '5-20 кал 1/4-1 біодоза', false, '10-40 кал 1/2-2,5 біодози', false, '10-70 кал 1/2-3 біодози', false, '20-100 кал 2-5 біодоз', false]
      },
      {
        checked: false,
        index: 9,
        tr0: 'Загальні сонячні ванни',
        td: ['', 'Час доби', 'Ранок', false, 'Ранок', false, 'Окрім 12-15 година', false, 'Окрім 12-15 година', false]
      },
      {
        checked: false,
        index: 10,
        tr0: 'Місцеві сонячні ванни',
        td: ['Місцеві сонячні ванни', 'Інтенсивність', '50-60 кал', false, '60-80 кал', false, 'До 80 кал', false, 'До 100 кал', false]
      },
      {
        checked: false,
        index: 11,
        tr0: 'Уранішня гігієнічна гімнастика (РГГ)',
        td: ['Уранішня гігієнічна гімнастика (РГГ)', 'Метод', 'Роздільний', false, 'Роздільний і змішаний', false, 'Змішаний', false, 'Змішаний', false]
      },
      {
        checked: false,
        index: 12,
        tr0: 'Уранішня гігієнічна гімнастика (РГГ)',
        td: ['', 'Види вправ', 'Дихальні', false, 'Загальнофізичні до 16 вправ', false, 'Загально фізичні більше 16 вправ', false, 'Загальнофізичні-індивідуально', false]
      },
      {
        checked: false,
        index: 13,
        tr0: 'Уранішня гігієнічна гімнастика (РГГ)',
        td: ['', 'Тривалість', 'до 15 хв', false, '	15 хв', false, '20 хв', false, '20 хв', false]
      },
      {
        checked: false,
        index: 14,
        indexLFK: 2,
        tr0: 'Лікувальна гімнастика (ЛГ) — груповий метод',
        td: ['Лікувальна гімнастика (ЛГ) — груповий метод', 'Темп', 'Повільний', false, 'Середній', false, 'Середній, швидкий', false, 'Середній, швидкий', false]
      },
      {
        checked: false,
        index: 15,
        indexLFK: 2,
        tr0: 'Лікувальна гімнастика (ЛГ) — груповий метод',
        td: ['', 'Види вправ', 'Дихальні та для дрібних м’язових груп', false, 'Загально фізичні, комплекс «Здоровя»', false, 'Будь-які, включаючи стрибки, біг, тренажери', false, 'Будь-які, включаючи стрибки, біг, тренажери', false]
      },
      {
        checked: false,
        index: 16,
        indexLFK: 2,
        tr0: 'Лікувальна гімнастика (ЛГ) — груповий метод',
        td: ['', 'Тривалість', '20-30 хв, з 2-4 паузами по 3 хв', false, 'До 30 хв', false, '30-40 хв', false, '1 година', false]
      },
      {
        checked: false,
        index: 17,
        indexLFK: 19,
        tr0: 'Ходьба',
        td: ['Ходьба', 'Відстань', '2-3 км', false, '5 км', false, '12 км', false, 'До 25 км', false]
      },
      {
        checked: false,
        index: 18,
        indexLFK: 19,
        tr0: 'Ходьба',
        td: ['', 'Швидкість', '3-5 км/год (80-90 кр/хв)', false, '4-5 км/год (80-90 шаг/мин)', false, '5-6 км/ч 100-110 крг/хв', false, '5-6 км/ч до 120 шаг/мин', false]
      },
      {
        checked: false,
        index: 19,
        indexLFK: 9,
        tr0: 'Терренкур',
        td: ['Терренкур', 'Характер місцевості', 'Рівна', false, 'Пересічена', false, 'Пересічена', false, 'Пересічена', false]
      },
      {
        checked: false,
        index: 20,
        indexLFK: 9,
        tr0: 'Терренкур',
        td: ['', 'Кут підйому', 'До 5', false, '5-10', false, 'До 15', false, 'Більш 15', false]
      },
      {
        checked: false,
        index: 21,
        indexLFK: 9,
        tr0: 'Терренкур',
        td: ['', 'Відстань', 'До 3 км', false, 'До 5 км', false, 'До 12 км', false, 'До 25 км', false]
      },
      {
        checked: false,
        index: 22,
        indexLFK: 9,
        tr0: 'Терренкур',
        td: ['', 'Темп', '70-80 кр/хв з 2-3 паузами по 5 хв', false, '80-90 кр/хв. з 2-3 паузами по 5 хв', false, '5-6 км/год 100-110кр/хв)', false, '5-6 км/год (до 120кр/хв)', false]
      },
      {
        checked: false,
        index: 23,
        indexLFK: 9,
        tr0: 'Терренкур',
        td: ['', 'Характер, навантаження', 'Через кожні 4 дні збільшення', false, 'Через кожні 4 дні збільшення', false, 'Поступовий', false, 'Поступовий', false]
      },
      {
        checked: false,
        index: 24,
        indexLFK: 12,
        tr0: 'Ближній туризм',
        td: ['Ближній туризм', 'Частота', 'не показаний', false, '1 -2 раз/тижд', false, '1-3 денні походи', false, '3 денні походи', false]
      },
      {
        checked: false,
        index: 25,
        indexLFK: 12,
        tr0: 'Ближній туризм',
        td: ['', 'Відстань', 'не показаний', false, 'До 12 км', false, 'До 25-30 км', false, 'До 75-100 км', false]
      },
      {
        checked: false,
        index: 26,
        indexLFK: 12,
        tr0: 'Ближній туризм',
        td: ['', 'Висота', 'не показаний', false, 'До 600-800 м', false, 'До 2000 м', false, 'До 2000 м', false]
      },
      {
        checked: false,
        index: 27,
        indexLFK: 10,
        tr0: 'Біг',
        td: ['Біг', 'Тривалість', 'не показаний', false, 'не показаний', false, '6-15 хв', false, '6-15 хв', false]
      },
      {
        checked: false,
        index: 28,
        indexLFK: 10,
        tr0: 'Біг',
        td: ['', 'Швидкість', 'не показаний	', false, 'не показаний', false, '2 м/сек (140 кр/хв)', false, '2 м/сек (140 кр/хв)', false]
      },
      {
        checked: false,
        index: 29,
        indexLFK: 10,
        tr0: 'Біг',
        td: ['', 'Режим', 'не показаний', false, 'не показаний', false, 'Інтервальний', false, 'Інтервальний', false]
      },
      {
        checked: false,
        index: 30,
        indexLFK: 17,
        tr0: 'Ігри',
        td: ['Ігри', 'Тими', 'Повільний', false, 'Помірний', false, 'Без обмежень', false, 'Без обмежень', false]
      },
      {
        checked: false,
        index: 31,
        indexLFK: 17,
        tr0: 'Ігри',
        td: ['', 'Види', 'Кегельбан, крокет, кільцекид', false, 'Наст, теніс, волейбол, бадмінтон', false, 'Будь-які', false, 'Будь-які', false]
      },
      {
        checked: false,
        index: 32,
        indexLFK: 17,
        tr0: 'Ігри',
        td: ['', 'Тривалість', 'До 30 хв', false, 'До 50 хв', false, 'До 2 годин', false, 'До 2 годин', false]
      },
      {
        checked: false,
        index: 33,
        tr0: 'Енергообгрунтованість',
        td: ['Енергообгрунтованість', 'Енерговитрати', '100 ккал', false, '150-200 ккал', false, '260-300 ккал', false, '301-400 ккал', false]
      },
      {
        checked: false,
        index: 34,
        tr0: 'Енергообгрунтованість',
        td: ['', 'Належне макс, споживання О2', '25%', false, '26-39%', false, '40-59%', false, '60-75%', false]
      },
      {
        checked: false,
        index: 35,
        tr0: 'Граничний вік',
        td: ['', 'Граничний вік', 'Чоловіки -75р Жінки -70р', false, 'Чоловіки -65 р. Жінки -60р', false, 'Чоловіки -55р Жінки -50р', false, 'Чоловіки -50р Жінки -45р', false]
      },
      {
        checked: false,
        index: 36,
        indexLFK: 4,
        edit: true,
        tr0: 'Масаж',
        td: ['Масаж', '', '', false, '', false, '', false, '', false]
      },
      {
        checked: false,
        index: 37,
        indexLFK: 8,
        edit: true,
        tr0: 'Мультимедійні засоб',
        td: ['Мультимедійні засоб', '', '', false, '', false, '', false, '', false]
      }
    ];
    this.rehabilitationData.addFormsOfProcedureHealthTableRow = 'Додати рядок';
    this.rehabilitationData.formsOfProcedureHealthNote = ['1. Якщо хворий знаходиться на курортному лікуванні в теплий період року – виберіть відображені у таблиці форми ЛФК відповідно до визначеного вами режиму рухової активності.',
      '2. Якщо реабілітація проводиться на курорті не в теплий період року або в умовах поліклініки чи санаторію – виберіть доступні у ваших умовах засоби та методи реабілітації.'];

    this.rehabilitationData.medicalGymnastics = {};
    this.rehabilitationData.medicalGymnastics.patientCardTable = [
      {td: ['Дата', '', '']},
      {td: ['Програма реабілітації', '', '']},
      {td: ['Програма реабілітації', '', '']},
      {td: ['Показники', 'Скарги', '']},
      {td: ['до навантаження', 'Вимір', '']},
      {td: ['', 'Част. дих', '']},
      {td: ['', '	АТс', '']},
      {td: ['', 'АТд', '']},
      {td: ['', 'ЧСС', '']},
      {td: ['після навантаження', 'Вимір', '']},
      {td: ['', 'Част. дих', '']},
      {td: ['', 'АТс', '']},
      {td: ['', 'АТд', '']},
      {td: ['', 'ЧСС', '']},
      {td: ['через 3-5 хв.', 'Скарги', '']},
      {td: ['після навантаження', 'Вимір', '']},
      {td: ['', 'Част. дих', '']},
      {td: ['', 'АТс', '']},
      {td: ['', 'АТд', '']},
      {td: ['', 'ЧСС', '']},
      {td: ['', 'Озн.втоми', '']},
      {td: ['Час повного відновлення', '', '']},
      {td: ['ЕКГ', 'до навантаження', '']},
      {td: ['', 'після навантаження', '']},
      {td: ['Висновки щодо режиму', '', '']}
    ];
    this.rehabilitationData.medicalGymnastics.patientCardTableAddRow = 'Додоти рядки';
    this.rehabilitationData.medicalGymnastics.patientCardTableRemoveRow = 'Видалити рядки';
    this.rehabilitationData.medicalGymnastics.tasks = [
      ['Завдання 1. ', 'Відповідно до визначеного режиму рухової активності та форм проведення процедури лікувальної фізкультури ознайомтесь з методичними особливостями проведення процедури лікувальної гімнастики.'],
      ['Завдання 2. ', 'Перед початком кожної процедури вивчіть стан хворого до навантаження: - оцініть клінічні прояви захворювання, - визначте самопочуття хворого, - оцініть ступінь напруження регуляторних механізмів: порахуйте ЧСС, частоту дихання, виміряйте артеріальний тиск (та інші показники, характерні для вашого хворого: амплітуда активних чи пасивних рухів у суглобах, сила м’язів та ін.) у стані спокою.'],
      ['Завдання 3. ', 'Занесіть отримані показники до навантаження у реабілітаційну карту.'],
      ['Завдання 4. ', 'Виберіть комплекс вправ, показаний обстеженому залежно від режиму рухової активності та адаптаційного потенціалу і проведіть його з хворим.'],
      ['Завдання 5. ', 'Під час процедури лікувальної гімнастики необхідно проводити контроль стану хворого (лікарсько-педагогічні спостереження) за зовнішніми ознаками втоми, ЧСС, частоти дихання, АТ та ін.У разі необхідності – коректувати величину навантаження.'],
      ['Завдання 6. ', 'Вивчіть реакцію на фізичне навантаження - зверніть увагу на критерії оцінки зовнішніх ознак втоми під час занять та після них, - оцініть ступінь прояву зовнішніх ознак втоми: і відмітьте знаком „+” у нижній точці, - визначте показники кардіо-респіраторної системи (чи інші - показані хворому) зразу після навантаження, через 3 хвилини після нього та внесіть їх в реабілітаційну карту.'],
      ['Завдання 7. ', 'Оцініть реакцію на фізичне навантаження.'],
      ['Завдання 8. ', 'Зробіть висновок щодо адекватності навантаження та можливості подальшого розширення режиму рухової активності і відмітьте ваш вибір знаком „+”']
    ];
    this.rehabilitationData.medicalGymnasticsNote = 'Щодо оцінки скарг: при наявності скарг до навантаження, які входять в клінічні прояви захворювання і не є протипоказаннями до проведення реабілітації у відповідній графі відмітку не ставити. При появі після навантаження нових скрг у відповідних графах ставити знак „+”.';

    this.rehabilitationData.medicalGymnastics.chooseExercisesTitle = 'Вибрати комплекс вправ';
    this.rehabilitationData.medicalGymnastics.chooseExercisesP1 = [{checked: false}, {checked: false}, {checked: false}, {checked: false}, {checked: false}, {checked: false}];
    this.rehabilitationData.medicalGymnastics.chooseExercisesP2 = [{checked: false}, {checked: false}, {checked: false}, {checked: false}, {checked: false}];
    this.rehabilitationData.medicalGymnastics.chooseExercisesP3 = [{checked: false}, {checked: false}, {checked: false}, {checked: false}, {checked: false}];

    this.rehabilitationData.medicalGymnastics.externalSignsOfFatigueTitle = 'Зовнішні ознаки втоми';
    this.rehabilitationData.medicalGymnastics.externalSignsOfFatigueNote = '1.Визначте вище указані показники зразу після навантаження та через 3 хвилини після нього, зверніть увагу на наявність зовнішніх ознак втоми, внесіть їх в протокол. 2. Щодо оцінки зовнішніх ознак втоми: оцінити за ступенем проявів зовнішніх ознак втоми відповдіно до таблиці і вкажіть цифри 1.2.3.';
    this.rehabilitationData.medicalGymnastics.reactionAssessmentTitle = 'Оцінка реакції на процедуру';
    this.rehabilitationData.medicalGymnastics.reactionAssessmentNote = 'Частота дихання повинна змінюватися синхронно до зміни ЧСС: почастішання дихання: на один дихальний рух супроводжується збільшенням ЧСС на 3-4 удари і т. д.';
    this.rehabilitationData.medicalGymnastics.conclusionseTitle = 'Висновки щодо адекватності навантаження та можливості подальшого розширення режиму рухової активності';
    this.rehabilitationData.medicalGymnastics.conclusionseNote = 'Якщо за останню добу (навіть при адекватній реакції на навантаження попереднього дня) виникне погіршення стану, то (залежно від його клінічних проявів) навантаження необхідно зменшити або і відмінити.';

    this.rehabilitationData.multimediaLinkOneTitle = 'Мультимедійне психомоделююче середовище';
    this.rehabilitationData.multimediaLinkTwoTitle = 'детальніше (російською)';
    this.rehabilitationData.multimediaTitle = 'Про Мультимедійного психомоделюючого середовища';
    this.rehabilitationData.multimediaContent = [
      'Мультимедійний психомоделюючий проект «Зцілення і Гармонія»',
      'На цьому сайті розміщено унікальний проект створений спільно Центром «Гармонія», Тернопіль та Індійської школою Рейки м. Харків, Україна. Вперше в одному проекті зібрано таку велику кількість інновацій для здоров\'я, ось перелік деяких з них:',
      'У цьому проекті зібрані кращі можливості відео, голосу, музики, 3-д та мультимедіа програмування для максимально швидкої релаксації, відпочинку, зцілення і гармонізації псіхоемоціальной сфери.',
      'Чудові фото та відео матеріали переносять в красиві куточки світу, щоб наповнити Вас силою, прекрасним настроєм і радістю. Вони прекрасно резонують з аффірмациіями і допомагають свідомості наповнитися більш позитивним сприйняттям світу.',
      'Віртуозний голос і відкрите серце акторів створюють неповторну, комфортну атмосферу при перегляді проекту «Зцілення і гармонія».',
      'Рекомендації Майстрів оздоровчої системи Рейкі, Японія, послідовника засновника Рейкі Мікао Усуї, Ховайо Таката, досвід майстрів Рейки Центру «Гармонія» та Індійської школою Рейки дали мультимедійного проекту «Зцілення і Гармонія».',
      'Накопичений тисячолітній досвід в традиційній китайській медицині переданий в сочитании кольору, образів.',
      'Автор чудового тексту озвучених аффирмацій є засновник і керівник Індійської школи Рейки Харпріт Сінгх Хіра (Майстер Рейки, Доктор медицини, кандидат медичних наук, Керівник міжнародної організації «Advance Nutural Healing System») і весь проект благословенний його Вчителем Шанті Паркашем Гулатті, Індія.',
      'Керівництво та реалізацію мультимедійного проекту виконано кандидатом технічних наук, доцентом кафедри медичної інформатики, Тернопільського державного медичного університету ім. І. Горбачевського, координатором центру «Гармонія», Майстром Рейки, інструктором Чжун Юань цигун, Вакуленко Дмитром. Неоціненна допомога в реалізації проекту була мого колеги, Майстра Рейки, інструктора Чжун Юань цигун Михайлішина Олександра і колег з центру «Гармонія». Особлива подяка моєму Вчителю і наставнику Майстру Рейки Кондратенко Людмилі Іванівні. Мар\'яна Вакуленко, внесла в цей проект найтонші струни гармонії і любові.',
      'Проект «Зцілення і гармонія» складається з композицій «Загально оздоровчий сеанс», «Балансування енергії земля і космосу» і «Очищення» спрямованих на швидке відновлення сил, досягнення релаксації і рівноваги, зняття психоемоційного напруження відповідно.',
      'Композиції по системам спрямовані на більш глибоку псіхоемоціональную і енергетических корекцію.',
      'На світосприйняття сучасної людини впливає виховання, соціум, радіо, телебачення, інтернет, преса і т.д. Часто можна спостерігати, що після побаченого бойовика чи прочитаної книги у нього ще якийсь час з\'являються спогади про побачене або прочитане. Факторів впливу досить багато на світосприйняття - образи, асоціації, пам\'ять. З часом людини поглинає потік образів, думок і стомлюють його свідомість і весь організм. Багато факторів впливає на здоров\'я людини - погана екологія, харчування, гіподинамія і негармонійні образи і дії.',
      'Дисгармонійні образи часто є нав\'язливими, і прокручуються в свідомості людини тривалий час. Образи, сучасної людини, які наповнюють його свідомість, частіше приносять шкоди здоров\'ю людини. Прояви красивих образів та задіяння їх для зцілення себе і оточуючих часто є складним завданням. Практика Чжун Юань цигун є ефективною для підвищення якості образів у свідомості людини. З нашого досвіду також сприяє підвищенню якості образів перебування на природі, красива музика, позитивний настрій співрозмовника і гарні образи. Всі ці фактори допомагають людині ефективно використовувати отримані позитивні образи для допомоги собі і оточуючим.',
      'З метою первинної та вторинної профілактики захворювань, більш швидкої реабілітації. Для забезпечення максимального ефекту у створенні більш гармонійних образів, для поліпшення загального самопочуття і для гармонізації образів пов\'язаних з різними захворюваннями були використані наступні канали сприйняття: очі, вуха, тактильні сприйняття, асоціативний ряд, зони Захар\'їна - Геда.'
    ];


    this.rehabilitationData.selfExercises = {};
    this.rehabilitationData.selfExercises.patientCardTable = [
      {td: ['Дата', '', '']},
      {td: ['Програма реабілітації', '', '']},
      {td: ['Програма реабілітації', '', '']},
      {td: ['Показники', 'Скарги', '']},
      {td: ['до навантаження', 'Вимір', '']},
      {td: ['', 'Част. дих', '']},
      {td: ['', '	АТс', '']},
      {td: ['', 'АТд', '']},
      {td: ['', 'ЧСС', '']},
      {td: ['після навантаження', 'Вимір', '']},
      {td: ['', 'Част. дих', '']},
      {td: ['', 'АТс', '']},
      {td: ['', 'АТд', '']},
      {td: ['', 'ЧСС', '']},
      {td: ['через 3-5 хв.', 'Скарги', '']},
      {td: ['після навантаження', 'Вимір', '']},
      {td: ['', 'Част. дих', '']},
      {td: ['', 'АТс', '']},
      {td: ['', 'АТд', '']},
      {td: ['', 'ЧСС', '']},
      {td: ['', 'Озн.втоми', '']},
      {td: ['Час повного відновлення', '', '']},
      {td: ['ЕКГ', 'до навантаження', '']},
      {td: ['', 'після навантаження', '']},
      {td: ['Висновки щодо режиму', '', '']}
    ];
    this.rehabilitationData.selfExercises.patientCardTableAddRow = 'Додоти рядки';
    this.rehabilitationData.selfExercises.patientCardTableRemoveRow = 'Видалити рядки';


    this.rehabilitationData.selfExercises.patientTrainingAlgorithmTitle = 'Алгоритм підготовки хворого та проведення самостійних занять';
    this.rehabilitationData.selfExercises.patientTrainingAlgorithmTable = [
      {
        edit: false,
        td: ['', 'До навантаження', 'Після навантаження 1 хвилина', 'Після навантаження, через 3 хвилини', 'Після навантаження, час відновлення']
      },
      {edit: true, td: ['Критерії оцінки', {name: ''}, {name: ''}, {name: ''}, {name: ''}]},
      {edit: true, td: ['Самопочуття', {name: ''}, {name: ''}, {name: ''}, {name: ''}]},
      {edit: true, td: ['Частота серцевих скорочень', {name: ''}, {name: ''}, {name: ''}, {name: ''}]},
      {edit: true, td: ['Частота дихання', {name: ''}, {name: ''}, {name: ''}, {name: ''}]},
      {edit: true, td: ['Ознаки втоми', {name: ''}, {name: ''}, {name: ''}, {name: ''}]},
      {edit: true, td: ['Висновки щодо адекватності навантаження', {name: ''}, {name: ''}, {name: ''}, {name: ''}]}
    ];
    this.rehabilitationData.selfExercises.patientTrainingAlgorithmNote = ['1.Визначте вище указані показники зразу після навантаження та через 3 хвилини після нього, зверніть увагу на наявність зовнішніх ознак втоми, внесіть їх в протокол.', '2. Щодо оцінки зовнішніх ознак втоми: оцінити за ступенем проявів зовнішніх ознак втоми відповдіно до таблиці і вкажіть цифри 1.2.3.'];


    this.rehabilitationData.selfExercises.reactionToProcedureTitle = 'Оцінка реакції на процедуру';
    this.rehabilitationData.selfExercises.reactionToProcedureTable = [
      {
        selected: undefined,
        td: ['', 'Допустима зміна досліджуваних показників після занять фізичним вправами при адекватному навантаженні', 'Аналіз даних']
      },
      {
        selected: {name: 'норма'},
        td: ['Самопочуття', 'Задовільне (відсутня поява скарг та погіршення стану хворого)', [{name: 'вище норми'}, {name: 'норма'}]]
      },
      {
        selected: {name: 'норма'},
        td: ['Частота серцевих скорочень (ЧСС)', 'Збільшується не більше, ніж на :А) 8 уд/хв. при ліжковому режимі (на 10%), Б) 16 уд/хв при палатному режимі (на 20%), В) 24 уд/хв при вільному режимі (на 30%)', [{name: 'вище норми'}, {name: 'норма'}]]
      },
      {
        selected: {name: 'норма'},
        td: ['Частота дихальних рухів', 'Збільшується не більше, ніж на 4-8 дихальних рухи (залежно від режиму): А) на ліжковому режимі (на 10%), Б) на палатному режимі (на 20%), В) на вільному режимі (на 30%)', [{name: 'вище норми'}, {name: 'норма'}]]
      },
      {
        selected: {name: 'норма'},
        td: ['Артеріальний тиск (АТ)', 'Систолічний АТ підвищується не більше, ніж: А) на ліжковому режимі (на 10%), Б) на палатному режимі (на 20%), В) на вільному режимі (на 30%). Діастолічний тиск – залишається незмінним або знижується не більше, ніж на 10 мм рт. ст', [{name: 'вище норми'}, {name: 'норма'}]]
      },
      {
        selected: {name: 'норма'},
        td: ['Час відновлення показників', 'У хворих на ліжковому, напівліжковому, вільному режимі час відновлення усіх показників - 3-5 хв.', [{name: 'вище норми'}, {name: 'норма'}]]
      },
      {
        selected: {name: 'норма'},
        td: ['Електрокардіографічний контроль', 'Відсутність негативної динаміки на ЕКГ.', [{name: 'вище норми'}, {name: 'норма'}]]
      }
    ];
    this.rehabilitationData.selfExercises.reactionToProcedureNote = 'Частота дихання повинна змінюватися синхронно до зміни ЧСС: почастішання дихання: на один дихальний рух супроводжується збільшенням ЧСС на 3-4 удари і т. д.';


    this.rehabilitationData.selfExercises.adequacyConclusionsTitle = 'Висновки щодо адекватності навантаження та можливості подальшого розширення режиму рухової активності';
    this.rehabilitationData.selfExercises.adequacyConclusionsTable = [
      {
        checked: undefined,
        td: ['Динаміка досліджуваних показників після навантаження та час їх відновлення', 'Адекватність навантаження', 'Рекомендації щодо подальшого режиму рухової активності', '']
      },
      {
        checked: false,
        td: ['Усі показники змінюються в межах допустимих коливань', 'Навантаження адекватне', 'Розширення режиму рухової активності', '']
      },
      {
        checked: false,
        td: ['Один із досліджуваних показників незначно відхиляється від меж допустимих', 'Навантаження частково неадекватне', 'Розширення режиму рухової активності не показане-навантаження повторити', '']
      },
      {
        checked: false,
        td: ['Декілька із досліджуваних показників відхиляється від меж допустимих', 'Навантаження неадекватне (свідчення неправильно підібраного фізичного навантаження)', '', 'Навантаження необхідно зменшити або і відмінити']
      },
    ];
    this.rehabilitationData.selfExercises.adequacyConclusionsNote = 'Якщо за останню добу (навіть при адекватній реакції на навантаження попереднього дня) виникне погіршення стану, то (залежно від його клінічних проявів) навантаження необхідно зменшити або і відмінити.';


    this.rehabilitationData.massage = {};
    this.rehabilitationData.massage.taskOne = 'Якщо за останню добу (навіть при адекватній реакції на навантаження попереднього дня) виникне погіршення стану, то (залежно від його клінічних проявів) навантаження необхідно зменшити або і відмінити.';
    this.rehabilitationData.massage.taskTwo = 'Якщо за останню добу (навіть при адекватній реакції на навантаження попереднього дня) виникне погіршення стану, то (залежно від його клінічних проявів) навантаження необхідно зменшити або і відмінити.';
    this.rehabilitationData.massage.stepOne = 'Крок 1. Призначення масажу';
    this.rehabilitationData.massage.stepOneContraindicationsNote = 'Протипоказання до призначення масажу. Т-тимчасові; П-постійні; Л-локальні протипоказання (для масажу окремих ділянок тіла).';
    this.rehabilitationData.massage.stepOneContraindications = {
      selected: ['Протипоказання до призначення масажу відсутні'], max: 0, checked: 0,
      radiobuttons: [
        {name: 'Масаж показаний - без обмежень', value: 0},
        {name: 'Масаж показаний - з обмеженнями масажу окремих ділянок', value: 1},
        {name: 'Масаж не показаний - тимчасово', value: 2},
        {name: 'Масаж не показаний - постійно', value: 3}
      ],
      items: [
        'Протипоказання до призначення масажу відсутні',
        'Т-загальний тяжкий стан хворого при різних захворюваннях і травмах;',
        'Т-температура тіла більше 37,5°С;',
        'Т-гострий запальний процес, гострі респіраторні вірусні захворювання',
        'Т-збільшення та наростання швидкості осідання еритроцитів (ШОЕ)',
        'Т-наявність гнійних процесів в організмі',
        'Т-гострий період захворювання: порушення мозкового кровообігу, інфаркт міокарда, гіпертонічна криза та ін.',
        'Т-активна фаза туберкульозу',
        'Т-загострення захворювань кишечника, нудота, блювання',
        'Т-стани, що вимагають невідкладного оперативного втручання',
        'Т-захворювання лімфатичних судин та вузлів',
        'Т-гострі алергічні стани, набряк Квінке',
        'Т-виражений больовий синдром',
        'Т-кровотеча та небезпека кровотечі',
        'Т-захворювання вегетативної нервової системи (гангліоніт, діенцефальний криз)',
        'Т-психічні захворювання, що утруднюють контакт із хворим',
        'Т-період місячних та вагітності у жінок',
        'Т-наявність сторонніх тіл біля магістральних судин та нервових сплетень',
        'Т-у спортсменів – стан вираженої перевтоми та збудження',
        'П-тяжкий стан хворого, що супроводжується наростанням серцево-судинної, дихальної, печінкової, ниркової та інших недостатностей',
        'П-новоутворення, у тому числі доброякісні',
        'П-тромбофлебіти, тромбози судин, варикозне розширення вен з трофічними порушеннями',
        'П-септичний стан',
        'П-захворювання крові, кровоточивість',
        'П-бронхоектатична хвороба в стадії тканинного розпаду',
        'П-сифіліс II-III',
        'П-ступеня та інші гострі венеричні хвороби',
        'П-виражений склероз судин головного мозку зі схильністю до тромбоутворення та кровотеч',
        'Л-захворювання шкіри, нігтів, волосистої частини голови інфекційного, грибкового та невизначеного характеру, різні шкірні висипання, пошкодження, подразнення шкіри',
        'Л-наявні порушення цілості кісток або небезпека їх виникнення',
        'Л-варикозно розширені вени (без трофічних порушень)',
        'Л-наявність іммобілізації, пов’язок',
        'Л-міжлопаткова ділянка зліва при захворю-ваннях серця'
      ]
    };
    this.rehabilitationData.massage.mainTable = [
      {
        label: 'За призначенням', type: {
          selected: 1, values: [
            {value: 0, name: '-'},
            {value: 1, name: 'лікувальний'},
            {value: 2, name: 'гігієнічний'},
            {value: 3, name: 'спортивний'},
            {value: 4, name: 'косметичний'}
          ]
        }
      },
      {
        label: 'За засобами впливу', type: {
          selected: 1, values: [
            {value: 0, name: '-'},
            {value: 1, name: 'виконують руками (мануальний масаж)'},
            {value: 2, name: 'апаратами (апаратний масаж)'},
            {value: 3, name: 'гідромасаж'},
            {value: 4, name: 'пневмомасаж'},
            {value: 5, name: 'вібромасаж'}
          ]
        }
      },
      {
        label: 'Залежно від того, хто виконує масаж', type: {
          selected: 1, values: [
            {value: 0, name: '-'},
            {value: 1, name: 'масажист'},
            {value: 2, name: 'сам пацієнт (самомасаж)'}
          ]
        }
      },
      {
        label: 'За видом', type: {
          selected: 0, values: [
            {value: 0, name: '-'},
            {value: 1, name: 'класичний масаж'},
            {value: 2, name: 'сегментарно-рефлекторний масаж'}
          ]
        }
      },
      {
        label: 'За впливом на організм', type: {
          selected: 0, values: [
            {value: 0, name: '-'},
            {value: 1, name: 'заспокійливий, (розслаблювальний чи релаксуючий)'},
            {value: 2, name: 'збудливий (стимулюючий чи тонізуючий)'}
          ]
        }
      }
    ];
    this.rehabilitationData.massage.stepTwo = 'Крок 2. Ділянка масажу.';
    this.rehabilitationData.massage.taskSix = 'Ознайомтесь з механізмом впливу масажу залежно від його виду. Виберіть показаний хворому вид масажу.';
    this.rehabilitationData.massage.noteSix = 'Cегментарно-рефлекторнй масаж більш ефективний, бо має як патогенетичний, рефлекторний, так і симптоматичний і місцевий вплив, тому його використано для подальшого вибору.';
    this.rehabilitationData.massage.tableSix = [
      {td: [{value: '', type: 'text'}, {value: '1', type: 'text'}, {value: '2', type: 'text'}, {value: 'Вкажіть', type: 'text'}]},
      {
        selected: '1',
        td: [{value: 'Критерії оцінки', type: 'text'}, {value: 'Класичний масаж', type: 'text'}, {
          value: 'Сегментарно-рефлекторний масаж',
          type: 'text'
        }, {type: 'select', values: ['1', '2']}]
      },
      {
        selected: '1',
        td: [{value: 'Механізм впливу', type: 'text'}, {
          value: 'Місцевий, симптоматичний',
          type: 'text'
        }, {value: 'Патогенетичний, рефлекторний, симптоматичний, місцевий', type: 'text'}, {type: 'select', values: ['1', '2']}]
      }
    ];
    this.rehabilitationData.massage.checkboxSeven = {
      ckecked: false,
      name: 'Ознайомтесь з ділянками впливу при сегментарно-рефлекторному методі масажу'
    };
    this.rehabilitationData.massage.checkboxSevenOne = {
      ckecked: false,
      name: 'Для визначення ділянки хребта і прихребтових зон, що підлягають впливу залежно від діагнозу виберіть сегменти хребта, з яких іннервується „хворий” орган'
    };
    this.rehabilitationData.massage.titleSevenOne = 'Сегментарна іннервація внутрішніх органів та кінцівок (за О. Глезером, В.А. Даліхо, 1965)';
    this.rehabilitationData.massage.tableSevenOne = [
      {checked: undefined, td: ['Орган', 'Спинномозковий сегменти', 'Відмітка']},
      {checked: false, td: ['Легені та бронхи', 'С3-С4, T3-T9', '']},
      {checked: false, td: ['Серце', 'С3-С4 зліва, T1-T6 зліва', '']},
      {checked: false, td: ['Стравохід', 'T3-T5 з обох боків', '']},
      {checked: false, td: ['Тонкий кишечник', 'С3-С4, T9-T2', '']},
      {checked: false, td: ['Висхідна кишка', 'T9-L1', '']},
      {checked: false, td: ['Пряма кишка', 'T11-T12, L1-L2', '']},
      {checked: false, td: ['Апендикс', 'C3-C4, T11-T12 справа', '']},
      {checked: false, td: ['Печінка, жовчний міхур', 'C3-C4, T6-T10 справа', '']},
      {checked: false, td: ['Підшлункова залоза', 'C3-C4, T7-T9 зліва', '']},
      {checked: false, td: ['Нирки, сечоводи', 'C4, T10-L2', '']},
      {checked: false, td: ['Сечовий міхур', 'T11-L2, S2-S4', '']},
      {checked: false, td: ['Матка', 'T10-L3', '']},
      {checked: false, td: ['Яєчник, придатки матки', 'T10-L3', '']},
      {checked: false, td: ['Яєчко', 'T12-L3', '']},
      {checked: false, td: ['Молочна залоза', 'T4-T6', '']},
      {checked: false, td: ['Шлунок', 'C3-C4, T5-T9 зліва', '']},
      {checked: false, td: ['Захворювання та травматичні пошкодженнях верхніх кінцівок', 'С7–C3, D6–D1', '']},
      {checked: false, td: ['Захворювання та травматичні пошкодженнях нижніх кінцівок', 'S5–S1, L5–L1, D12–D10', '']}
    ];
    this.rehabilitationData.massage.noteSevenOne = '1 С – шийні, 2 T – грудні, 3 L – поперекові, 4 S – крижові спинномозкові сегменти.';
    this.rehabilitationData.massage.titleSevenTwo = 'Зони іннервації спинномозкових сегментів (за О. Глезером, В.А. Даліхо, 1965)';
    this.rehabilitationData.massage.tableSevenTwo = [
      {checked: undefined, td: ['', 'Шкіра', 'М’язи', 'Відмітка']},
      {checked: false, td: ['С.1', 'Потилиця, потилична ділянка', 'Дрібні м’язи потилиці', '']},
      {checked: false, td: ['С.2-3', 'Потилиця, потилична ділянка, шия', 'Шийні м’язи, трапецієподібний', '']},
      {
        checked: false,
        td: ['С.4', 'Потилична ділянка, нижня поверхня шиї, над ключицями', 'Драбинчасті, діафрагма, піднімаючий лопатку, велика і мала ромбоподібні, над-і підостьові', '']
      },
      {
        checked: false,
        td: ['С.5', 'Потилична ділянка, ділянка ключиць, передня поверхня надпліччя, згинальна поверхня плеча і передпліччя до зап’ястка', 'Дельтоподібний, двохголовий,плечовий, плече-променевий, супінатор, великий і мала грудні, над-і підостьові', '']
      },
      {
        checked: false,
        td: ['С.6', 'Ділянка потилиці, зовнішня поверхня плеча надпліччя і плеча, латеральна поверхня передпліччя, включаючи великий палець', 'Великий і малий грудні, найширший м’яз спини, великий круглий, під-лопатковий, дельтоподібний, зубчастий, пронатор, триголовий', '']
      },
      {
        checked: false,
        td: ['С.7', 'Задня поверхня надпліччя, плеча і передпліччя, згинальна і розгинальна поверхні ІІ і ІІІ пальців', 'Розгиначі променево-зап’ясткового суглобу і пальців, згиначі променево-зап’ясткового суглобу', '']
      },
      {
        checked: false,
        td: ['С.8', 'Над лопаткою, медіальна поверхня плеча і передпліччя, включаючи IV і V пальці.', 'Довгий розгинач і згинач пальців', '']
      },
      {
        checked: false,
        td: ['Т.1', 'Ззаду косо до пахвової ямки, спереду – майже горизонтально нижче ключиць, згинальна поверхня плеча і передпліччя', 'Дрібні м’язи кисті і пальців', '']
      },
      {
        checked: false,
        td: ['Т.2-6', 'По спині, починаючи від черепа, в напрямку назовні і вниз, спереду майже горизонтально', 'М’язи спини, міжреброві м’язи', '']
      },
      {
        checked: false,
        td: ['Т.7-9', 'Починаючи від VII–IX грудних хребців косо вниз і назовні, спереду від VII ребра і до місця дещо вище пупка', 'М’язи спини, м’язи черевної спинки', '']
      },
      {
        checked: false,
        td: ['Т.10-12', 'Ззаду Х-ХІІ грудних хребців косо вниз в назовні, спереду від рівня пупка до місця вище пупартової зв’язки	', '', '']
      },
      {
        checked: false,
        td: ['L.1', 'Від I поперекового хребця косо вниз і назовні, пахвинна ділянка, ділянка сечового міхура', 'Нижні м’язи черевної стінки', '']
      },
      {
        checked: false,
        td: ['L.2', 'Від ІІ поперекового хребця до гребеня здухвинної кістки. На стегні зверху ззовні досередини по ходу кравецького м’яза', 'Здухвинно-поперековий м’яз, який піднімає яєчко, чотирьохголовий м’яз стегна', '']
      },
      {
        checked: false,
        td: ['L.3', 'Від ІІІ поперекового хребця через верхню третину гребеня здухвинної кістки по ходу кравецького м’яза до внутрішньої поверхні коліна і верхньої третини внутрішньої поверхні гомілки', 'Здухвинно-поперековий, чотирьохголовий м’яз стегна, аддуктори стегна, м’язи, що ротують стегно до середини', '']
      },
      {
        checked: false,
        td: ['L.4', 'Від ІV поперекового хребця до головки великого вертлюга ззаду, середня зовнішня третина стегна, передня поверхня колінного суглоба, середня внутрішня третина гомілки', 'Чотирьохголовий м’яз стегна, розгинач гомілки', '']
      },
      {
        checked: false,
        td: ['L.5', 'Від V поперекового хребця через сідниці, задньозовнішня поверхня стегна до зовнішньої поверхні колінного суглобу, по гомілці до тильної поверхні стопи із захопленням І- ІV пальців. На підошві тільки внутрішній край із захпленням І пальця', 'Середня і мала сідничні, напівперетичнастий, напівсухожильний, двоголовий м’яз стегна. м’яз, що напружує широку фасцію стегна, передній великогомілковий', '']
      },
      {
        checked: false,
        td: ['S.1', 'Від верхнього краю куприка поверх сідниць, середня третина стегна ззаду, наколінок, задньозовнішня половина гомілки, підошва, підошовна поверхня ІІ-V пальців, тильна поверхня V пальця, зовнішній край стопи', 'Велика сіднична, грушоподібний, квадраний м’яз стегна, розгинач ноги, передній великогомілковий, малогомілковий, довгий розгинач великого пальця', '']
      },
      {
        checked: false,
        td: ['S.2', 'Середня частина куприка, сідниці, задньовнутрішня поверхня стегна і гомілки до внутрішнього виростка', 'Триголоваий м’яз гомілки, розгинач і згинач ве-ликого пальця, задній великогомілковий, дрібні м’язи стопи', '']
      },
      {
        checked: false,
        td: ['S.3', 'Внутрішня поверхня сідниці, промежина, мошонка, статевий член', 'Перонеальні м’язи, поперековосмугасті м’язи сечового канала, прямої кишки і статевих органів, сфінктери', '']
      }
    ];
    this.rehabilitationData.massage.noteSevenTwo = '1 С – шийні, 2 T – грудні, 3 L – поперекові, 4 S – крижові спинномозкові сегменти.';
    this.rehabilitationData.massage.checkboxSevenTwo = {
      ckecked: false,
      name: 'Відповідно до діагнозу і визначеної вами сегментарної іннервації уражених органів чи кінцівок виберіть рефлексогенні зони шкіри і м’язів (ділянки тіла, органи і тканини, що отримують іннервацію з тих же сегментів спинного мозку, що і хворий орган), що підлягають впливу'
    };
    this.rehabilitationData.massage.checkboxSevenThree = {ckecked: false, name: 'Сам „хворий” орган (ділянка тіла, яка турбує хворого)'};

    this.rehabilitationData.massage.stepThree = 'Крок 3. Метод масажу.';
    this.rehabilitationData.massage.taskEight = 'Визначте метод впливу залежно від клінічних проявів захворювання.';
    this.rehabilitationData.massage.tableEight = [
      {
        selected: undefined,
        td: [{value: 'Ознаки', type: 'text'}, {
          value: 'Рекомендовано - заспокійливий масаж',
          type: 'text'
        }, {value: 'Рекомендовано - збудливий масаж', type: 'text'}, {value: 'Виберіть', type: 'text'}]
      },
      {
        selected: '',
        td: [{value: 'Характер і форма захворювання', type: 'text'}, {
          value: 'Гостра форма, початкова стадія, період видужання',
          type: 'text'
        }, {value: 'Хронічна хвороба', type: 'text'}, {type: 'select', values: ['Заспокійливий масаж', 'Збудливий масаж']}]
      },
      {
        selected: '',
        td: [{
          value: 'Стан хворого',
          type: 'text'
        }, {
          value: 'Підвищення функцій (підвищення тонусу м’язів, підвищення секреції, підвищення артеріального тиску), больовий синдром. Відсутність функцій (паралічі). При безсонні, виснаженні нервової системи масажувати дуже обережно',
          type: 'text'
        }, {value: 'Пониження функцій (атонія, гіпотонія, парези, зниження секреції та ін.)', type: 'text'}, {
          type: 'select',
          values: ['Заспокійливий масаж', 'Збудливий масаж']
        }]
      },
      {
        selected: '',
        td: [{value: 'Алергічна готовність організму', type: 'text'}, {value: 'Алергічні хвороби', type: 'text'}, {
          value: 'Не призначають',
          type: 'text'
        }, {type: 'select', values: ['Заспокійливий масаж', 'Збудливий масаж']}]
      },
      {
        selected: '',
        td: [{
          value: 'а) підвищується тонуу симпато-адреналової системи',
          type: 'text'
        }, {
          value: 'Підвищення тонусу судин, м’язів, гіпертонія, спастичні коліти, судоми м’язів, збудження нервової системи',
          type: 'text'
        }, {value: 'Не призначають', type: 'text'}, {type: 'select', values: ['Заспокійливий масаж', 'Збудливий масаж']}]
      },
      {
        selected: '',
        td: [{value: 'б) понижується тонус симпато-адреналової системи', type: 'text'}, {
          value: 'Не призначають',
          type: 'text'
        }, {value: 'Гіпотонічні стани, атонія кишечника, зниження тонусу м’язів, астенічний синдром', type: 'text'}, {
          type: 'select',
          values: ['Заспокійливий масаж', 'Збудливий масаж']
        }]
      }
    ];
    this.rehabilitationData.massage.taskNine = 'Визначте інтенсивність впливу залежно від індивідуальних особливостей.';
    this.rehabilitationData.massage.tableNine = [
      {
        selected: undefined,
        td: [{value: 'Індивідуальні ознаки', type: 'text'}, {
          value: 'Рекомендовано - слабший вплив',
          type: 'text'
        }, {value: 'Рекомендовано - сильніший вплив', type: 'text'}, {value: 'Виберіть', type: 'text'}]
      },
      {
        selected: '',
        td: [{value: 'Стать', type: 'text'}, {value: 'Жінкам', type: 'text'}, {value: 'Чоловікам', type: 'text'}, {
          type: 'select',
          values: ['Слабший вплив', 'Сильніший вплив']
        }]
      },
      {
        selected: '',
        td: [{value: 'Вік', type: 'text'}, {value: 'Дітям, особам старшого віку', type: 'text'}, {
          value: 'Дорослим',
          type: 'text'
        }, {type: 'select', values: ['Слабший вплив', 'Сильніший вплив']}]
      },
      {
        selected: '',
        td: [{value: 'Тілобудова, фізична сила', type: 'text'}, {
          value: 'Астенікам, фізично слабшим',
          type: 'text'
        }, {value: 'Здоровим, фізично сильним', type: 'text'}, {type: 'select', values: ['Слабший вплив', 'Сильніший вплив']}]
      },
      {
        selected: '',
        td: [{value: 'Місце проживання', type: 'text'}, {value: 'Жителям міста', type: 'text'}, {
          value: 'Сільським жителям',
          type: 'text'
        }, {type: 'select', values: ['Слабший вплив', 'Сильніший вплив']}]
      },
      {
        selected: '',
        td: [{value: 'Професія', type: 'text'}, {value: 'Робітникам розумової праці', type: 'text'}, {
          value: 'Робітникам фізичної праці',
          type: 'text'
        }, {type: 'select', values: ['Слабший вплив', 'Сильніший вплив']}]
      },
      {
        selected: '',
        td: [{value: 'Характер', type: 'text'}, {value: 'Вразливим', type: 'text'}, {
          value: 'Сильним, відкритим, незалежним',
          type: 'text'
        }, {type: 'select', values: ['Слабший вплив', 'Сильніший вплив']}]
      },
      {
        selected: '',
        td: [{
          value: 'Відношення до температури зовнішнього середовища',
          type: 'text'
        }, {
          value: 'Схильність до прохолодних ванн, пагана переносимість спеки',
          type: 'text'
        }, {value: 'Схильність до гарячих ванн, легка переносимість спеки', type: 'text'}, {
          type: 'select',
          values: ['Слабший вплив', 'Сильніший вплив']
        }]
      },
      {
        selected: '',
        td: [{value: 'Шкіра', type: 'text'}, {
          value: 'Еластична, тонка, помірно волога, швидка гіперемія	',
          type: 'text'
        }, {value: 'Товста, суха, слабка гіперемія', type: 'text'}, {type: 'select', values: ['Слабший вплив', 'Сильніший вплив']}]
      },
    ];
    this.rehabilitationData.massage.stepFour = 'Крок 4. Процедура массажу.';
    this.rehabilitationData.massage.taskTen = 'Визначте тривалість процедури массажу залежно від обраної ділянки масажу та масажних одиниць. Розрахункові норми часу в умовних одиницях на виконання масажних процедур. (Додаток № 4 до наказу Міністерства охорони здоров’я України від “_30__’ __ХII______1993, № 260).';
    this.rehabilitationData.massage.noteTen = 'За одну умовну масажну одиницю прийнята масажна процедура (безпосереднє проведення масажу), на виконання якої потрібно 10 хв.';
    this.rehabilitationData.massage.tableTen = [
      {checked: undefined, td: ['Найменування масажної процедури', 'Умовні масажні одиниці', 'Тривалість процедури (хв)', 'Вкажіть']},
      {checked: false, td: ['Масаж голови (лобно-скроневої та потилично-тім’яної ділянок)', '1.0', '10', '']},
      {checked: false, td: ['Масаж обличчя (лобової, приочної, верхньо- і нижньо-щелепної ділянок)', '1.0', '10', '']},
      {checked: false, td: ['Масаж шиї', '1.0', '10', '']},
      {
        checked: false,
        td: ['Масаж комірцевої зони (задньої та бічної поверхні шиї, спини до рівня IV грудного хребця, передньої поверхні грудної клітки до II ребра)', '1.5', '15', '']
      },
      {checked: false, td: ['Масаж верхньої кінцівки', '1.5', '15', '']},
      {checked: false, td: ['Масаж верхньої кінцівки, надпліччя та ділянки лопатки', '2.0', '20', '']},
      {
        checked: false,
        td: ['Масаж плечового суглоба (верхньої третини плеча, ділянки плечового суглоба та надпліччя однойменної масажу)', '1.0', '10', '']
      },
      {
        checked: false,
        td: ['Масаж ліктьового суглоба (верхньої третини передпліччя, ділянки ліктьового суглоба та нижньої третини плеча)', '1.0', '10', '']
      },
      {
        checked: false,
        td: ['Масаж променевозап’ясткового суглоба (проксимального відділу кисті, променевозап’ясткового суглоба та передпліччя)', '1.0', '10', '']
      },
      {checked: false, td: ['Масаж кисті та передпліччя', '1.0', '10', '']},
      {
        checked: false,
        td: ['Масаж ділянки грудної клітки (ділянки передньої поверхні грудної клітки від передніх меж надпліч до ребрових дуг в ділянці спини, від VII шийного до I поперекового хребця)', '2.5', '25', '']
      },
      {
        checked: false,
        td: ['Масаж спини (від VII шийного до I поперекового хребця і від лівої до правої середньої аксилярної лінії), у дітей – включаючи попереково-крижову ділянку', '1.5', '15', '']
      },
      {checked: false, td: ['Масаж м’язів передньої черевної стінки', '1.0', '10', '']},
      {checked: false, td: ['Масаж попереково-крижової ділянки (від I поперекового хребця до нижніх сідничних складок)', '1.0', '10', '']},
      {checked: false, td: ['Сегментарний масаж попереково-крижової ділянки', '1.5', '15', '']},
      {
        checked: false,
        td: ['Масаж спини і поперекового відділу (від VII шийного хребця до крижів, від лівої до правої середньої аксилярної лінії)', '1.5', '15', '']
      },
      {
        checked: false,
        td: ['Масаж шийно-грудного відділу хребта (ділянки задньої поверхні шиї та ділянки спини до поперекового хребця, від лівої до правої задньої аксилярної лінії)', '2.0', '20', '']
      },
      {checked: false, td: ['Сегментарний масаж шийно-грудного відділу хребта', '3.0', '30', '']},
      {
        checked: false,
        td: ['Масаж ділянки хребта (ділянки задньої поверхні шиї, спини і попереково-крижової ділянки, від лівої до правої задньої аксилярної лінії)', '2.5', '25', '']
      },
      {
        checked: false,
        td: ['Масаж нижньої кінцівки та попереку (ділянки стопи, гомілки, стегна, сідничної та попереково-крижової ділянки)', '2.0', '20', '']
      },
      {checked: false, td: ['Масаж нижньої кінцівки', '1.5', '15', '']},
      {
        checked: false,
        td: ['Масаж тазостегнового суглоба (верхньої третини стегна, ділянки тазостегнового суглоба та сідничної ділянки однойменної сторони)', '1.0', '10', '']
      },
      {
        checked: false,
        td: ['Масаж колінного суглоба (верхньої третини гомілки, ділянки колінного суглоба та нижньої третини стегна)', '1.0', '10', '']
      },
      {
        checked: false,
        td: ['Масаж гомілковостопного суглоба (проксимального відділу стопи, ділянки гомілкового суглоба та нижньої третини гомілки)', '1.0', '10', '']
      },
      {checked: false, td: ['Масаж стопи та гомілки.', '1.0', '10', '']},
      {checked: false, td: ['Загальний масаж (у дітей грудного та молодшого дошкільного віку)', '3.0', '30', '']},
      {checked: undefined, td: ['Сума', '', '', '']},
    ];

    this.rehabilitationData.massage.taskEleven = 'Визначте курс лікування масажем залежно від перебігу захворювання.';
    this.rehabilitationData.massage.tableEleven = [
      {checked: undefined, td: ['', 'Тривалість курсу', 'Показання для призначення', 'Завдання масажу', 'Вкажіть']},
      {
        checked: false,
        td: ['Малий', '10-12 процедур', 'У хворих з гострим перебігом захворювання', 'Зменшити гостроту перебігу захворювання, прискорити видужання', '']
      },
      {checked: false, td: ['Середній', '14-16 процедур', 'Переважна більшість захворювань', 'Прискорення видужання', '']},
      {
        checked: false,
        td: ['Максимальний', '16-20 процедур', 'При хронічних процесах і тяжкому перебігу захворювань', 'Ліквідація або зменшення клінічних проявів захворювання, прискорення та підтримання ремісії, попередження рецидивів захворювання', '']
      }
    ];
    this.rehabilitationData.massage.stepFive = 'Крок 5. Рекомендації масажисту щодо проведення процедури масажу.';
    this.rehabilitationData.massage.taskTwelve = 'Ознайомтеся з технікою виконання окремих прийомів массажу.';
    this.rehabilitationData.massage.tableTwelve = [
      ['Прийом', 'Контакт зі шкірою', 'Рухи рук', 'Кут нахилу рук (в градусах)', 'Вплив'],
      ['Погладжування', 'Руки рухаються по поверхні шкіри', 'Не зміщують шкіру', '0', 'На шкіру'],
      ['Розтирання', 'Руки щільніше прилягають до поверхні шкіри', 'Зміщують шкіру в складку', '30', 'На шкіру, підшкірну основу'],
      ['Розминання', 'Руки щільно прилягають до поверхні шкіри', 'Рухаються разом зі шкірою', '45', 'На шкіру, підшкірну основу, м’язи'],
      ['Вібрація-безперервна', 'Руки щільно прилягають до поверхні тіла', 'Рухаються коливальними рухами разом з підлеглими тканинами', 'Чим більший кут, тим сильніший вплив', 'На всі підлеглі тканини'],
      ['Вібрація-переривчаста', 'Руки періодично відриваються від поверхні тіла, щоб нанести наступний удар', 'Наносять періодичні удари', 'Чим більший кут, тим сильніший вплив', 'На всі підлеглі тканини']
    ];

    this.rehabilitationData.massage.taskThirteen = 'Ознайомтеся з впливом окремих прийомів масажу.';
    this.rehabilitationData.massage.tableThirteen = [
      {
        selected: undefined,
        td: [{value: '', type: 'text'}, {value: 'Вплив - заспокійливий', type: 'text'}, {
          value: 'Вплив - збудливий',
          type: 'text'
        }, {value: 'Виберіть', type: 'text'}]
      },
      {
        selected: '',
        td: [{value: 'Погладжування', type: 'text'}, {value: 'поверхневе', type: 'text'}, {value: 'глибоке', type: 'text'}, {
          type: 'select',
          values: ['заспокійливий', 'збудливий']
        }]
      },
      {
        selected: '',
        td: [{value: 'Розтирання', type: 'text'}, {value: 'спокійне', type: 'text'}, {value: 'інтенсивне', type: 'text'}, {
          type: 'select',
          values: ['заспокійливий', 'збудливий']
        }]
      },
      {
        selected: '',
        td: [{value: 'Розминання', type: 'text'}, {value: 'спокійне', type: 'text'}, {value: 'інтенсивне', type: 'text'}, {
          type: 'select',
          values: ['заспокійливий', 'збудливий']
        }]
      }
    ];

    this.rehabilitationData.massage.taskFourteen = 'Визначте шляхи досягнення збуджувального та заспокійливого впливу.';
    this.rehabilitationData.massage.tableFourteen = [
      {
        selected: undefined,
        td: [{value: 'Характеристика впливу', type: 'text'}, {value: 'Заспокійливий вплив', type: 'text'}, {
          value: 'Збудливий вплив',
          type: 'text'
        }, {value: 'Виберіть', type: 'text'}]
      },
      {
        selected: '',
        td: [{value: 'Сила впливу', type: 'text'}, {
          value: 'З меншою силою',
          type: 'text'
        }, {value: 'Чим сильніший вплив, тим більш збудливий вплив', type: 'text'}, {
          type: 'select',
          values: ['Заспокійливий', 'Збудливий']
        }]
      },
      {
        selected: '',
        td: [{value: 'Швидкість рухів', type: 'text'}, {value: 'Повільні рухи', type: 'text'}, {
          value: 'Швидкі рухи',
          type: 'text'
        }, {type: 'select', values: ['Заспокійливий', 'Збудливий']}]
      },
      {
        selected: '',
        td: [{value: 'Швидкість зміни сили впливу', type: 'text'}, {
          value: 'Поступове наростання сили впливу',
          type: 'text'
        }, {value: 'Швидке наростання сили впливу', type: 'text'}, {type: 'select', values: ['Заспокійливий', 'Збудливий']}]
      },
      {
        selected: '',
        td: [{value: 'Амплітуда рухів', type: 'text'}, {value: 'Мала амплітуда', type: 'text'}, {
          value: 'Велика амплітуда',
          type: 'text'
        }, {type: 'select', values: ['Заспокійливий', 'Збудливий']}]
      },
      {
        selected: '',
        td: [{value: 'Тривалість виконання окремих прийомів', type: 'text'}, {
          value: 'Довготривалий',
          type: 'text'
        }, {value: 'Короткотривалий', type: 'text'}, {type: 'select', values: ['Заспокійливий', 'Збудливий']}]
      },
      {
        selected: '',
        td: [{value: 'Частота рухів', type: 'text'}, {value: 'Мала або надвисока частота', type: 'text'}, {
          value: 'Велика частота',
          type: 'text'
        }, {type: 'select', values: ['Заспокійливий', 'Збудливий']}]
      },
      {
        selected: '',
        td: [{value: 'Ділянка впливу', type: 'text'}, {value: 'Велика', type: 'text'}, {value: 'Мала', type: 'text'}, {
          type: 'select',
          values: ['Заспокійливий', 'Збудливий']
        }]
      },
      {
        selected: '',
        td: [{value: 'Глибина впливу', type: 'text'}, {value: 'Глибокий вплив', type: 'text'}, {
          value: 'Поверхневий вплив',
          type: 'text'
        }, {type: 'select', values: ['Заспокійливий', 'Збудливий']}]
      }
    ];
    this.rehabilitationData.massage.taskFiveteen = 'Виберіть план проведення процедури масажу залежно від завдань.';
    this.rehabilitationData.massage.tableFiveteen = {
      header: ['', 'Період процедури - заспокійливий', 'Період процедури - збудливий'],
      body: [
        [
          ['Вступний(10%часу)', 'Погладжування поверхневе', 'Погладжування поверхневе'],
          ['', 'Спокійне розтирання', 'Спокійне розтирання'],
          ['', 'Розтирання спокійне поверхневе', 'Розтирання спокійне поверхневе'],
          ['', 'Погладжування поверхневе', 'Погладжування глибоке']
        ],
        [
          ['Основний(80%часу)', 'Розтирання спокійне глибоке', 'Розтирання спокійне глибоке'],
          ['', 'Розтирання спокійне глибоке', 'Розтирання інтенсивне глибоке'],
          ['', 'Розминання поверхневе', 'Розминання поверхневе'],
          ['', 'Розминання глибоке спокійне', 'Розминання глибоке спокійне'],
          ['', 'Розминання глибоке спокійне', 'Розминання глибоке інтенсивне'],
          ['', 'Розминання глибоке спокійне', 'Переривчаста вібрація'],
          ['', 'Безперервна вібрація заспокійлива', 'Переривчаста вібрація'],
          ['', 'езперервна вібрація заспокійлива', 'Безперервна вібрація інтенсивна']
        ],
        [
          ['Заключний(10%часу)', 'Спокійне глибоке розминання', 'Спокійне глибоке розминання'],
          ['', 'Спокійне розминання', 'Спокійне розминання'],
          ['', 'Спокійне розминання', 'Спокійне розминання'],
          ['', 'Спокійне розминання', 'Спокійне розминання']
        ]
      ],
      footer: ['Сума', '', '']
    };

    this.rehabilitationData.massage.taskSixteen = 'Cхема проведення масажу показаного хворому в залежності від завдань масажу.';
    this.rehabilitationData.massage.radiogroupSixteen = {
      checked: 0,
      radiobuttons: [
        {name: 'Заспокійлива методика', value: 0},
        {name: 'Помірно-заспокійлива методикою', value: 1},
        {name: 'Збудлива методика', value: 2},
        {name: 'Помірно-збудлива методика', value: 3},
        {name: 'Гармонізуюча методика', value: 4}
      ]
    };


    this.rehabilitationData.massage.noteSixteen = 'Основні ознаки спокійно виконаного прийому: рухи повільні, довготривалі, з поступово змінюваним зусиллям; інтенсивно виконаного прийому: рухи швидкі, короткотривалі, з швидкозмінюваними зусиллям. Заспокійлива (збудлива) методика - 80-100%. Помірно-заспокійлива методика - 65-80%. Помірно-збудлива методика - 65-80%. Гармонізуюча методика - 35-60%.';


    this.rehabilitationData.massage.setCalmingOrStimulating = () => {
      // if(this.rehabilitationData.massage.mainTable[4].type.selected===1){ // 1===заспокійливий, 2===збудливий
      this.rehabilitationData.massage.tableEight.map((d) => {
        d.selected = this.rehabilitationData.massage.mainTable[4].type.selected === 2 ? 'Збудливий масаж' : 'Заспокійливий масаж';
      });
      this.rehabilitationData.massage.tableNine.map((d) => {
        d.selected = this.rehabilitationData.massage.mainTable[4].type.selected === 2 ? 'Сильніший вплив' : 'Слабший вплив';
      });
      this.rehabilitationData.massage.tableThirteen.map((d) => {
        d.selected = this.rehabilitationData.massage.mainTable[4].type.selected === 2 ? 'збудливий' : 'заспокійливий';
      });
      this.rehabilitationData.massage.tableFourteen.map((d) => {
        d.selected = this.rehabilitationData.massage.mainTable[4].type.selected === 2 ? 'Збудливий' : 'Заспокійливий';
      });
      this.rehabilitationData.massage.tableFiveteen.footer[1] = this.rehabilitationData.massage.mainTable[4].type.selected === 2 ? 0 : 24;
      this.rehabilitationData.massage.tableFiveteen.footer[2] = this.rehabilitationData.massage.mainTable[4].type.selected === 2 ? 24 : 0;
      this.rehabilitationData.massage.radiogroupSixteen.checked = this.rehabilitationData.massage.mainTable[4].type.selected === 2 ? 2 : 0;
    };
    this.rehabilitationData.massage.updateCalmingOrStimulatingCount = () => {
      let calming = 0;
      let stimulating = 0;
      // if(this.rehabilitationData.massage.mainTable[4].type.selected===1){ // 1===заспокійливий, 2===збудливий
      this.rehabilitationData.massage.tableEight.map((d, i) => {
        if (i == 0) {
          return;
        }
        if (d.selected === 'Збудливий масаж') {//"Заспокійливий масаж"
          stimulating++;
        } else {
          calming++;
        }
      });
      this.rehabilitationData.massage.tableNine.map((d, i) => {
        if (i == 0) {
          return;
        }
        if (d.selected === 'Сильніший вплив') {//"Слабший вплив";
          stimulating++;
        } else {
          calming++;
        }
      });
      this.rehabilitationData.massage.tableThirteen.map((d, i) => {
        if (i == 0) {
          return;
        }
        if (d.selected === 'збудливий') {//"заспокійливий";
          stimulating++;
        } else {
          calming++;
        }
      });
      this.rehabilitationData.massage.tableFourteen.map((d, i) => {
        if (i == 0) {
          return;
        }
        if (d.selected === 'Збудливий') {//"Заспокійливий";
          stimulating++;
        } else {
          calming++;
        }
      });
      this.rehabilitationData.massage.tableFiveteen.footer[1] = calming;
      this.rehabilitationData.massage.tableFiveteen.footer[2] = stimulating;
      let vrSp = (calming / 24) * 100;
      if (vrSp >= 80) {
        this.rehabilitationData.massage.radiogroupSixteen.checked = 0;
      } else if (vrSp >= 65 && vrSp < 80) {
        this.rehabilitationData.massage.radiogroupSixteen.checked = 1;
      } else if (vrSp >= 35 && vrSp < 65) {
        this.rehabilitationData.massage.radiogroupSixteen.checked = 4;
      } else if (vrSp <= 20) {//(vrZb>=80)
        this.rehabilitationData.massage.radiogroupSixteen.checked = 2;
      } else if (vrSp > 20 && vrSp < 35) {//(vrZb>60 && vrZb<80)
        this.rehabilitationData.massage.radiogroupSixteen.checked = 3;
      }
    };
    this.rehabilitationData.morningGymnasticsNav = 'Ранкова гімнастика';
    this.rehabilitationData.medicalGymnasticsNav = 'Лікувальна гімнастика';
    this.rehabilitationData.selfExercisesNav = 'Самостійні заняття';
    this.rehabilitationData.massageNav = 'Масаж';
    this.rehabilitationData.multimediaNav = 'Мультимедійні засоби';


    // --------------------------getEfficiencyData--------------------------
    this.efficiencyData.defaultNote = 'Примітка: ';
    this.efficiencyData.defaultTask = 'Завдання';
    this.efficiencyData.tasks = ['Завдання 1. У випадку адекватної реакції на попередні види фізичного навантаження вивчіть та оцініть готовність хворого до розширення режиму рухової активності на стаціонарному періоді реабілітації. З цією метою проведіть аналіз досліджуваних показників безпосередньо до та після фізичного навантаження за одним (або декількома, за показаннями) із ступних методів', 'Завдання 2. Виберіть метод оцінки функціональних можливостей одним або декількома із наступних методів'];

    this.efficiencyData.robinsonIndexNav = 'Індекс Робінсона';
    this.efficiencyData.baevskyTestNav = 'Адаптаційний потенціал (за Р.М. Баєвським)';
    this.efficiencyData.sbpHrNav = 'За показниками систолічний систолічний тиск та ЧСС';
    this.efficiencyData.orthostaticTestNav = 'Ортостатична проба';
    this.efficiencyData.kerdoIndexNav = 'Індекс Кердо';
    this.efficiencyData.physicalCapacityNav = 'Визначення фізично працездатності';
    this.efficiencyData.martineKushelevskyTestNav = 'Проба Мартіне-Кушелевського';
    this.efficiencyData.ruffieTestNav = 'Проба Руф’є';
    this.efficiencyData.apanasenkoTestNav = 'Рівень ФЗ за Г.Л. Апанасенком';
    this.efficiencyData.skibinskayaIndexNav = 'Індекс Скибинської';
    this.efficiencyData.klabchukIndexNav = 'КОРЗ за Клапчука';


    this.efficiencyData.robinsonIndex = {};
    this.efficiencyData.robinsonIndex.tasks = ['Визначте енергетичний потенціал серцево-судинної системи до та після навантаження за формулою: ІР = (ЧСС + САТ) / 100, де ЧСС - частота серцевих скорочень за 1 хв, АТС – систолічний тиск (мм.рт.ст.).', 'Ознайомтеся методами оцінки енергетичного потенціалу за індексом Робінсона.', 'Внесіть отримані показники в нижню строчку таблиці і зробіть висновки щодо подальшого режиму рухової активності хворого.'];
    this.efficiencyData.robinsonIndex.table = [
      {
        type: 'text',
        td: [{value: '', type: 'text'}, {value: 'до', type: 'text'}, {value: 'після', type: 'text'}, {value: '3-5хв', type: 'text'}]
      },
      {
        type: 'edit',
        td: [{value: 'Вид навантаження', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]
      },
      {
        type: 'edit',
        td: [{value: 'Сигнал', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]
      },
      {type: 'date', td: [{value: 'Дата', type: 'text'}, {value: '', type: 'date'}, {value: '', type: 'date'}, {value: '', type: 'date'}]},
      {type: 'edit', td: [{value: 'ЧСС', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'АТС', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {
        type: 'text',
        td: [{value: 'Індекс Робінсона', type: 'text'}, {value: '', type: 'text'}, {value: '', type: 'text'}, {value: '', type: 'text'}]
      },
      {
        type: 'text',
        td: [{value: 'Висновки', type: 'text'}, {value: '', type: 'text'}, {value: '', type: 'text'}, {value: '', type: 'text'}]
      },
      {
        type: 'edit',
        td: [{value: 'Рекомендації', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]
      }
    ];
    this.efficiencyData.robinsonIndex.addColumns = 'Додати стовбці';
    this.efficiencyData.robinsonIndex.removeColumns = 'Видалити стовбці';
    this.efficiencyData.robinsonIndex.calculateColumns = 'Порахувати';
    this.efficiencyData.robinsonIndex.calculate = function (value: number): string {
      if (value < 70) {//зсув вегетативного тонусу в сторону симпатичного преобладания
        return 'Відмінний. Функціональні резерви серцево-судиної системи високі';
      } else if (value >= 70 && value < 84) {
        return 'Добрий. Функціональні резерви серцево-судиної в нормі';
      } else if (value >= 85 && value < 94) {
        return 'Середній. Можна говорити про недостатні функціональні можливості серцево-судиної систем';
      } else if (value >= 95 && value < 111) {
        return 'Поганий. Ознаки порушення регуляції діяльності серцево-судиної систем';
      } else {
        return 'Дуже поганий. Регуляція діяльності серцево-судиної систем порушена';
      }
    };


    this.efficiencyData.baevskyTest = {};
    this.efficiencyData.baevskyTest.tasks = ['Визначте адаптаційний потенціал серцево-судинної системи до та після навантаження: АП = 0,011ЧСС + 0,014САТ + 0,008ДАТ + 0,014В + 0,009МТ - 0,009Р - 0,27, де ЧСС - частота серцевих скорочень за 1 хв, АТС – систолічний тиск (мм.рт.ст.), АТД – діастолічний тиск (мм.рт.ст.), В – вік (років), МТ – маса тіла (кг), Р – зріст (см).', 'Оцініть отримані показники адаптаційного потенціалу до та після навантаження.', 'Виберіть дату дослідження та вид навантаження.Виберіть або внесіть показники в таблицю і зробіть висновки щодо подальшого режиму рухової активності хворого.', 'Порівняйте отримані показники адаптаційного потенціалу до та після навантаження (табл. 15 ), зробіть висновки щодо його динаміки та подальшого режиму рухової активності хворого.'];
    this.efficiencyData.baevskyTest.table = [
      {
        type: 'text',
        td: [{value: '', type: 'text'}, {value: 'до', type: 'text'}, {value: 'після', type: 'text'}, {value: '3-5хв', type: 'text'}]
      },
      {
        type: 'edit',
        td: [{value: 'Вид навантаження', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]
      },
      {
        type: 'edit',
        td: [{value: 'Сигнал', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]
      },
      {type: 'date', td: [{value: 'Дата', type: 'text'}, {value: '', type: 'date'}, {value: '', type: 'date'}, {value: '', type: 'date'}]},
      {type: 'edit', td: [{value: 'Вік', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'Стать', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'Зріст', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {
        type: 'edit',
        td: [{value: 'Маса тіла', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]
      },
      {type: 'edit', td: [{value: 'ЧСС', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'АТС', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'АТД', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'АП', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {
        type: 'text',
        td: [{value: 'Оцінка', type: 'text'}, {value: '', type: 'text'}, {value: '', type: 'text'}, {value: '', type: 'text'}]
      },
      {
        type: 'text',
        td: [{value: 'Висновки', type: 'text'}, {value: '', type: 'text'}, {value: '', type: 'text'}, {value: '', type: 'text'}]
      },
      {
        type: 'edit',
        td: [{value: 'Рекомендації', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]
      }
    ];
    this.efficiencyData.baevskyTest.addColumns = 'Додати стовбці';
    this.efficiencyData.baevskyTest.removeColumns = 'Видалити стовбці';
    this.efficiencyData.baevskyTest.calculateColumns = 'Порахувати';
    this.efficiencyData.baevskyTest.calculate = function (value: number): string[] {
      if (value < 2.6) {
        return ['задовільно', 'Відповідно до режиму рухової активності, без обмежень'];
      } else if (value >= 2.6 && value < 3.1) {
        return ['напруження механізмів адаптації', 'Відповідно до режиму рухової активності, з незначними обмеженнями'];
      } else if (value >= 3.1 && value < 3.5) {
        return ['незадовільна адаптація', 'Відповідно до режиму рухової активності, зі значними обмеженнями'];
      } else {
        return ['зрив механізмів адаптації', 'Тимчасово не показана'];
      }
    };


    this.efficiencyData.sbpHr = {};
    this.efficiencyData.sbpHr.tasks = ['Використайте показники систолічного тиску (СТ) та частоти серцевих скорочень (ЧСС) до та після фізичного навантаження та вставте їх у формули: СТ = 100 * (СТр - СТсп) / СТсп. ЧСС = 100 * (ЧССр - ЧССсп) / ЧССсп, де СТсп, ЧССсп — систолічний тиск та частота серцевих скорочень в стані спокою. СТр, ЧССр — ті ж показники після виконаної роботи', 'Оцініть отримані результати відповідно до таблиці, виберіть варіант подальшого режиму та відмітьте його у останньому стовпчику таблиці знаком „+”.'];
    this.efficiencyData.sbpHr.table = [
      {type: 'text', td: [{value: '', type: 'text'}, {value: 'до', type: 'text'}, {value: 'після', type: 'text'}]},
      {type: 'edit', td: [{value: 'Вид навантаження', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'Сигнал', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {type: 'date', td: [{value: 'Дата', type: 'text'}, {value: '', type: 'date'}, {value: '', type: 'date'}]},
      {type: 'edit', td: [{value: 'ЧСС', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'АТС', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {
        type: 'text',
        colspan: true,
        td: [{value: 'Показник (ЧСС)', type: 'text'}, {value: '', type: 'text', colspan: true}, {value: '', type: 'text', colspan: true}]
      },
      {
        type: 'text',
        colspan: true,
        td: [{value: 'Показник (АТC)', type: 'text'}, {value: '', type: 'text', colspan: true}, {value: '', type: 'text', colspan: true}]
      },
      {
        type: 'text',
        colspan: true,
        td: [{value: 'Характеристика стану ССС', type: 'text'}, {value: '', type: 'text', colspan: true}, {
          value: '',
          type: 'text',
          colspan: true
        }]
      },
      {
        type: 'text',
        colspan: true,
        td: [{value: 'Оцінка реакції', type: 'text'}, {value: '', type: 'text', colspan: true}, {value: '', type: 'text', colspan: true}]
      },
      {
        type: 'text',
        colspan: true,
        td: [{value: 'Рекомендації', type: 'text'}, {value: '', type: 'text', colspan: true}, {value: '', type: 'text', colspan: true}]
      }
    ];
    this.efficiencyData.sbpHr.addColumns = 'Додати стовбці';
    this.efficiencyData.sbpHr.removeColumns = 'Видалити стовбці';
    this.efficiencyData.sbpHr.calculateColumns = 'Порахувати';
    this.efficiencyData.sbpHr.calculate = function (value: number): string[] {
      if (value > 5) {
        return ['Адаптація до навантаження відбувається переважно за рахунок збільшення систолічного тиску', 'Сприятлива', 'Розширити'];
      } else if (value < -5) {
        return ['Адаптація до навантаження відбувається переважно за рахунок збільшення частоти серцевих скорочень', 'Несприятлива', 'Залишити попередній'];
      } else {
        return ['Адаптація до навантаження відбувається переважно за рахунок збільшення частоти серцевих скорочень як частоти серцевих скорочень так і систолічного тиску', 'Задовільна', 'Зменшити або відмінити'];
      }
    };


    this.efficiencyData.kerdoIndex = {};
    this.efficiencyData.kerdoIndex.tasks = ['Індекс Кердо: V.I. = (1 - АТД / ЧСС) * 100, де ЧСС - частота серцевих скорочень за 1 хв, АТД – діастолічний тиск (мм.рт.ст.).'];
    this.efficiencyData.kerdoIndex.table = [
      {
        type: 'text',
        td: [{value: '', type: 'text'}, {value: 'до', type: 'text'}, {value: 'після', type: 'text'}, {value: '3-5хв', type: 'text'}]
      },
      {
        type: 'edit',
        td: [{value: 'Вид навантаження', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]
      },
      {
        type: 'edit',
        td: [{value: 'Сигнал', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]
      },
      {type: 'date', td: [{value: 'Дата', type: 'text'}, {value: '', type: 'date'}, {value: '', type: 'date'}, {value: '', type: 'date'}]},
      {type: 'edit', td: [{value: 'ЧСС', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'АТД', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {
        type: 'text',
        td: [{value: 'Індекс Кердо', type: 'text'}, {value: '', type: 'text'}, {value: '', type: 'text'}, {value: '', type: 'text'}]
      },
      {
        type: 'text',
        td: [{value: 'Висновки', type: 'text'}, {value: '', type: 'text'}, {value: '', type: 'text'}, {value: '', type: 'text'}]
      },
      {
        type: 'edit',
        td: [{value: 'Рекомендації', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]
      }
    ];
    this.efficiencyData.kerdoIndex.addColumns = 'Додати стовбці';
    this.efficiencyData.kerdoIndex.removeColumns = 'Видалити стовбці';
    this.efficiencyData.kerdoIndex.calculateColumns = 'Порахувати';
    this.efficiencyData.kerdoIndex.calculate = function (value: number): string {
      if (value >= 0) {
        return 'переважання симпатичної с-ми';
      } else {
        return 'переважання парасимпатичної с-ми';
      }
    };


    this.efficiencyData.orthostaticTest = {};
    this.efficiencyData.orthostaticTest.tasks = ['Визначте ЧСС, АТ в положення лежачи та після переходу у положення стоячи.', 'Визначте різницю в ЧСС між показниками до та після навантаження.', 'Визначте пульсовий тиск (різницю між систолічним та діастолічним тиском). Зареєструйте та оцініть отримані показники.', 'Зробіть висновки щодо отриманих результатів ортостатичної проби.'];
    this.efficiencyData.orthostaticTest.table = [
      {
        type: 'text',
        td: [{value: '', type: 'text'}, {value: 'до', type: 'text'}, {value: 'після', type: 'text'}, {
          value: 'різниця',
          type: 'text'
        }, {value: 'висновки', type: 'text'}]
      },
      {
        type: 'edit',
        td: [{value: 'Вид навантаження', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {
          value: '',
          type: 'text'
        }, {value: '', type: 'text'}]
      },
      {
        type: 'edit',
        td: [{value: 'Сигнал', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'text'}, {
          value: '',
          type: 'text'
        }]
      },
      {
        type: 'date',
        td: [{value: 'Дата', type: 'text'}, {value: '', type: 'date'}, {value: '', type: 'date'}, {value: '', type: 'text'}, {
          value: '',
          type: 'text'
        }]
      },
      {
        type: 'edit',
        td: [{value: 'ЧСС', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'text'}, {
          value: '',
          type: 'text'
        }]
      },
      {
        type: 'edit',
        td: [{value: 'АТС', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'text'}, {
          value: '',
          type: 'text'
        }]
      },
      {
        type: 'edit',
        td: [{value: 'АТД', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'text'}, {
          value: '',
          type: 'text'
        }]
      },
      {
        type: 'edit',
        td: [{value: 'Пульсовий тиск', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {
          value: '',
          type: 'text'
        }, {value: '', type: 'text'}]
      },
      {
        type: 'edit',
        td: [{value: 'Вегетативні реакції', type: 'text'}, {
          value: '-',
          type: 'select',
          values: [{value: '-'}, {value: 'пітливість'}, {value: 'інше'}]
        }, {value: '-', type: 'select', values: [{value: '-'}, {value: 'пітливість'}, {value: 'інше'}]}, {
          value: '',
          type: 'text'
        }, {value: '', type: 'text'}]
      }
    ];
    this.efficiencyData.orthostaticTest.addColumns = 'Додати стовбці';
    this.efficiencyData.orthostaticTest.removeColumns = 'Видалити стовбці';
    this.efficiencyData.orthostaticTest.calculateColumns = 'Порахувати';
    this.efficiencyData.orthostaticTest.calculate = (): void => {
      let i = 1;
      for (i = 1; i <= this.efficiencyData.orthostaticTest.table[0].td.length - 1; i = i + 4) {
        this.efficiencyData.orthostaticTest.table.map((row, k) => {
          if (k == 0) {
            return;
          }
          row.td[i + 2].value = '';// різниця
          row.td[i + 3].value = '';//	висновки
        });
        let row = 4;
        for (row = 4; row <= 7; row++) {
          let riznuza = (+this.efficiencyData.orthostaticTest.table[row].td[i].value.replace(',', '.') || 0) -
            (+this.efficiencyData.orthostaticTest.table[row].td[i + 1].value.replace(',', '.') || 0);

          this.efficiencyData.orthostaticTest.table[row].td[i + 2].value = riznuza;

          if (row == 4) {//ЧСС
            if (riznuza <= 11) {
              this.efficiencyData.orthostaticTest.table[row].td[i + 3].value = 'добра';
            } else if (riznuza >= 19) {
              this.efficiencyData.orthostaticTest.table[row].td[i + 3].value = 'незадовільна';
            } else {
              this.efficiencyData.orthostaticTest.table[row].td[i + 3].value = 'задовільна';
            }
          }
          if (row == 5 || row == 7) {//АТс   //ПТ
            if (riznuza > 0) {
              this.efficiencyData.orthostaticTest.table[row].td[i + 3].value = 'добра';
            } else if (riznuza < 0) {
              this.efficiencyData.orthostaticTest.table[row].td[i + 3].value = 'незадовільна';
            } else {
              this.efficiencyData.orthostaticTest.table[row].td[i + 3].value = 'задовільна';
            }
          }
          if (row == 6) {//АТд
            if (riznuza < 0) {
              this.efficiencyData.orthostaticTest.table[row].td[i + 3].value = 'добра';
            } else if (riznuza > 5) {
              this.efficiencyData.orthostaticTest.table[row].td[i + 3].value = 'незадовільна';
            } else {
              this.efficiencyData.orthostaticTest.table[row].td[i + 3].value = 'задовільна';
            }
          }
        }
        var vegetReaktion = this.efficiencyData.orthostaticTest.table[8].td[i + 1].value;
        // console.log(vegetReaktion);
        if (vegetReaktion === '-') {
          this.efficiencyData.orthostaticTest.table[8].td[i + 3].value = 'добра';
        } else if (vegetReaktion === 'пітливість') {
          this.efficiencyData.orthostaticTest.table[8].td[i + 3].value = 'незадовільна';
        } else {
          this.efficiencyData.orthostaticTest.table[8].td[i + 3].value = 'задовільна';
        }
      }
    };

    this.efficiencyData.physicalCapacity = {};
    this.efficiencyData.physicalCapacity.tasks = ['Познайомтеся з критеріями призначення тренуючих режимів рухової активності залежно від толерантності до фізичного навантаження. При наявності показників фізичної працездатності зробіть висновки щодо показаної величини фізичного навантаження та тренувальної частоти серцевих скорочень хворого.'];
    this.efficiencyData.physicalCapacity.title = 'Критерії призначення тренуючих режимів рухової активності залежно від толерантності до фізичного навантаження (М.Ю. Ахмеджанов 1980)';
    this.efficiencyData.physicalCapacity.table = [
      {
        checked: undefined, td: ['Режим',
          'Показник порогового навантаження під час діагностичної ергометрії (у Вт) - Чоловіки',
          'Показник порогового навантаження під час діагностичної ергометрії (у Вт) - Жінки',
          'Показана величина навантаження (з розрахунку Вт на 1 кг маси тіла)',
          'Тренувальна частота серцевих скорочень (уд. за 1 хв)',
          'Вкажіть']
      },
      {checked: false, td: ['Щадно-тренувальний', '51-100', '51-85', '0,6-1,3', '120', '']},
      {checked: false, td: ['Тренувальний', '101-150', '86-125', '1,1-1,9', '140', '']},
      {checked: false, td: ['Інтенсивно-тренувальний', 'понад 150', 'понад 125', '1,6-2,5', '160', '']}
    ];


    this.efficiencyData.skibinskayaIndex = {};
    this.efficiencyData.skibinskayaIndex.tasks = ['Для того, щоб порахувати індекс Скібінської для Вашого організму, необхідні дані про частоту серцевих скорочень, можливості затримки дихання і обсязі легенів.', '1. Після 5-хвилинного відпочинку в положенні стоячи визначте частоту серцевих скорочень (ЧСС) за 1 хвилину.', '2. Потім спокійно вдихніть близько 2/3 обєму легенів і виміряйте час (у секундах) на скільки Ви зможете затримати дихання.', '3. Наступним кроком Вам необхідно виміряти обсяг Ваших легенів (у мілілітрах).', 'Життєва ємкість легень (ЖЕЛ) вимірюється спірометром або спірографом. Це можна зробити в будь-якому Центрі здоровя, у лікаря-санолога, у спортивних центрах і, можливо, в районних та відомчих поліклініках.'];
    this.efficiencyData.skibinskayaIndex.title = 'Індекс Скібінської відображає функціональні резерви дихальної та серцево-судинної систем людини';
    this.efficiencyData.skibinskayaIndex.table = [
      {td: ['Оціка стану серцево-судиної і дихалатної систем', 'Індекс Скібінської']},
      {td: ['Відмінний. Функціональні резерви серцево-судиної і дихалатної систем в чудовій формі', 'Більше 40']},
      {td: ['Добрий. Функціональні резерви серцево-судиної і дихалатної систем в нормі', '	30-60']},
      {td: ['Середній. Можна говорити про недостатні функціональні можливості серцево-судиної і дихалатної систем', '	10-30']},
      {td: ['Поганий. Функціональні можливості серцево-судиної і ди халатної систем слабкі .Знижня стійкість до гіпоксії', '5-10']},
      {td: ['Дуже поганий. Функціональні можливості серцево-судиної і дихалатної систем край слабкі', '	Менше 5']}
    ];


    this.efficiencyData.ruffieTest = {};
    this.efficiencyData.ruffieTest.tasks = ['Проведіть пробу Руф’є за відповідною методикою. Методика проведення. У обстежуваного, який перебував у положенні лежачи протягом 5 хвилин, підраховують число пульсацій за 15 с (Р1). Потім йому пропонують виконати 30 присідань за 45 с (присідаючи – руки вперед, встаючи – опускати їх). Після цього пацієнт лягає і йому підраховують пульс за перші 15 с (Р1) і останні 15 с (Р3) 1-ї хвилини після навантаження.', 'Отримані результати підставте у формулу: Індекс Руфє=(4*(Р1+Р2+Р3)-200)/10.', 'Ознайомтеся з методами оцінки результатів проби Руф’є (критерій в таблиці).', 'Внесіть отриманий результат в останній стовпчик таблиці 6 і оцініть показники індексу Руф’є у вашого хворого.'];
    this.efficiencyData.ruffieTest.title = 'Оцінка функціональних резервів серця';
    this.efficiencyData.ruffieTest.subtitle = '(Відповідно до Наказу Міністерства охорони здоровя України та Міністерства освіти і науки України 20.07.2009 N 518/674)';
    this.efficiencyData.ruffieTest.table = [
      {type: 'text', td: [{value: '', type: 'text'}, {value: 'ЧСС', type: 'text'}]},
      {type: 'edit', td: [{value: 'Вид навантаження', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'Сигнал', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'date', td: [{value: 'Дата', type: 'text'}, {value: '', type: 'date'}]},
      {type: 'edit', td: [{value: 'Вік', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'Р1 - до навантаження', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'Р2 - зразу після присідань', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'Р3 - через 2 хвилини після навантаження', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'text', td: [{value: 'Індекс Руф\'є', type: 'text'}, {value: '', type: 'text'}]},
      {type: 'text', td: [{value: 'Оцінка функціональних резервів серця', type: 'text'}, {value: '', type: 'text'}]},
      {type: 'text', td: [{value: 'Велична навантаження', type: 'text'}, {value: '', type: 'text'}]}
    ];
    this.efficiencyData.ruffieTest.addColumns = 'Додати стовбці';
    this.efficiencyData.ruffieTest.removeColumns = 'Видалити стовбці';
    this.efficiencyData.ruffieTest.calculateColumns = 'Порахувати';
    this.efficiencyData.ruffieTest.calculate = function (value: number, age: number): string[] {
      let normaRufe1 = [0.1, 0.5, 1.5, 3, 4.5, 6];
      let normaRufe2 = [5, 5, 6.5, 8, 9.5, 11];
      let normaRufe3 = [10, 10, 11.5, 13, 14.5, 16];
      let normaRufe4 = [15, 15, 16.5, 18, 19.5, 21];
      let nAge;

      if (age > 18) {
        nAge = 1;
      } else if (age >= 15 && age <= 18) {
        nAge = 2;
      } else if (age >= 13 && age <= 14) {
        nAge = 3;
      } else if (age >= 11 && age <= 12) {
        nAge = 4;
      } else if (age >= 9 && age <= 10) {
        nAge = 5;
      } else {
        nAge = 6;//%7-8
      }

      if (value <= normaRufe1[nAge]) {
        return ['атлетичне серце', 'без обмежень'];
      } else if (value > normaRufe1[nAge] && value <= normaRufe3[nAge]) {
        if (value > normaRufe1[nAge] && value <= normaRufe2[nAge]) {
          return ['дуже добре', 'без обмежень'];
        } else {
          return ['добре', 'без обмежень'];
        }
      } else {
        if (value > normaRufe3[nAge] && value <= normaRufe4[nAge]) {
          return ['серцева недостатність середнього ступеня', 'з незначними обмеженнями'];
        } else {
          return ['серцева недостатність високого ступеня', 'значно обмежене'];
        }
      }
    };


    this.efficiencyData.apanasenkoTest = {};
    this.efficiencyData.apanasenkoTest.title = 'Кількісна експрес оцінка рівня фізичного здоров’я за Г.Л. Апанасенком, 1992';
    this.efficiencyData.apanasenkoTest.table = [
      {type: 'edit', td: [{value: 'Вид навантаження', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'Сигнал', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'date', td: [{value: 'Дата', type: 'text'}, {value: '', type: 'date'}]},
      {
        type: 'select',
        td: [{value: 'Стать', type: 'text'}, {value: 'чоловік', type: 'select', values: [{value: 'чоловік'}, {value: 'жінка'}]}]
      },
      {type: 'edit', td: [{value: 'Маса тіла, кг', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'Зріст, м', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'ЖЄЛ', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'Динамометрія кисті, кг', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'ЧСС', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'АТ(сис)', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'Час відновлення пульсу після 20 присідань за 30с', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'text', td: [{value: 'Сума балів рівня фізичного здоров’я', type: 'text'}, {value: '', type: 'text'}]},
      {type: 'text', td: [{value: 'Висновки', type: 'text'}, {value: '', type: 'text'}]}
    ];
    this.efficiencyData.apanasenkoTest.addColumns = 'Додати стовбці';
    this.efficiencyData.apanasenkoTest.removeColumns = 'Видалити стовбці';
    this.efficiencyData.apanasenkoTest.calculateColumns = 'Порахувати';
    this.efficiencyData.apanasenkoTest.calculate = (): void => {
      let i = 1;
      for (i = 1; i <= this.efficiencyData.apanasenkoTest.table[0].td.length - 1; i++) {
        // this.efficiencyData.apanasenkoTest.table.map((row, k) => {
        //   if (row.td[i].type === "select" || row.td[i].type === "date") {//clear old values
        //     return;
        //   }
        //   row.td[i].value = "";
        // });
        this.efficiencyData.apanasenkoTest.table[11].td[i].value = '';
        this.efficiencyData.apanasenkoTest.table[12].td[i].value = '';

        let nAge = 0;
        let age;
        if (this.efficiencyData.apanasenkoTest.table[3].td[i].value === 'чоловік') {//men
          //1
          age = +this.efficiencyData.apanasenkoTest.table[4].td[i].value / Math.pow(+this.efficiencyData.apanasenkoTest.table[5].td[i].value, 2);
          if (age <= 18.9) {
            nAge = nAge - 2;
          } else if (age > 18.9 && age <= 20) {
            nAge = nAge - 1;
          } else if (age > 20 && age <= 25) {
            nAge = nAge - 0;
          } else if (age > 25 && age <= 28) {
            nAge = nAge + 1;
          } else {
            nAge = nAge + 2;
          }
          //2
          age = +this.efficiencyData.apanasenkoTest.table[6].td[i].value /
            +this.efficiencyData.apanasenkoTest.table[4].td[i].value;
          if (age <= 50) {
            nAge = nAge - 1;
          } else if (age > 50 && age <= 55) {
            nAge = nAge - 0;
          } else if (age > 55 && age <= 60) {
            nAge = nAge + 1;
          } else if (age > 60 && age <= 65) {
            nAge = nAge + 2;
          } else {
            nAge = nAge + 3;
          }
          //3
          age = +this.efficiencyData.apanasenkoTest.table[7].td[i].value * 100 /
            +this.efficiencyData.apanasenkoTest.table[4].td[i].value;
          if (age <= 60) {
            nAge = nAge - 1;
          } else if (age > 60 && age <= 65) {
            nAge = nAge - 0;
          } else if (age > 65 && age <= 70) {
            nAge = nAge + 1;
          } else if (age > 70 && age <= 80) {
            nAge = nAge + 2;
          } else {
            nAge = nAge + 3;
          }
          //4
          age = (+this.efficiencyData.apanasenkoTest.table[8].td[i].value *
            +this.efficiencyData.apanasenkoTest.table[9].td[i].value) / 100;
          if (age <= 69) {
            nAge = nAge + 4;
          } else if (age > 69 && age <= 84) {
            nAge = nAge + 3;
          } else if (age > 84 && age <= 94) {
            nAge = nAge + 0;
          } else if (age > 94 && age <= 110) {
            nAge = nAge - 1;
          } else {
            nAge = nAge - 2;
          }
          //5
          age = +this.efficiencyData.apanasenkoTest.table[10].td[i].value;
          if (age <= 59) {
            nAge = nAge + 7;
          } else if (age > 59 && age <= 89) {
            nAge = nAge + 5;
          } else if (age > 89 && age <= 119) {
            nAge = nAge + 3;
          } else if (age > 119 && age <= 180) {
            nAge = nAge + 1;
          } else {
            nAge = nAge - 2;
          }

        } else {//women
          //1
          age = +this.efficiencyData.apanasenkoTest.table[4].td[i].value /
            Math.pow(+this.efficiencyData.apanasenkoTest.table[5].td[i].value, 2);
          if (age <= 16.9) {
            nAge = nAge - 2;
          } else if (age > 16.9 && age <= 18) {
            nAge = nAge - 1;
          } else if (age > 18 && age <= 23.8) {
            nAge = nAge - 0;
          } else if (age > 23.8 && age <= 26) {
            nAge = nAge + 1;
          } else {
            nAge = nAge + 2;
          }
          //2
          age = +this.efficiencyData.apanasenkoTest.table[6].td[i].value /
            +this.efficiencyData.apanasenkoTest.table[4].td[i].value;
          if (age <= 40) {
            nAge = nAge - 1;
          } else if (age > 40 && age <= 45) {
            nAge = nAge - 0;
          } else if (age > 45 && age <= 50) {
            nAge = nAge + 1;
          } else if (age > 50 && age <= 55) {
            nAge = nAge + 2;
          } else {
            nAge = nAge + 3;
          }
          //3
          age = +this.efficiencyData.apanasenkoTest.table[7].td[i].value * 100 /
            +this.efficiencyData.apanasenkoTest.table[4].td[i].value;
          if (age <= 40) {
            nAge = nAge - 1;
          } else if (age > 40 && age <= 50) {
            nAge = nAge - 0;
          } else if (age > 50 && age <= 55) {
            nAge = nAge + 1;
          } else if (age > 55 && age <= 60) {
            nAge = nAge + 2;
          } else {
            nAge = nAge + 3;
          }
          //4
          age = (+this.efficiencyData.apanasenkoTest.table[8].td[i].value *
            +this.efficiencyData.apanasenkoTest.table[9].td[i].value) / 100;
          if (age <= 69) {
            nAge = nAge + 5;
          } else if (age > 69 && age <= 84) {
            nAge = nAge + 3;
          } else if (age > 84 && age <= 94) {
            nAge = nAge + 0;
          } else if (age > 94 && age <= 110) {
            nAge = nAge - 1;
          } else {
            nAge = nAge - 2;
          }
          //5
          age = +this.efficiencyData.apanasenkoTest.table[10].td[i].value;
          if (age <= 59) {
            nAge = nAge + 7;
          } else if (age > 59 && age <= 89) {
            nAge = nAge + 5;
          } else if (age > 89 && age <= 119) {
            nAge = nAge + 3;
          } else if (age > 119 && age <= 180) {
            nAge = nAge + 1;
          } else {
            nAge = nAge - 2;
          }
        }
        // console.log(this.efficiencyData.apanasenkoTest.table[11], this.efficiencyData.apanasenkoTest.table[12]);
        this.efficiencyData.apanasenkoTest.table[11].td[i].value = nAge;
        if (nAge >= 9) {
          this.efficiencyData.apanasenkoTest.table[12].td[i].value = 'безпечний рівень здоровя';
        } else {
          this.efficiencyData.apanasenkoTest.table[12].td[i].value = 'небезпечний рівень здоровя';
        }

      }
    };


    this.efficiencyData.klabchukIndex = {};
    this.efficiencyData.klabchukIndex.title = 'Модифікована експрес-оцінка рівня фізичного стану за морфо-функціональними показниками';
    this.efficiencyData.klabchukIndex.note = 'до і після проби з присіданнями пульс підраховують кожні 10 сек, а якщо той, хто обстежується, не може її виконати, з суми віднімають 3 бали.При потребі заміни вису на зігнутих руках на експіраторну пневмоманометрію: 0 балів при значеннях менше 80 мм рт.ст. у чоловіків та менше 60 мм рт.ст. у жінок, 1 бал при 80-95 у чоловіків, 60-65 у жінок, 2 бали при 100-120 у чоловіків, 70-90 у жінок, 3 бали при 130-200 у чоловіків, 95-120 у жінок, 4 бали при 205-240 мм рт.ст. і більше у чоловіків та 125-150 мм рт.ст. і більше у жінок.Загальна оцінка: при сумі балів 5 і менше індивідуальний ФС низький, 6-9 – нижче середнього, 10-14 – середній, 15-18 – вище середнього, 19 балів та більше – високий.Маючи дані про фізичний стан та знаючи медичну групу, до якої за результатами лікарського огляду віднесені ті, що займаються, можна для кожного визначити оптимальний рекреаційно-оздоровчий режим (таблиця 2).';
    this.efficiencyData.klabchukIndex.noteTwo = 'Режим №1 – обмеженого впливу, режим №2 – помірного впливу, режим №3 – розширеного впливу, ЛФК – лікувальна фізична культура.';
    this.efficiencyData.klabchukIndex.table = [
      {type: 'edit', td: [{value: 'Сигнал', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'date', td: [{value: 'Дата', type: 'text'}, {value: '', type: 'date'}]},
      {type: 'edit', td: [{value: 'маса тіла (кг)', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'зріст (м)', type: 'text'}, {value: '', type: 'edit'}]},
      {
        type: 'select',
        td: [{value: 'стать', type: 'text'}, {value: 'чоловік', type: 'select', values: [{value: 'чоловік'}, {value: 'жінка'}]}]
      },
      {type: 'edit', td: [{value: 'частота пульсу (уд.хв) у стані спокою', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'проба Генчі (сек)', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'АТС', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: '1-Індекс маси тіла (кг/ м2 )', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: '2-Силовий вис на зігнутих руках (сек)', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: '3-Гіпоксичний індекс (ум.од)', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: '4-Подвійний добуток (ум.од)', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: '5-Проба Мартіне Кушелевського', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'text', td: [{value: 'Кількість балів', type: 'text'}, {value: '', type: 'text'}]},
      {type: 'text', td: [{value: 'Оцінка реакції', type: 'text'}, {value: '', type: 'text'}]}
    ];
    this.efficiencyData.klabchukIndex.addColumns = 'Додати стовбці';
    this.efficiencyData.klabchukIndex.removeColumns = 'Видалити стовбці';
    this.efficiencyData.klabchukIndex.calculateColumns = 'Порахувати';
    this.efficiencyData.klabchukIndex.infoTable = [
      {td: ['', 'низький', 'нижче середнього', 'середній', 'вище середнього', 'високий']},
      {td: ['Основна', '-', '2', '2', '3-2', '2']},
      {td: ['Підготовча', '1', '1-2', '1-2', '2-1', '3-2']},
      {td: ['Спеціальна', 'ЛФК', '1', '1', '1', '-']}
    ];
    this.efficiencyData.klabchukIndex.calculate = (): void => {
      let dataPokaznuk1 = [19, 20, 25, 28, 1000, 19, 28, 32, 43, 1000, 1.52, 1.89, 2.53, 5.07, 1000, 70, 84, 94, 100, 1000, 1, 2, 3, 5, 1000];
      let dataPokaznuk2 = [17, 18, 23.8, 26, 1000, 6, 9, 11, 15, 1000, 2, 2.66, 4, 6.67, 1000, 70, 84, 94, 100, 1000, 1, 2, 3, 5, 1000];
      let dataPokaznuk3 = [-2, -1, 0, -1, -2, 0, 1, 2, 3, 4, 5, 4, 3, 2, 1, 6, 4, 3, 1, 0, 7, 5, 3, -1, -2];
      this.efficiencyData.klabchukIndex.table[0].td.map((d, i) => {
        if (i === 0) {
          return;
        }
        this.efficiencyData.klabchukIndex.table[8].td[i].value = '';
        this.efficiencyData.klabchukIndex.table[9].td[i].value = '';
        this.efficiencyData.klabchukIndex.table[10].td[i].value = '';
        this.efficiencyData.klabchukIndex.table[11].td[i].value = '';
        // this.efficiencyData.klabchukIndex.table[12].td[i].value = "";
        this.efficiencyData.klabchukIndex.table[13].td[i].value = '';

        let value1 = +this.efficiencyData.klabchukIndex.table[2].td[i].value / +this.efficiencyData.klabchukIndex.table[3].td[i].value;//+
        this.efficiencyData.klabchukIndex.table[8].td[i].value = value1.toFixed(3);

        let value2 = +this.efficiencyData.klabchukIndex.table[5].td[i].value / +this.efficiencyData.klabchukIndex.table[6].td[i].value;//+
        this.efficiencyData.klabchukIndex.table[10].td[i].value = value2.toFixed(3);

        let value3 = +this.efficiencyData.klabchukIndex.table[5].td[i].value / +this.efficiencyData.klabchukIndex.table[7].td[i].value;//+
        this.efficiencyData.klabchukIndex.table[11].td[i].value = value3.toFixed(3);

        let sex = this.efficiencyData.klabchukIndex.table[4].td[i].value;//0-men
        let iN = [3, 8, 6, 7, 11];
        let sumaBal = 0;//double[] Bal = new double[5];
        for (let iiP = 1; iiP <= 5; iiP++) {//%pokaznuk  iiP=2
          for (let iiB = 1; iiB <= 5; iiB++) {//%balu  iiB=2
            let dataTable0 = +this.efficiencyData.klabchukIndex.table[iN[iiP - 1]].td[i].value;//Double.valueOf(((TextBox)flexTable.getWidget(iN[iiP-1], i)).getText());
            if (sex == 'чоловік') {
              if (dataTable0 < dataPokaznuk1[iiB + iiP * 5 - 5 - 1]) {
                sumaBal = sumaBal + dataPokaznuk3[iiB + iiP * 5 - 5 - 1];//Bal[iiP]=dataPokaznuk3[iiB+iiP*5-5];
                break;
              }
            } else {
              if (dataTable0 < dataPokaznuk2[iiB + iiP * 5 - 5 - 1]) {
                sumaBal = sumaBal + dataPokaznuk3[iiB + iiP * 5 - 5 - 1];//Bal[iiP]=dataPokaznuk3[iiB+iiP*5-5];
                break;
              }
            }
          }
        }
        this.efficiencyData.klabchukIndex.table[13].td[i].value = sumaBal;
      });

    };


    this.efficiencyData.martineKushelevskyTest = {};
    this.efficiencyData.martineKushelevskyTest.title = 'Протокол реєстрації результатів проби';
    this.efficiencyData.martineKushelevskyTest.tasks = ['При відсутності протипоказань до призначення післялікарняного періоду рухової активності, визначте показники частоти серцевих скорочень та артеріального тиску до та після навантаження, час відновлення указаних показників за відповідною методикою проведення проби Мартіне-Кушелевського.', 'Внесіть отримані результати в таблицю (Частота серцевих скорочень підраховується і реєструється за 10 сек)'];
    this.efficiencyData.martineKushelevskyTest.protocol = [
      {
        td: [{value: '', type: 'text'}, {value: 'ЧСС-АТ (1 хв)', type: 'text'}, {
          value: 'ЧСС-АТ (2 хв)',
          type: 'text'
        }, {value: 'ЧСС-АТ (3 хв)', type: 'text'}]
      },
      {td: [{value: '10 c', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {td: [{value: '20 c', type: 'text'}, {value: '', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {td: [{value: '30 c', type: 'text'}, {value: '', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {td: [{value: '40 c', type: 'text'}, {value: '', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {td: [{value: '50 c', type: 'text'}, {value: '', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'edit'}]},
      {td: [{value: '60 c', type: 'text'}, {value: '', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'text'}]},
      {td: [{value: 'АТС', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'text'}, {value: '', type: 'edit'}]},
      {td: [{value: 'АТД', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'text'}, {value: '', type: 'edit'}]},
      {td: [{value: 'АТП', type: 'text'}, {value: '', type: 'edit'}, {value: '', type: 'text'}, {value: '', type: 'edit'}]},
    ];
    this.efficiencyData.martineKushelevskyTest.table = [
      {type: 'edit', td: [{value: 'Вид навантаження', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'Сигнал', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'date', td: [{value: 'Дата', type: 'text'}, {value: '', type: 'date'}]},
      {type: 'edit', td: [{value: 'ЧСС', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'АТC', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'АТД', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'edit', td: [{value: 'АТП', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'text', td: [{value: '1.Збудливість пульсу', type: 'text'}, {value: '', type: 'text'}]},
      {type: 'text', td: [{value: '1.Тип реакції', type: 'text'}, {value: '', type: 'text'}]},
      {type: 'text', td: [{value: '1.Рекомендації', type: 'text'}, {value: '', type: 'text'}]},
      {type: 'edit', td: [{value: '2.Час відновлення пульсу', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'text', td: [{value: '2.Тип реакції', type: 'text'}, {value: '', type: 'text'}]},
      {type: 'text', td: [{value: '2.Рекомендації', type: 'text'}, {value: '', type: 'text'}]},
      {type: 'text', td: [{value: '3.Зміна АТС (мм.рт.ст)', type: 'text'}, {value: '', type: 'text'}]},
      {type: 'text', td: [{value: '3.Тип реакції', type: 'text'}, {value: '', type: 'text'}]},
      {type: 'text', td: [{value: '3.Рекомендації', type: 'text'}, {value: '', type: 'text'}]},
      {type: 'text', td: [{value: '4.Зміна АТД (мм.рт.ст)', type: 'text'}, {value: '', type: 'text'}]},
      {type: 'text', td: [{value: '4.Тип реакції', type: 'text'}, {value: '', type: 'text'}]},
      {type: 'text', td: [{value: '4.Рекомендації', type: 'text'}, {value: '', type: 'text'}]},
      {type: 'text', td: [{value: '5.Зміна АТП (%)', type: 'text'}, {value: '', type: 'text'}]},
      {type: 'text', td: [{value: '5.Тип реакції', type: 'text'}, {value: '', type: 'text'}]},
      {type: 'text', td: [{value: '5.Рекомендації', type: 'text'}, {value: '', type: 'text'}]},
      {type: 'edit', td: [{value: '6.Час відновлення АТ', type: 'text'}, {value: '', type: 'edit'}]},
      {type: 'text', td: [{value: '6.Тип реакції', type: 'text'}, {value: '', type: 'text'}]},
      {type: 'text', td: [{value: '6.Рекомендації', type: 'text'}, {value: '', type: 'text'}]}
    ];
    this.efficiencyData.martineKushelevskyTest.addColumns = 'Додати стовбці';
    this.efficiencyData.martineKushelevskyTest.removeColumns = 'Видалити стовбці';
    this.efficiencyData.martineKushelevskyTest.calculateColumns = 'Порахувати';
    this.efficiencyData.martineKushelevskyTest.calculate = (): void => {
      let HR0 = +this.efficiencyData.martineKushelevskyTest.protocol[1].td[1].value || undefined;
      let ATS0 = +this.efficiencyData.martineKushelevskyTest.protocol[7].td[1].value || undefined;
      let ATD0 = +this.efficiencyData.martineKushelevskyTest.protocol[8].td[1].value || undefined;
      let ATP0 = +this.efficiencyData.martineKushelevskyTest.protocol[9].td[1].value || undefined;

      this.efficiencyData.martineKushelevskyTest.table.map((t, i) => {
        if (i == 0) {
          return;
        }
        t.td.map((c, j) => {
          if (j == 0) {
            return;
          }
          if (c.type === 'text') {
            c.value = '';
          }
        });
      });

      if (HR0 === undefined || ATS0 === undefined || ATD0 === undefined || ATP0 === undefined) {
        return;
      }
      // console.log("1");
      this.efficiencyData.martineKushelevskyTest.table[0].td.map((d, i) => {
        if (i === 0) {
          return;
        }
        let HR = +this.efficiencyData.martineKushelevskyTest.table[3].td[i].value || undefined;
        let ATS = +this.efficiencyData.martineKushelevskyTest.table[4].td[i].value || undefined;
        let ATD = +this.efficiencyData.martineKushelevskyTest.table[5].td[i].value || undefined;
        let ATP = +this.efficiencyData.martineKushelevskyTest.table[6].td[i].value || undefined;
        if (HR === undefined || ATS === undefined || ATD === undefined || ATP === undefined) {
          return;
        }
        // console.log("2");
        //%1
        let value = +(100 * (HR0 - HR) / HR).toFixed(3);
        this.efficiencyData.martineKushelevskyTest.table[7].td[i].value = value;
        if (value <= 80) {
          this.efficiencyData.martineKushelevskyTest.table[9].td[i].value = 'Без обмежень';
          this.efficiencyData.martineKushelevskyTest.table[8].td[i].value = 'Сприятливий';
        } else {
          this.efficiencyData.martineKushelevskyTest.table[9].td[i].value = 'Обмежено';
          this.efficiencyData.martineKushelevskyTest.table[8].td[i].value = 'Не сприятливий';
        }
        //3
        value = +(ATS0 - ATS).toFixed(3);
        this.efficiencyData.martineKushelevskyTest.table[13].td[i].value = value;
        if (value <= 40) {
          this.efficiencyData.martineKushelevskyTest.table[14].td[i].value = 'Нормотонічний';
          this.efficiencyData.martineKushelevskyTest.table[15].td[i].value = 'Без обмежень';
        } else if (value > 180 && value <= 200) {
          this.efficiencyData.martineKushelevskyTest.table[14].td[i].value = 'Гіпертонічний';
          this.efficiencyData.martineKushelevskyTest.table[15].td[i].value = 'Обмежено';
        } else if (value > 200) {
          this.efficiencyData.martineKushelevskyTest.table[14].td[i].value = 'Дистонічний';
          this.efficiencyData.martineKushelevskyTest.table[15].td[i].value = 'Обмежено';
        } else if (value > 0 && value <= 5) {
          this.efficiencyData.martineKushelevskyTest.table[14].td[i].value = 'Астенічний (гіпотонічний)';
          this.efficiencyData.martineKushelevskyTest.table[15].td[i].value = 'Значно обмежено';
        } else {
          this.efficiencyData.martineKushelevskyTest.table[14].td[i].value = 'Східчастий';
          this.efficiencyData.martineKushelevskyTest.table[15].td[i].value = 'Обмежено';
        }

        //4
        value = +(ATD0 - ATD).toFixed(3);
        this.efficiencyData.martineKushelevskyTest.table[16].td[i].value = value;
        if (value <= 10) {
          this.efficiencyData.martineKushelevskyTest.table[17].td[i].value = 'Нормотонічний';
          this.efficiencyData.martineKushelevskyTest.table[18].td[i].value = 'Без обмежень';
        } else if (value > 90) {
          this.efficiencyData.martineKushelevskyTest.table[17].td[i].value = 'Гіпертонічний';
          this.efficiencyData.martineKushelevskyTest.table[18].td[i].value = 'Обмежено';
        } else if (value < 0) {
          this.efficiencyData.martineKushelevskyTest.table[17].td[i].value = 'Дистонічний';
          this.efficiencyData.martineKushelevskyTest.table[18].td[i].value = 'Обмежено';
        } else if (value > 0 && value <= 5) {
          this.efficiencyData.martineKushelevskyTest.table[17].td[i].value = 'Астенічний (гіпотонічний)';
          this.efficiencyData.martineKushelevskyTest.table[18].td[i].value = 'Значно обмежено';
        } else {
          this.efficiencyData.martineKushelevskyTest.table[17].td[i].value = 'Східчастий';
          this.efficiencyData.martineKushelevskyTest.table[18].td[i].value = 'Обмежено';
        }
        //5
        value = +(100 * (ATP0 - ATP) / ATP).toFixed(3);
        this.efficiencyData.martineKushelevskyTest.table[19].td[i].value = value;
        if (value > 80 && value <= 100) {
          this.efficiencyData.martineKushelevskyTest.table[20].td[i].value = 'Нормотонічний';
          this.efficiencyData.martineKushelevskyTest.table[21].td[i].value = 'Без обмежень';
        } else if (value > 100) {
          this.efficiencyData.martineKushelevskyTest.table[20].td[i].value = 'Гіпертонічний';
          this.efficiencyData.martineKushelevskyTest.table[21].td[i].value = 'Обмежено';
        } else if (value > 150) {
          this.efficiencyData.martineKushelevskyTest.table[20].td[i].value = 'Дистонічний';
          this.efficiencyData.martineKushelevskyTest.table[21].td[i].value = 'Обмежено';
        } else if (value > 12 && value <= 25) {
          this.efficiencyData.martineKushelevskyTest.table[20].td[i].value = 'Астенічний (гіпотонічний)';
          this.efficiencyData.martineKushelevskyTest.table[21].td[i].value = 'Значно обмежено';
        } else {
          this.efficiencyData.martineKushelevskyTest.table[20].td[i].value = 'Східчастий';
          this.efficiencyData.martineKushelevskyTest.table[21].td[i].value = 'Обмежено';
        }
        //2
        value = +this.efficiencyData.martineKushelevskyTest.table[10].td[i].value;//chasVidnovlenia
        if (value <= 3) {
          this.efficiencyData.martineKushelevskyTest.table[12].td[i].value = 'Без обмежень';
          this.efficiencyData.martineKushelevskyTest.table[11].td[i].value = 'Сприятливий';
        } else if (value > 3) {
          this.efficiencyData.martineKushelevskyTest.table[12].td[i].value = 'Обмежено';
          this.efficiencyData.martineKushelevskyTest.table[11].td[i].value = 'Не сприятливий';
        }
        //6
        value = +this.efficiencyData.martineKushelevskyTest.table[22].td[i].value;//chasVidnovlenia
        if (value <= 3) {
          this.efficiencyData.martineKushelevskyTest.table[24].td[i].value = 'Без обмежень';
          this.efficiencyData.martineKushelevskyTest.table[23].td[i].value = 'Сприятливий';
        } else if (value > 3) {
          this.efficiencyData.martineKushelevskyTest.table[24].td[i].value = 'Обмежено';
          this.efficiencyData.martineKushelevskyTest.table[23].td[i].value = 'Не сприятливий';
        }

      });
    };


    // --------------------------getBiosignalsData--------------------------
    this.biosignalsData.mainNav = 'Головна';
    this.biosignalsData.morphologicalAnalysisNav = 'Морфологічний аналіз';
    this.biosignalsData.plotNav = 'Графіки';
    this.biosignalsData.statisticaNav = 'Статистика';
    this.biosignalsData.extremumConformNav = 'Уточнення екстремумів';
    this.biosignalsData.expertSystemNav = 'Експертна система';
    this.biosignalsData.main = {};
    this.biosignalsData.main.calculation = ['Індикатор', 'Сис', 'Діа', 'Пул', 'M1', 'M2', 'M3', 'M4', 'M5', 'M6'];//, "Середнє знаечння", "Максимальне", "Мінімальне", "Стандартне відхилення"
    this.biosignalsData.info = {};
    this.biosignalsData.info.title = 'Інформація про пацієнта';
    this.biosignalsData.info.informationForNewGroup = 'Інформація про пацієнта';
    this.biosignalsData.info.patientFullname = 'П.І.Б пацієнта';
    this.biosignalsData.info.patientYearOfBirth = 'Дана народження';
    this.biosignalsData.info.patientSex = 'Стать';
    this.biosignalsData.info.patientDiagnosis = 'Діагноз';
    this.biosignalsData.info.clinic = 'Клініка';
    this.biosignalsData.info.doctorFullname = 'П.І.Б лікаря';
    this.biosignalsData.info.dateOfInspection = 'Дата обстеження';
    this.biosignalsData.info.typeOfInspection = 'Тип обстеження';
    this.biosignalsData.info.conclusions = 'Висновки';
    this.biosignalsData.plot = {};
    this.biosignalsData.plot.chartWidth = 320;
    this.biosignalsData.plot.chartHeight = 240;
    this.biosignalsData.plot.chartWidthPlaceholder = 'Ширина (по-замовчуваню 320)';
    this.biosignalsData.plot.chartHeightPlaceholder = 'Висота (по-замовчуваню 240)';
    this.biosignalsData.plot.chartsType = [{label: 'Осцилограма із огинаючою', selected: false}, {
      label: 'Осцилограма без огинаючої',
      selected: true
    }];
    this.biosignalsData.koeff = [
      {'m': 'M1-Якість адаптації'},
      {'m': 'M2-Порушення ритму'},
      {'m': 'M3-Тонус судин'},
      {'m': 'M4-Рівень збудливості'},
      {'m': 'M5-Еластичність судин'},
      {'m': 'M6-Пульсова  здатність'}
    ];
    this.biosignalsData.akoofsNav = 'АКООФС';
    this.biosignalsData.vesselsNav = 'Судини';
    this.biosignalsData.hnsNav = 'ВНС';
    this.biosignalsData.heartNav = 'Серце';
    this.biosignalsData.vessels = {
      'isMean': 'Середнє',
      'name': 'Судини',
      'weight': 'Вага',
      'mean': 'Середнє значення',
      'criteria': 'Критерій',
      'th': ['Параметр', 'Вага', 'Інтерпретація', 'Критерій', 'Наявний'],
      'parameter': [
        {'m': 'M1-Якість адаптації'},
        {'m': 'M2-Порушення ритму'},
        {'m': 'M3-Тонус судин'},
        {'m': 'M4-Рівень збудливості'},
        {'m': 'M5-Еластичність судин'},
        {'m': 'M6-Пульсова  здатність'}
      ],
      'interpretation': [
        ['1. Х-ка  Огинаюча за максимумами рівномірно зростає, досягає свого піку та поступово рівномірно спадає; Огинаюча за мінімумами має аналогічну форму, розміщену симетрично від осі Х.',
          '2. Х-ка  Огинаюча за максимумами рівномірно зростає, досягає свого піку та поступово рівномірно спадає; Огинаюча за мінімумами має аналогічну форму, розміщену симетрично від осі Х. Лише окремі максимуми осциляцій незначно відхиляються від неї (розміщенні вище чи нижче від огинаючої)',
          '3. Х-ка  Огинаюча за максимумами рівномірно зростає, досягає свого піку та поступово рівномірно спадає; Огинаюча за мінімумами має аналогічну форму, розміщену симетрично від осі Х. При цьому окремі осциляції мають значне відхилення від огинаючої в бік їх збільшення чи зменшення.',
          '4. Х-ка  Огинаюча за максимумами зростає та знижується нерівномірно; Огинаюча за мінімумами суттєво відрізняється від максимальної. Значна кількість осциляцій мають виражене відхилення від огинаючої в бік їх збільшення чи зменшення.',
          '5. Х-ка  Огинаюча за максимумами зростає, досягає свого піку та спадає ; Огинаюча за мінімумами відрізняється від максимальної. При цьому переважна кількість осциляцій мають виражений хаотичний характер, відхиляються від огинаючої в бік їх збільшення чи зменшення.'
        ],
        ['1. Х-ка  Огинаюча за максимумами рівномірно зростає, досягає свого піку та поступово рівномірно спадає; Огинаюча за мінімумами має аналогічну форму, розміщену симетрично від осі Х.',
          '2. Х-ка  Огинаюча за максимумами рівномірно зростає, досягає свого піку та поступово рівномірно спадає; Огинаюча за мінімумами має аналогічну форму, розміщену симетрично від осі Х. Лише окремі максимуми осциляцій незначно відхиляються від неї (розміщенні вище чи нижче від огинаючої)',
          '3. Х-ка  Огинаюча за максимумами рівномірно зростає, досягає свого піку та поступово рівномірно спадає; Огинаюча за мінімумами має аналогічну форму, розміщену симетрично від осі Х. При цьому окремі осциляції мають значне відхилення від огинаючої в бік їх збільшення чи зменшення.',
          '4. Х-ка  Огинаюча за максимумами зростає та знижується нерівномірно; Огинаюча за мінімумами суттєво відрізняється від максимальної. Значна кількість осциляцій мають виражене відхилення від огинаючої в бік їх збільшення чи зменшення.',
          '5. Х-ка  Огинаюча за максимумами зростає, досягає свого піку та спадає ; Огинаюча за мінімумами відрізняється від максимальної. При цьому переважна кількість осциляцій мають виражений хаотичний характер, відхиляються від огинаючої в бік їх збільшення чи зменшення.'
        ],
        ['1. На початку компресії амплітуда осциляцій рівномірно зростає, на висхідній частині осциляції додаткові хвилі відсутні, на низхідній частині реєструються незначна кількість  рівномірно розміщенних однотипних дрібних осциляцій.',
          '2. На початку компресії амплітуда осциляцій змінюється нерівномірно, на висхідній частині осциляції додаткові хвилі відсутні, на низхідній частині реєструються різнохарактерні дрібні осциляції.',
          '3. На початку компресії амплітуда осциляцій змінюється нерівномірно, на висхідній частині осциляції можуть зустрічатися додаткові хвилі, на низхідній частині реєструються різноманіині дрібні осциляції.',
          '4. На початку компресії амплітуда осциляцій змінюється нерівномірно, на висхідній частині осциляції реєструють велика кількість дрібних осциляцій, на низхідній частині - значна кількість різноманітних дрібних осциляції.',
          '5. На початку компресії реєструються хаотичні за амплітудою, частотою та формою осциляції.'
        ],
        ['1. Осцилограмі притаманне рівномірне зростання амплітуди осциляцій, досягнення піку та зниження її. Відсутні екстремальні осциляції.',
          '2. Спостерігаються поодинокі осциляції зі зростанням їх амплітуди не більше ніж на 50% від поруч розміщених.',
          '3. На осцилограмі спостерігаються декілька осциляцій  зі зростанням їх амплітуди не більше ніж на 50% від поруч розміщених.',
          '4. В процесі компресії в різних частинах осцилограми спостерігаються окремі осциляції зі зростанням їх амплітуди більше ніж на 50% від поруч розміщених.',
          '5. В процесі компресії в різних частинах осцилограми спостерігаються значна кількість осциляцій зі зростанням їх амплітуди більше ніж на 50% від поруч розміщених.'
        ],
        ['1. Кількість максимальних осциляцій – 1-2',
          '2. Кількість максимальних осциляцій – 3-5, які за амплітудою незначно відрізняються.',
          '3. Кількість максимальних осциляцій – 6-9, які за амплітудою незначно відрізняються.',
          '4. Кількість максимальних осциляцій – 10-20, які за амплітудою незначно відрізняються.',
          '5. Відсутність явно виражених двох або більше поруч розміщених  осциляцій з максимальними амплітудами. Максимальні амплітуди періодично реєструються протягом тривалого часу.'
        ],
        ['1. Вершина загострена та однотипні.',
          '2. Дикротичний зубець розміщений біля вершини, в окремих випадках - перевищує її, вершини двогорбі.',
          '3. Дикротичний зубець розміщений біля вершини, зберігається  в процесі компресії - перевищує її, вершини двогорбі.',
          '4. Вершини сплощені, за рахунок додаткових хвиль.',
          '5. Виявити будь-які характеристики, притаманні вершинам осциляцій не вдалося.'
        ]
      ]
    };
    this.biosignalsData.hns = {
      'isMean': 'Середнє',
      'name': 'ВНС',
      'mean': 'Середнє значення',
      'th': ['Категорія', 'Параметр', 'RMSSD, ms', 'pNN50-pos, %', 'pNN50-neg, %', 'Amo-pos, %/50ms', 'Amo-neg, %/50ms', 'TP, ms^2', 'HF, ms^2', 'LF, ms^2', 'VLF, ms^2'],
      'values': [
        {
          'category': '',
          'parameter': 'Узагальнене зростання центральної регуляції',
          'rmssd': 'Зменшення',
          'pnn50Pos': 'Зменшення',
          'pnn50Neg': 'Зменшення',
          'amoPos': 'Збільшення',
          'amoNeg': 'Збільшення',
          'tp': 'Зменшення',
          'hf': 'Зменшення',
          'lf': 'Збільшення',
          'vlf': 'Збільшення'
        },
        {
          'category': '-2',
          'parameter': 'Виражений вплив центральної регуляції',
          'rmssd': '0.01-0.06',
          'pnn50Pos': '1-5',
          'pnn50Neg': '1-5',
          'amoPos': '50-70',
          'amoNeg': '50-70',
          'tp': '0-2',
          'hf': '0.01-0.8',
          'lf': '0-4',
          'vlf': '0-0.9'
        },
        {
          'category': '-1',
          'parameter': 'Помірний вплив центральної регуляції',
          'rmssd': '0.06-0.1',
          'pnn50Pos': '5-9',
          'pnn50Neg': '5-9',
          'amoPos': '40-51',
          'amoNeg': '40-51',
          'tp': '2-8',
          'hf': '0.8-2.4',
          'lf': '4-6',
          'vlf': '0.9-2'
        },
        {
          'category': '0',
          'parameter': 'Середні показники (Ейтонія)',
          'rmssd': '0.1-0.26',
          'pnn50Pos': '9-12',
          'pnn50Neg': '9-12',
          'amoPos': '25-40',
          'amoNeg': '25-40',
          'tp': '8-11',
          'hf': '2.4-2.9',
          'lf': '6-7',
          'vlf': '2-3'
        },
        {
          'category': '+1',
          'parameter': 'Помірний вплив автономної регуляції',
          'rmssd': '0.26-0.41',
          'pnn50Pos': '12-17',
          'pnn50Neg': '12-17',
          'amoPos': '10-25',
          'amoNeg': '10-25',
          'tp': '11-18',
          'hf': '2.9-5.3',
          'lf': '7-11',
          'vlf': '3-7'
        },
        {
          'category': '+2',
          'parameter': 'Виражений  вплив автономної регуляції',
          'rmssd': '0.41-0.8',
          'pnn50Pos': '17-25',
          'pnn50Neg': '17-25',
          'amoPos': '1-10',
          'amoNeg': '1-10',
          'tp': '18-40',
          'hf': '5.3-7',
          'lf': '11-30',
          'vlf': '7-30'
        },
        {
          'category': '',
          'parameter': 'Узагальнене зростання автономної регуляції',
          'rmssd': 'Збільшення',
          'pnn50Pos': 'Збільшення',
          'pnn50Neg': 'Збільшення',
          'amoPos': 'Зменшення',
          'amoNeg': 'Зменшення',
          'tp': 'Збільшення',
          'hf': 'Збільшення',
          'lf': 'Зменшення',
          'vlf': 'Зменшення'
        }
      ],
      parsTitle: 'Крітерії для оцінки окремих станів і характеристик системи регуляції Серцево-судинної системи на основі аналізу артеріальних осцилограм  (ПАРС-осц)',
      parsInterpretation: [
        '1. Норма - стан оптимального (робочої) напруги регуляторних систем, необхідна величена для підтримки активної рівноваги організму з середовищем (ПАРС = 1-2).',
        '2. Помірне функціональне напруження - це стан виникає, коли для адаптації до умов навколишнього середовища організму потрібні додаткові функціональні резерви. Такий стан формується в процесі адаптації до трудової діяльності, при емоційному стресі або при дії несприятливих екологічних факторів (ПАРС = 3-4).',
        '3. Виражене функціональне напруження - це стан є ознакою неадекватного відповіді організму на вплив факторів довкілля. Воно пов`язане з активною мобілізацією захисних механізмів, в тому числі підвищенням активності симпатоадреналової системи і системи гіпофіз-наднирники (ПАРС = 4-6).',
        '4. Різко виражене функціональне напруження (перенапруження регуляторних систем) - це стан вказує на недостатність захисно-пристосувальних механізмів, їх нездатність забезпечити адекватну реакцію організму на вплив факторів навколишнього середовища. Тут надлишкова активація регуляторних систем вже не підкріплюється відповідними функціональними резервами (ПАРС = 6-7).',
        '5. Астенізація (виснаження) регуляторних систем. Стан, при якому активність керуючих механізмів знижується (недостатність механізмів регуляції) і з`являються характерні ознаки патології. Тут специфічні зміни чітко переважають над неспецифічними (ПАРС = 7-8).',
        '6. Зрив адаптації. Стан «поломка» адаптаційних механізмів, коли домінують специфічні патологічні відхилення і здатність адаптаційних механізмів до саморегуляції частково або повністю порушена (ПАРС = 8-10).'
      ],
      'parsTh': ['Бал', 'Сумарний ефект регуляції', 'Функції автоматизму', 'Вегетативний гомеостаз', 'Стійкість регуляції', 'Спектральна структура ритму', 'Загальна потужність'],
      'parsValues': [
        {
          'category': '',
          'mo': 'Мо, с',
          'bp': 'ВР, c',
          'amoin': 'АМо,с; IN,1/с2',
          'v': 'V, с',
          '%ulf%vlf%lf%hf': '%ULF; %VLF; %LF; %HF',
          'tp': 'TP'
        },
        {
          'category': '+2',
          'mo': 'Виражена тахікардія, <0,66',
          'bp': 'Стабільний ритм, <0,15',
          'amoin': 'Виражене переважання СНС, АМо>50, IN>120',
          'v': 'Дис регуляція, <=2',
          '%ulf%vlf%lf%hf': 'Переважання %ULF, %VLF>65, %LF>25, %HF<20',
          'tp': '<0,00001'
        },
        {
          'category': '+1',
          'mo': 'Помірна тахікардія, 0.8-0.66',
          'bp': 'Виражена синусова аритмія, ВР 0.15 - 0.25',
          'amoin': 'Помірне переважання СНС, АМо 40-50, IN 70-120',
          'v': '>2, <=5',
          '%ulf%vlf%lf%hf': 'Переважання %HF 20-40, %VLF 45-65',
          'tp': '0.00001-0.0001'
        },
        {
          'category': '0',
          'mo': 'Нормокардія, 0.8-1',
          'bp': 'Помірна синусова аритмія, ВР  0.25-0.35',
          'amoin': 'Вегетативний гомеостаз, АМо 30-40, IN 45-70',
          'v': 'Стійка регуляція. >5, <=8',
          '%ulf%vlf%lf%hf': 'Баланс, %HF 40-60',
          'tp': '0.0001-0.0003'
        },
        {
          'category': '-1',
          'mo': 'Помірна брадікардія,  1-1.2',
          'bp': 'Помірне порушення автоматизму, ВР 0.35-0.7',
          'amoin': 'Помірне переважання ПСНС, АМо 20-30, IN 20-45',
          'v': '>8, <=10',
          '%ulf%vlf%lf%hf': 'Переважання, %HF 60-70, %VLF 25-45',
          'tp': '0.0003-0.0005'
        },
        {
          'category': '-2',
          'mo': 'Виражена брадікардія, >1.2',
          'bp': 'Виражене порушення автоматизму, ВР >0.7',
          'amoin': 'Виражене переважання ПСНС, АМо <20, IN <20',
          'v': 'Дис регуляція, >10',
          '%ulf%vlf%lf%hf': 'Переважання HF >=70%, %VLF <25',
          'tp': '>0.0005'
        }
      ],
    };
    this.biosignalsData.heart = {
      'isMean': 'Середнє',
      'name': 'Серце',
      'weight': 'Вага',
      'mean': 'Середнє значення',
      'criteria': 'Критерій',
      'th': ['Контроль', 'Відділи та підрозділи механізму регулювання', 'Параметр', 'Норма', 'Значення', 'Дисперсія', 'Вага', 'Інтерпретація', 'Критерій', 'Наявний'],
      'parameter': [
        {'name': 'M1-Якість адаптації', 'norm': '1-1'},
        {'name': 'pNN50-pos', 'norm': '9-12'},
        {'name': 'Mo-pos', 'norm': '0.4-0.9'},
        {'name': 'pNN50-neg', 'norm': '9-12'},
        {'name': 'Mo-neg', 'norm': '0.4-0.9'},
        {'name': 'BPM', 'norm': '55-70'}
      ],
      'valueName': ['M1-Якість адаптації', 'pnn50Pos', 'moPos', 'pnn50Neg', 'moNeg', 'bpm'],
      'interpretation': [
        ['Симпатична активна', 'Норма', 'Парасимпатична активна'],
        ['Симпатична активна', 'Норма', 'Парасимпатична активна, підвищення активності синусового вузла'],
        ['Симпатична активна', 'Норма', 'Парасимпатична активна'],
        ['Симпатична активна', 'Норма', 'Парасимпатична активна, підвищення активності синусового вузла'],
        ['Симпатична активна', 'Норма', 'Парасимпатична активна'],
        ['Нижче норми', 'Норма', 'Вище норми']
      ],
      'pathControl': ['', 'Автономна', 'Центральна', 'Автономна', 'Центральна'],
      'departmentsAndSoOn': ['', 'Парасимпатичний відділ вегетативної нервової системи', 'Симпатичний відділ вегетативнонервової системи', 'Парасимпатичний відділ вегетативної нервової системи', 'Симпатичний відділ вегетативної нервовосистеми']
    };
    this.biosignalsData['report-information'] = ['П.І.Б. пацієнта', 'Рік народження', 'Стать', 'Дігноз', 'Клініка', 'П.І.Б. доктора', 'Дата обстеження', 'Тип обстеження', 'Тривалість', 'Інтервал 1', 'Інтервал 2', 'Висновки'];
    // this.biosignalsData.reportNav = 'Звіт';
  }

  public getAnamnesisData() {
    return this.anamnesisData;
  }

  public getRehabilitationData() {
    return this.rehabilitationData;
  }

  public getEfficiencyData() {
    return this.efficiencyData;
  }

  public getBiosignalsData() {
    return this.biosignalsData;
  }
}
