const M_Allowed_Contraindications = require('../../services/crud_services/m_allowed_contraindications.service');
const M_Allowed_Sub_Contraindications = require('../../services/crud_services/m_allowed_sub_contraindications.service');
const promiseHelper = require('../promise_helper');

let arr = [
    {title: '1. Захворювання шкіри, нігтів, волосистої частини голови інфекційного, грибкового та невизначеного характеру, різні шкірні висипання, пошкодження,  подразнення шкіри.'},
    {title: '2. Наявні порушення цілості кісток  або небезпека їх виникнення.'},
    {title: '3. Варикозно розширені вени (без трофічних порушень).'},
    {title: '4. Наявність іммобілізації, пов’язок.'},
    {title: '5. Міжлопаткова ділянка зліва при захворюваннях серця'},

    {title: '– загальний тяжкий стан хворого при  різних захворюваннях і травмах'},
    {title: '– температура тіла більше 37,5 °С'},
    {title: '– гострий запальний процес, гострі респіраторні вірусні захворювання'},
    {title: '– збільшення та наростання швидкості осідання еритроцитів (ШОЕ)'},
    {title: '– наявність гнійних процесів в організмі'},
    {title: '– активна фаза туберкульозу'},
    {title: '– загострення захворювань кишечника, нудота, блювання'},
    {title: '– стани, що вимагають невідкладного  оперативного втручання'},
    {title: '– захворювання лімфатичних судин та вузлів'},
    {title: '– гострі алергічні стани, набряк Квінке'},
    {title: '– виражений больовий синдром'},
    {title: '– кровотеча та небезпека кровотечі'},
    {title: '– захворювання вегетативної нервової системи (гангліоніт, діенцефальний криз)'},
    {title: '– психічні захворювання, що утруднюють контакт із хворим'},
    {title: '– період місячних та вагітності у жінок'},
    {title: '– наявність сторонніх тіл біля магістральних судин та нервових сплетень'},
    {title: '– у спортсменів – стан вираженої перевтоми та збудження'},

    {title: '– тяжкий стан хворого, що супроводжується наростанням серцево-судинної, дихальної, печінкової, ниркової та інших недостатностей'},
    {title: '– новоутворення, у тому числі доброякісні'},
    {title: '– тромбофлебіти,тромбози судин, варикозне розширення вен з трофічними порушеннями'},
    {title: '– септичний стан'},
    {title: '– захворювання крові, кровоточивість'},
    {title: '– бронхоектатична хвороба в стадії тканинного розпаду'},
    {title: '– сифіліс II-III ступенів та інші гострі венеричні хвороби'},
    {title: '– виражений склероз судин головного мозку зі схильністю до тромбоутворення та кровотеч'},
];


module.exports = new Promise((resolve, reject) => {
    Promise.all([
        promiseHelper.getManyPromiseCreateModel(M_Allowed_Contraindications,arr),
        new Promise((resolve1, reject1) => {
            M_Allowed_Sub_Contraindications.create(
                [
                    {title: '- порушення мозкового кровообігу'},
                    {title: '- інфаркт міокарда'},
                    {title: '- гіпертонічний криз '}
                ],
                (err, res) => {
                    if (err) {
                        throw err
                    } else {
                        M_Allowed_Contraindications.create(
                            {
                                title: '– гострий період захворювання',
                                subContraindications: res
                            },
                            (err, res) => {
                                if (err) {
                                    reject1(err)
                                } else {
                                    resolve1(res)
                                }
                            });
                    }
                }
            );
        })
    ]).then(values => {
        if (values.length === 0) {
            reject("Error create M_Allowed_Sub_Contraindications")
        } else {
            resolve(values);
        }
    });
});

