const M_Duration = require('../../models/all/m_duration');
const promiseHelper = require('../promise_helper');

module.exports = promiseHelper.getPromiseCreateModel(
    M_Duration,
    [
        {
            title: 'Масаж голови (лобно-скроневої та потилично-тім’яної ділянок)',
            numberOfUnits: 1.0,
            minutes: 10
        },
        {
            title: 'Масаж обличчя (лобової, приочної, верхньо- і нижньо-щелепної ділянок)',
            numberOfUnits: 1.0,
            minutes: 10
        },
        {
            title: 'Масаж шиї',
            numberOfUnits: 1.5,
            minutes: 10
        },
        {
            title: 'Масаж комірцевої зони (задньої та бічної поверхні шиї, спини до рівня IV грудного хребця, передньої поверхні грудної клітки до II ребра)',
            numberOfUnits: 1.5,
            minutes: 10
        },
        {
            title: 'Масаж верхньої кінцівки',
            numberOfUnits: 1.5,
            minutes: 15
        },
        {
            title: 'Масаж верхньої кінцівки, надпліччя та ділянки лопатки',
            numberOfUnits: 2.0,
            minutes: 20
        },
        {
            title: 'Масаж плечового суглоба (верхньої третини плеча, ділянки плечового суглоба та надпліччя однойменної масажу)',
            numberOfUnits: 1.0,
            minutes: 10
        },
        {
            title: 'Масаж ліктьового суглоба (верхньої третини передпліччя, ділянки ліктьового суглоба та нижньої третини плеча)',
            numberOfUnits: 1.0,
            minutes: 10
        },
        {
            title: 'Масаж променевозап’ясткового суглоба (проксимального відділу кисті, променевозап’ясткового суглоба та передпліччя)',
            numberOfUnits: 1.0,
            minutes: 10
        },
        {
            title: 'Масаж кисті та передпліччя',
            numberOfUnits: 1.0,
            minutes: 10
        },
        {
            title: 'Масаж ділянки грудної клітки (ділянки передньої поверхні грудної клітки від передніх меж надпліч до ребрових дуг в ділянці спини, від VII шийного до I поперекового хребця)',
            numberOfUnits: 2.5,
            minutes: 25
        },
        {
            title: 'Масаж спини (від VII шийного до I поперекового хребця і від лівої до правої середньої аксилярної лінії), у дітей – включаючи попереково-крижову ділянку',
            numberOfUnits: 1.5,
            minutes: 15
        },
        {
            title: 'Масаж м’язів передньої черевної стінки',
            numberOfUnits: 1.0,
            minutes: 10
        },
        {
            title: 'Масаж попереково-крижової ділянки (від I поперекового хребця до нижніх сідничних складок)',
            numberOfUnits: 1.0,
            minutes: 10
        },
        {
            title: 'Сегментарний масаж попереково-крижової ділянки',
            numberOfUnits: 1.5,
            minutes: 15
        },
        {
            title: 'Масаж спини і поперекового відділу (від VII шийного хребця до крижів, від лівої до правої середньої аксилярної лінії)',
            numberOfUnits: 1.5,
            minutes: 15
        },
        {
            title: 'Масаж шийно-грудного відділу хребта (ділянки задньої поверхні шиї та ділянки спини до поперекового хребця, від лівої до правої задньої аксилярної лінії)',
            numberOfUnits: 2.0,
            minutes: 20
        },
        {
            title: 'Сегментарний масаж шийно-грудного відділу хребта',
            numberOfUnits: 3.0,
            minutes: 30
        },
        {
            title: 'Масаж ділянки хребта (ділянки задньої поверхні шиї, спини і попереково-крижової ділянки, від лівої до правої задньої аксилярної лінії)',
            numberOfUnits: 2.5,
            minutes: 25
        },
        {
            title: 'Масаж нижньої кінцівки та попереку (ділянки стопи, гомілки, стегна, сідничної та попереково-крижової ділянки)',
            numberOfUnits: 2.0,
            minutes: 20
        },
        {
            title: 'Масаж нижньої кінцівки',
            numberOfUnits: 1.5,
            minutes: 15
        },
        {
            title: 'Масаж тазостегнового суглоба (верхньої третини стегна, ділянки тазостегнового суглоба та сідничної ділянки однойменної сторони)',
            numberOfUnits: 1.0,
            minutes: 10
        },
        {
            title: 'Масаж колінного суглоба (верхньої третини гомілки, ділянки колінного суглоба та нижньої третини стегна)',
            numberOfUnits: 1.0,
            minutes: 10
        },
        {
            title: 'Масаж гомілковостопного суглоба (проксимального відділу стопи, ділянки гомілкового суглоба та нижньої третини гомілки)',
            numberOfUnits: 1.0,
            minutes: 10
        },
        {
            title: 'Масаж стопи та гомілки.',
            numberOfUnits: 1.0,
            minutes: 10
        },
        {
            title: 'Загальний масаж (у дітей грудного та молодшого дошкільного віку)',
            numberOfUnits: 3.0,
            minutes: 30
        },
    ]
);