const Ph_R_Form = require('../../services/crud_services/ph_r_form.service');
const Ph_R_F_Level = require('../../services/crud_services/ph_r_f_level.service');
const Ph_R_F_L_Info = require('../../services/crud_services/ph_r_f_l_info.service');
const Ph_R_F_L_I_Title = require('../../services/crud_services/ph_r_f_l_i_title.service');
const Ph_R_F_L_I_Value = require('../../services/crud_services/ph_r_f_l_i_value.service');
const Ph_R_F_L_Title = require('../../services/crud_services/ph_r_f_l_title.service');
const Mode_Of_Motor_Activity = require('../../services/crud_services/mode_of_motor_activity.service');
const promiseHelper = require('../promise_helper');

module.exports = new Promise((resolve, reject) => {
    let createLevel = function (lTitle, lITitleArr, lIValueArr, modeOfMotorActivity, callback) {
        Promise.all(
            [
                new Promise((resolve, reject) => {
                    Ph_R_F_L_Title.find(lTitle, (err, title) => {
                        err ? reject(err) : resolve(title);
                    })
                }),
                new Promise((resolve, reject) => {
                    promiseHelper.oneToOne(
                        Ph_R_F_L_I_Title,
                        lITitleArr,
                        Ph_R_F_L_I_Value,
                        lIValueArr,
                        (values) => {
                            let arr = [];
                            values[0].forEach((item, i) => {
                                arr.push({title: item, value: values[1][i]})
                            });
                            Ph_R_F_L_Info.create(arr, (err, info) => {
                                err ? reject(err) : resolve(info);
                            })
                        }
                    );
                }),
                new Promise((resolve, reject) => {
                    Mode_Of_Motor_Activity.find(modeOfMotorActivity, (err, activity) => {
                        err ? reject(err) : resolve(activity);
                    })
                })
            ]
        ).then(values => {
            Ph_R_F_Level.create({
                    title: values[0][0],
                    info: values[1],
                    mode_of_motor_activity: values[2][0]
                },
                (err, level) => {
                    if (callback) callback(err, level);
                }
            )
        });
    };

    let createForm = function (form, levelsArray) {
        let promisesArray = [];
        levelsArray.forEach(level => {
            promisesArray.push(new Promise((resolve, reject) => {
                createLevel(level[0], level[1], level[2], level[3], (err, res) => {
                    err ? reject(err) : resolve(res);
                });
            }))
        });
        Promise.all(promisesArray).then(values => {
            Ph_R_Form.create(
                {
                    title: form.title,
                    level: values
                }, (err, phRForm) => {
                    if (err) {
                        reject(err)
                    } else {
                        resolve(phRForm)
                    }
                }
            )
        })
    };

    let createSimpleForm = function () {
        Ph_R_Form.create([
            {
                title: 'РГ - Ранкова гімнастика'
            },
            {
                title: 'ЛГ - Лікувальна гімнастика'
            },
            {
                title: 'СЗ - Самостійні заняття'
            },
            {
                title: 'Механо-терапія'
            },
            {
                title: 'Фізіотерапія'
            },
            {
                title: 'Бальнео-терапія'
            },
            {
                title: 'Харчування'
            },
            {
                title: 'Масаж'
            },
            {
                title: 'Мультимедійні засоби'
            },
            {
                title: 'Теренкур'
            },
            {
                title: 'Прогулянки'
            },
            {
                title: 'Їзда на велосипеді'
            },
            {
                title: 'Катання верхи'
            },
            {
                title: 'Катання на лижах'
            },
            {
                title: 'Ходьба (Нордична)'
            },
            {
                title: 'Праце-терапія'
            }
        ], err => {
            if (err) throw (err)
        });
    };

    let createAllForm = function (formArray) {
        createSimpleForm();

        formArray.forEach(form => {
            createForm(form[0], form[1]);
        })
    };

    createAllForm(
        [
            [
                {title: 'Біг'},
                [
                    [
                        {title: 'Режим I (щадний)'},
                        [
                            {title: 'Тривалість'},
                            {title: 'Темп'},
                            {title: 'Режим'},
                        ],
                        [
                            {title: 'не показаний'},
                            {title: 'не показаний'},
                            {title: 'не показаний'},
                        ],
                        {title: 'Щадний'},
                    ],
                    [
                        {title: 'Режим II (щадно-тренувальний)'},
                        [
                            {title: 'Тривалість'},
                            {title: 'Темп'},
                            {title: 'Режим'},
                        ],
                        [
                            {title: 'не показаний'},
                            {title: 'не показаний'},
                            {title: 'не показаний'},
                        ],
                        {title: 'Щадно-тренувальний'},
                    ],
                    [
                        {title: 'Режим III (тренувальний)'},
                        [
                            {title: 'Тривалість'},
                            {title: 'Темп'},
                            {title: 'Режим'},
                        ],
                        [
                            {title: '6-15 хв'},
                            {title: '2 м/сек (140 кр/хв)'},
                            {title: 'інтервальний'},
                        ],
                        {title: 'Тренувальний'},
                    ],
                    [
                        {title: 'Режим IV (інтенсивно-тренувальний)'},
                        [
                            {title: 'Тривалість'},
                            {title: 'Темп'},
                            {title: 'Режим'},
                        ],
                        [
                            {title: '6-15 хв'},
                            {title: '2 м/сек (140 кр/хв)'},
                            {title: 'інтервальний'},
                        ],
                        {title: 'Інтенсивно тренувальний'},
                    ]
                ]
            ],
            [
                {title: 'Ігрові вправи'},
                [
                    [
                        {title: 'Режим I (щадний)'},
                        [
                            {title: 'Темп'},
                            {title: 'Види'},
                            {title: 'Тривалість'},
                        ],
                        [
                            {title: 'повільний'},
                            {title: 'Кегельбан, крокет, кільцекид'},
                            {title: 'до 30 хв'},
                        ],
                        {title: 'Щадний'},
                    ],
                    [
                        {title: 'Режим II (щадно-тренувальний)'},
                        [
                            {title: 'Темп'},
                            {title: 'Види'},
                            {title: 'Тривалість'},
                        ],
                        [
                            {title: 'помірний'},
                            {title: 'наст. теніс, волейбол, бадмінтон'},
                            {title: 'до 50 хв'},
                        ],
                        {title: 'Щадно-тренувальний'},
                    ],
                    [
                        {title: 'Режим III (тренувальний)'},
                        [
                            {title: 'Темп'},
                            {title: 'Види'},
                            {title: 'Тривалість'},
                        ],
                        [
                            {title: 'без обмежень'},
                            {title: 'будь які'},
                            {title: 'до 2 год'},
                        ],
                        {title: 'Тренувальний'},
                    ],
                    [
                        {title: 'Режим IV (інтенсивно-тренувальний)'},
                        [
                            {title: 'Темп'},
                            {title: 'Види'},
                            {title: 'Тривалість'},
                        ],
                        [
                            {title: 'без обмежень'},
                            {title: 'будь які'},
                            {title: 'до 2 год'},
                        ],
                        {title: 'Інтенсивно тренувальний'},
                    ]
                ]
            ],
            [
                {title: 'Гартування на повітрі'},
                [
                    [
                        {title: 'Режим I (щадний)'},
                        [
                            {title: 'Температура'},
                            {title: 'Холодове навантаження'},
                            {title: 'Середня експозиція'},
                        ],
                        [
                            {title: '19-20͒° С'},
                            {title: 'Слабка (20-25 ккал)'},
                            {title: 'Від 15-20 до 30-80 хв'},
                        ],
                        {title: 'Щадний'},
                    ],
                    [
                        {title: 'Режим II (щадно-тренувальний)'},
                        [
                            {title: 'Температура'},
                            {title: 'Холодове навантаження'},
                            {title: 'Середня експозиція'},
                        ],
                        [
                            {title: 'не нижче 20° С'},
                            {title: 'Середня (30-35 ккал)'},
                            {title: 'Від 20 хв до 1,5 години'},
                        ],
                        {title: 'Щадно-тренувальний'},
                    ],
                    [
                        {title: 'Режим III (тренувальний)'},
                        [
                            {title: 'Температура'},
                            {title: 'Холодове навантаження'},
                            {title: 'Середня експозиція'},
                        ],
                        [
                            {title: 'без обмежень'},
                            {title: 'Сильна (40-45 ккал)'},
                            {title: 'Від 1 до 2 година'},
                        ],
                        {title: 'Тренувальний'},
                    ],
                    [
                        {title: 'Режим IV (інтенсивно-тренувальний)'},
                        [
                            {title: 'Температура'},
                            {title: 'Холодове навантаження'},
                            {title: 'Середня експозиція'},
                        ],
                        [
                            {title: 'без обмежень'},
                            {title: 'Сильна (40-50 ккал)'},
                            {title: 'Від 1 до 2,5 година'},
                        ],
                        {title: 'Інтенсивно тренувальний'},
                    ]
                ]
            ],
            [
                {title: 'Купання в морі або відкритих водоймищах'},
                [
                    [
                        {title: 'Режим I (щадний)'},
                        [
                            {title: 'Температура води'},
                            {title: 'Холодове навантаження'},
                            {title: 'Середня експозиція'},
                            {title: 'Темп плавання'},
                        ],
                        [
                            {title: '>20͒° С'},
                            {title: 'Слабка (20-25 ккал)'},
                            {title: '1-3 хв'},
                            {title: 'повільний'},
                        ],
                        {title: 'Щадний'},
                    ],
                    [
                        {title: 'Режим II (щадно-тренувальний)'},
                        [
                            {title: 'Температура води'},
                            {title: 'Холодове навантаження'},
                            {title: 'Середня експозиція'},
                            {title: 'Темп плавання'},
                        ],
                        [
                            {title: '>19° С'},
                            {title: 'Середня (30-35 ккал)'},
                            {title: '5-10 хв'},
                            {title: 'Повільний і середній'},
                        ],
                        {title: 'Щадно-тренувальний'},
                    ],
                    [
                        {title: 'Режим III (тренувальний)'},
                        [
                            {title: 'Температура води'},
                            {title: 'Холодове навантаження'},
                            {title: 'Середня експозиція'},
                            {title: 'Темп плавання'},
                        ],
                        [
                            {title: '16-17° С'},
                            {title: 'Сильна (40-45 ккал)'},
                            {title: '5-10 хв'},
                            {title: 'середній'},
                        ],
                        {title: 'Тренувальний'},
                    ],
                    [
                        {title: 'Режим IV (інтенсивно-тренувальний)'},
                        [
                            {title: 'Температура води'},
                            {title: 'Холодове навантаження'},
                            {title: 'Середня експозиція'},
                            {title: 'Темп плавання'},
                        ],
                        [
                            {title: '15-17° С'},
                            {title: 'Сильна ( до 50 ккал)'},
                            {title: '10 - 20 хв'},
                            {title: 'Середній і швидкий'},
                        ],
                        {title: 'Інтенсивно тренувальний'},
                    ]
                ]
            ],
            [
                {title: 'Загальні сонячні ванни'},
                [
                    [
                        {title: 'Режим I (щадний)'},
                        [
                            {title: 'Інтенсивність'},
                            {title: 'Час доби'},
                        ],
                        [
                            {title: 'РЭЭТ=18-29 С 5-20 кал 1/4-1 біодоза'},
                            {title: 'Ранок'},
                        ],
                        {title: 'Щадний'},
                    ],
                    [
                        {title: 'Режим II (щадно-тренувальний)'},
                        [
                            {title: 'Інтенсивність'},
                            {title: 'Час доби'},
                        ],
                        [
                            {title: 'РЭЭТ=18-29 С 10-40 кал 1/2-2,5 біодоза'},
                            {title: 'Ранок'},
                        ],
                        {title: 'Щадно-тренувальний'},
                    ],
                    [
                        {title: 'Режим III (тренувальний)'},
                        [
                            {title: 'Інтенсивність'},
                            {title: 'Час доби'},
                        ],
                        [
                            {title: 'РЭЭТ=18-29 С 10-70 кал 1/2-3 біодоза'},
                            {title: 'Окрім 12-15 година'},
                        ],
                        {title: 'Тренувальний'},
                    ],
                    [
                        {title: 'Режим IV (інтенсивно-тренувальний)'},
                        [
                            {title: 'Інтенсивність'},
                            {title: 'Час доби'},
                        ],
                        [
                            {title: 'РЭЭТ=18-29 С 20-100 кал 2-5 біодоза'},
                            {title: 'Окрім 12-15 година'},
                        ],
                        {title: 'Інтенсивно тренувальний'},
                    ]
                ]
            ],
            [
                {title: 'Місцеві сонячні ванни'},
                [
                    [
                        {title: 'Режим I (щадний)'},
                        [
                            {title: 'Інтенсивність'},
                        ],
                        [
                            {title: '50-60 кал'},
                        ],
                        {title: 'Щадний'},
                    ],
                    [
                        {title: 'Режим II (щадно-тренувальний)'},
                        [
                            {title: 'Інтенсивність'},
                        ],
                        [
                            {title: '60-80 кал'},
                        ],
                        {title: 'Щадно-тренувальний'},
                    ],
                    [
                        {title: 'Режим III (тренувальний)'},
                        [
                            {title: 'Інтенсивність'},
                        ],
                        [
                            {title: 'до 80 кал'},
                        ],
                        {title: 'Тренувальний'},
                    ],
                    [
                        {title: 'Режим IV (інтенсивно-тренувальний)'},
                        [
                            {title: 'Інтенсивність'},
                        ],
                        [
                            {title: 'до 100 кал'},
                        ],
                        {title: 'Інтенсивно тренувальний'},
                    ]
                ]
            ],
            [
                {title: 'Уранішня гігієнічна гімнастика (РГ)'},
                [
                    [
                        {title: 'Режим Суворий Ліжковий'},
                        [
                            {title: 'Метод проведення'},
                            {title: 'Місце проведення'},
                            {title: 'Час проведення'},
                            {title: 'Вихідне положення'},
                            {title: 'Кількість вправ'},
                            {title: 'Кількість повторень вправ'},
                            {title: 'Темп'},
                            {title: 'Амплітуда'},
                            {title: 'Складність рухів'},
                            {title: 'Контроль'},
                            {title: 'Співвідношення загально-зміцнювальних та дихальних вправ'},
                            {title: 'Ступінь силового зусилля'},
                            {title: 'Максимально допустиме зростання ЧСС'},
                        ],
                        [
                            {title: 'Індивідуальний'},
                            {title: 'Палата (на ліжку)'},
                            {title: 'Ранок'},
                            {title: 'лежачи'},
                            {title: '4'},
                            {title: '4-6'},
                            {title: 'повільний'},
                            {title: 'обмежена'},
                            {title: 'В одній площині.Дрібні суглоби та м’язові групи'},
                            {title: 'Самоконтроль. Медична сестра'},
                            {title: 'Переважно дихальні вправи'},
                            {title: 'М’язи розслаблені'},
                            {title: 'до +4(до 5%)'},
                        ],
                        {title: 'Суворий ліжковий'},
                    ],
                    [
                        {title: 'Режим Ліжковий'},
                        [
                            {title: 'Метод проведення'},
                            {title: 'Місце проведення'},
                            {title: 'Час проведення'},
                            {title: 'Вихідне положення'},
                            {title: 'Кількість вправ'},
                            {title: 'Кількість повторень вправ'},
                            {title: 'Темп'},
                            {title: 'Амплітуда'},
                            {title: 'Складність рухів'},
                            {title: 'Контроль'},
                            {title: 'Співвідношення загально-зміцнювальних та дихальних вправ'},
                            {title: 'Ступінь силового зусилля'},
                            {title: 'Максимально допустиме зростання ЧСС'},
                        ],
                        [
                            {title: 'Індивідуальний'},
                            {title: 'Палата (на ліжку)'},
                            {title: 'Ранок'},
                            {title: 'лежачи'},
                            {title: '4'},
                            {title: '4-6'},
                            {title: 'повільний'},
                            {title: 'обмежена'},
                            {title: 'В одній площині.Дрібні суглоби та м’язові групи'},
                            {title: 'Самоконтроль. Медична сестра'},
                            {title: 'Переважно дихальні вправи'},
                            {title: 'М’язи розслаблені'},
                            {title: 'до +4(до 5%)'},
                        ],
                        {title: 'Розширений ліжковий'},
                    ],
                    [
                        {title: 'Режим Палатний'},
                        [
                            {title: 'Метод проведення'},
                            {title: 'Місце проведення'},
                            {title: 'Час проведення'},
                            {title: 'Вихідне положення'},
                            {title: 'Кількість вправ'},
                            {title: 'Кількість повторень вправ'},
                            {title: 'Темп'},
                            {title: 'Амплітуда'},
                            {title: 'Складність рухів'},
                            {title: 'Контроль'},
                            {title: 'Співвідношення загально-зміцнювальних та дихальних вправ'},
                            {title: 'Ступінь силового зусилля'},
                            {title: 'Максимально допустиме зростання ЧСС'},
                        ],
                        [
                            {title: 'Індивідуальний,  малогруповий'},
                            {title: 'Палата'},
                            {title: 'Ранок'},
                            {title: 'лежачи, сидячи'},
                            {title: '6'},
                            {title: '6'},
                            {title: 'середній'},
                            {title: 'середня'},
                            {title: 'В одній площині послідовно.Дрібні та середні суглоби та м’язові групи'},
                            {title: 'Самоконтроль. Медична сестра'},
                            {title: '2:1'},
                            {title: 'Без силового зусилля'},
                            {title: 'до +8(до 10%)'},
                        ],
                        {title: 'Палатний'},
                    ],
                    [
                        {title: 'Режим Вільний'},
                        [
                            {title: 'Метод проведення'},
                            {title: 'Місце проведення'},
                            {title: 'Час проведення'},
                            {title: 'Вихідне положення'},
                            {title: 'Кількість вправ'},
                            {title: 'Кількість повторень вправ'},
                            {title: 'Темп'},
                            {title: 'Амплітуда'},
                            {title: 'Складність рухів'},
                            {title: 'Контроль'},
                            {title: 'Співвідношення загально-зміцнювальних та дихальних вправ'},
                            {title: 'Ступінь силового зусилля'},
                            {title: 'Максимально допустиме зростання ЧСС'},
                        ],
                        [
                            {title: 'груповий'},
                            {title: 'Коридор, Холл'},
                            {title: 'Ранок'},
                            {title: 'лежачи, сидячи, стоячи'},
                            {title: '12'},
                            {title: '8'},
                            {title: 'середній'},
                            {title: 'повна'},
                            {title: 'У всіх площинах послідовно. Усі суглоби та м’язові групи'},
                            {title: 'Самоконтроль. Медична сестра'},
                            {title: '1:1'},
                            {title: 'Без силового зусилля'},
                            {title: 'до +12(до 15%)'},
                        ],
                        {title: 'Вільний'},
                    ],
                    [
                        {title: 'Режим I (щадний)'},
                        [
                            {title: 'Метод'},
                            {title: 'Види вправ'},
                            {title: 'Тривалість'},
                        ],
                        [
                            {title: 'Роздільний'},
                            {title: 'Дихальні'},
                            {title: 'до 15  хв'},
                        ],
                        {title: 'Щадний'},
                    ],
                    [
                        {title: 'Режим II (щадно-тренувальний)'},
                        [
                            {title: 'Метод'},
                            {title: 'Види вправ'},
                            {title: 'Тривалість'},
                        ],
                        [
                            {title: 'Роздільний і змішаний'},
                            {title: 'Загальнофізичні до 16 вправ'},
                            {title: '15  хв'},
                        ],
                        {title: 'Щадно-тренувальний'},
                    ],
                    [
                        {title: 'Режим III (тренувальний)'},
                        [
                            {title: 'Метод'},
                            {title: 'Види вправ'},
                            {title: 'Тривалість'},
                        ],
                        [
                            {title: 'змішаний'},
                            {title: 'Загальнофізичні більше 16 вправ'},
                            {title: '20 хв'},
                        ],
                        {title: 'Тренувальний'},
                    ],
                    [
                        {title: 'Режим IV (інтенсивно-тренувальний)'},
                        [
                            {title: 'Метод'},
                            {title: 'Види вправ'},
                            {title: 'Тривалість'},
                        ],
                        [
                            {title: 'змішаний'},
                            {title: 'Загальнофізичні - індивідуальні'},
                            {title: '20 хв'},
                        ],
                        {title: 'Інтенсивно тренувальний'},
                    ]
                ]
            ],
            [
                {title: 'Лікувальна гімнастика (ЛГ) — груповий метод'},
                [
                    [
                        {title: 'Режим Суворий Ліжковий'},
                        [
                            {title: 'Метод проведення'},
                            {title: 'Місце проведення'},
                            {title: 'Час проведення'},
                            {title: 'Вихідне положення'},
                            {title: 'Кількість вправ'},
                            {title: 'Кількість повторень вправ'},
                            {title: 'Темп'},
                            {title: 'Амплітуда'},
                            {title: 'Складність рухів'},
                            {title: 'Моторна щільність'},
                            {title: 'Контроль'},
                            {title: 'Співвідношення загально-зміцнювальних та дихальних вправ'},
                            {title: 'Співвідношення загально-зміцнювальних до спеціальних вправ'},
                            {title: 'Ступінь силового зусилля'},
                            {title: 'Максимально допустиме зростання ЧСС'},
                        ],
                        [
                            {title: 'Індивідуальний'},
                            {title: 'Палата (на ліжку)'},
                            {title: 'Ранок'},
                            {title: 'лежачи'},
                            {title: '8'},
                            {title: '4-6'},
                            {title: 'повільний'},
                            {title: 'обмежена'},
                            {title: 'В одній площині.Дрібні суглоби та м’язові групи'},
                            {title: '35 - 45 %'},
                            {title: 'Самоконтроль. Медична сестра'},
                            {title: '2:1'},
                            {title: '3:1'},
                            {title: 'М’язи розслаблені'},
                            {title: 'до +8(до10%)'},
                        ],
                        {title: 'Суворий ліжковий'},
                    ],
                    [
                        {title: 'Режим Ліжковий'},
                        [
                            {title: 'Метод проведення'},
                            {title: 'Місце проведення'},
                            {title: 'Час проведення'},
                            {title: 'Вихідне положення'},
                            {title: 'Кількість вправ'},
                            {title: 'Кількість повторень вправ'},
                            {title: 'Темп'},
                            {title: 'Амплітуда'},
                            {title: 'Складність рухів'},
                            {title: 'Моторна щільність'},
                            {title: 'Контроль'},
                            {title: 'Співвідношення загально-зміцнювальних та дихальних вправ'},
                            {title: 'Співвідношення загально-зміцнювальних до спеціальних вправ'},
                            {title: 'Ступінь силового зусилля'},
                            {title: 'Максимально допустиме зростання ЧСС'},
                        ],
                        [
                            {title: 'Індивідуальний'},
                            {title: 'Палата (на ліжку)'},
                            {title: 'Ранок'},
                            {title: 'лежачи'},
                            {title: '8'},
                            {title: '4-6'},
                            {title: 'повільний'},
                            {title: 'обмежена'},
                            {title: 'В одній площині.Дрібні суглоби та м’язові групи'},
                            {title: '35 - 45 %'},
                            {title: 'Самоконтроль. Медична сестра'},
                            {title: '2:1'},
                            {title: '3:1'},
                            {title: 'М’язи розслаблені'},
                            {title: 'до +8(до10%)'},
                        ],
                        {title: 'Розширений ліжковий'},
                    ],
                    [
                        {title: 'Режим Палатний'},
                        [
                            {title: 'Метод проведення'},
                            {title: 'Тривалість заняття'},
                            {title: 'Місце проведення'},
                            {title: 'Вихідне положення'},
                            {title: 'Кількість вправ'},
                            {title: 'Кількість повторень вправ'},
                            {title: 'Темп'},
                            {title: 'Амплітуда'},
                            {title: 'Складність рухів'},
                            {title: 'Моторна щільність'},
                            {title: 'Співвідношення загально-зміцнювальних та дихальних вправ'},
                            {title: 'Співвідношення загально-зміцнювальних до спеціальних вправ'},
                            {title: 'Ступінь силового зусилля'},
                            {title: 'Максимально допустиме зростання ЧСС'},
                        ],
                        [
                            {title: 'Індивідуальний,  малогруповий'},
                            {title: '20-25 хв'},
                            {title: 'Палата (на ліжку)'},
                            {title: 'лежачи, сидячи'},
                            {title: '16'},
                            {title: '6'},
                            {title: 'середній'},
                            {title: 'середня'},
                            {title: 'В одній-двох площинах послідовно.Середні суглоби та м’язові групи'},
                            {title: '45 - 50 %'},
                            {title: '1:1'},
                            {title: '2:1'},
                            {title: 'Без силового зусилля, у разі необхідності застосування засобів полегшення навантаження'},
                            {title: 'до +16(до 20%)'},
                        ],
                        {title: 'Палатний'},
                    ],
                    [
                        {title: 'Режим Вільний'},
                        [
                            {title: 'Метод проведення'},
                            {title: 'Тривалість заняття'},
                            {title: 'Вихідне положення'},
                            {title: 'Кількість вправ'},
                            {title: 'Кількість повторень вправ'},
                            {title: 'Темп'},
                            {title: 'Амплітуда'},
                            {title: 'Складність рухів'},
                            {title: 'Моторна щільність'},
                            {title: 'Співвідношення загально-зміцнювальних та дихальних вправ'},
                            {title: 'Співвідношення загально-зміцнювальних до спеціальних вправ'},
                            {title: 'Ступінь силового зусилля'},
                            {title: 'Максимально допустиме зростання ЧСС'},
                        ],
                        [
                            {title: 'груповий'},
                            {title: '25-30 хв'},
                            {title: 'лежачи, сидячи, стоячи'},
                            {title: '24'},
                            {title: '8'},
                            {title: 'середній, швидкий'},
                            {title: 'повна'},
                            {title: 'У всіх площинах послідовно. Усі суглоби та м’язові групи'},
                            {title: '50 - 60 %'},
                            {title: '1:2'},
                            {title: '1:1'},
                            {title: 'Помірні силові зусилля. При захворюваннях ССС та дихальної системи натужування не показані'},
                            {title: 'до +24(до 30%)'},
                        ],
                        {title: 'Вільний'},
                    ],
                    [
                        {title: 'Режим I (щадний)'},
                        [
                            {title: 'Темп'},
                            {title: 'Види вправ'},
                            {title: 'Тривалість'},
                        ],
                        [
                            {title: 'повільний'},
                            {title: 'Дихальні та для дрібних м’язових груп'},
                            {title: '20-30 хв, з 2-4 паузами по 3 хв'},
                        ],
                        {title: 'Щадний'},
                    ],
                    [
                        {title: 'Режим II (щадно-тренувальний)'},
                        [
                            {title: 'Темп'},
                            {title: 'Види вправ'},
                            {title: 'Тривалість'},
                        ],
                        [
                            {title: 'середній'},
                            {title: 'Загально фізичні, комплекс «Здоровя»'},
                            {title: 'до 30 хв'},
                        ],
                        {title: 'Щадно-тренувальний'},
                    ],
                    [
                        {title: 'Режим III (тренувальний)'},
                        [
                            {title: 'Темп'},
                            {title: 'Види вправ'},
                            {title: 'Тривалість'},
                        ],
                        [
                            {title: 'середній, швидкий'},
                            {title: 'Будь-які, включаючи стрибки, біг, тренажери'},
                            {title: '30 - 40 хв'},
                        ],
                        {title: 'Тренувальний'},
                    ],
                    [
                        {title: 'Режим IV (інтенсивно-тренувальний)'},
                        [
                            {title: 'Темп'},
                            {title: 'Види вправ'},
                            {title: 'Тривалість'},
                        ],
                        [
                            {title: 'середній, швидкий'},
                            {title: 'Будь-які, включаючи стрибки, біг, тренажери'},
                            {title: '1 година'},
                        ],
                        {title: 'Інтенсивно тренувальний'},
                    ]
                ]
            ],
            [
                {title: 'Ходьба'},
                [
                    [
                        {title: 'Режим I (щадний)'},
                        [
                            {title: 'Відстань'},
                            {title: 'Швидкість'},
                        ],
                        [
                            {title: '2-3 км'},
                            {title: '3-5 км/год (80-90 кр/хв)'},
                        ],
                        {title: 'Щадний'},
                    ],
                    [
                        {title: 'Режим II (щадно-тренувальний)'},
                        [
                            {title: 'Відстань'},
                            {title: 'Швидкість'},
                        ],
                        [
                            {title: '5 км'},
                            {title: '4-5 км/год (80-90 кр/хв)'},
                        ],
                        {title: 'Щадно-тренувальний'},
                    ],
                    [
                        {title: 'Режим III (тренувальний)'},
                        [
                            {title: 'Відстань'},
                            {title: 'Швидкість'},
                        ],
                        [
                            {title: '12 км'},
                            {title: '5-6 км/год (100 - 110  кр/хв)'},
                        ],
                        {title: 'Тренувальний'},
                    ],
                    [
                        {title: 'Режим IV (інтенсивно-тренувальний)'},
                        [
                            {title: 'Відстань'},
                            {title: 'Швидкість'},
                        ],
                        [
                            {title: '25км'},
                            {title: '5-6 км/год  до (120  кр/хв)'},
                        ],
                        {title: 'Інтенсивно тренувальний'},
                    ]
                ]
            ],
            [
                {title: 'Теренкур'},
                [
                    [
                        {title: 'Режим I (щадний)'},
                        [
                            {title: 'Характер місцевості'},
                            {title: 'Кут підйому'},
                            {title: 'Відстань'},
                            {title: 'Темп'},
                            {title: 'Характер, навантаження'},
                        ],
                        [
                            {title: 'Рівна'},
                            {title: 'до 5'},
                            {title: 'до 3 км'},
                            {title: '70-80 кр/хв з 2-3 паузами по 5 хв'},
                            {title: 'Через кожні 4 дні збільшення'},
                        ],
                        {title: 'Щадний'},
                    ],
                    [
                        {title: 'Режим II (щадно-тренувальний)'},
                        [
                            {title: 'Характер місцевості'},
                            {title: 'Кут підйому'},
                            {title: 'Відстань'},
                            {title: 'Темп'},
                            {title: 'Характер, навантаження'},
                        ],
                        [
                            {title: 'Пересічна'},
                            {title: '5 - 10'},
                            {title: 'до 5 км'},
                            {title: '80-90 кр/хв з 2-3 паузами по 5 хв'},
                            {title: 'Через кожні 4 дні збільшення'},
                        ],
                        {title: 'Щадно-тренувальний'},
                    ],
                    [
                        {title: 'Режим III (тренувальний)'},
                        [
                            {title: 'Характер місцевості'},
                            {title: 'Кут підйому'},
                            {title: 'Відстань'},
                            {title: 'Темп'},
                            {title: 'Характер, навантаження'},

                        ],
                        [
                            {title: 'Пересічна'},
                            {title: 'до 15'},
                            {title: 'до 12 км'},
                            {title: '5-6 км/год 100-110 кр/хв'},
                            {title: 'Поступовий'},
                        ],
                        {title: 'Тренувальний'},
                    ],
                    [
                        {title: 'Режим IV (інтенсивно-тренувальний)'},
                        [
                            {title: 'Характер місцевості'},
                            {title: 'Кут підйому'},
                            {title: 'Відстань'},
                            {title: 'Темп'},
                            {title: 'Характер, навантаження'},
                        ],
                        [
                            {title: 'Пересічна'},
                            {title: 'більше 15'},
                            {title: 'до 25 км'},
                            {title: '5-6 км/год до 120 кр/хв'},
                            {title: 'Поступовий'},
                        ],
                        {title: 'Інтенсивно тренувальний'},
                    ]
                ]
            ],
            [
                {title: 'Ближній туризм (Туризм)'},
                [
                    [
                        {title: 'Режим I (щадний)'},
                        [
                            {title: 'Частота'},
                            {title: 'Відстань'},
                            {title: 'Висота'},
                        ],
                        [
                            {title: 'не показаний'},
                            {title: 'не показаний'},
                            {title: 'не показаний'},
                        ],
                        {title: 'Щадний'},
                    ],
                    [
                        {title: 'Режим II (щадно-тренувальний)'},
                        [
                            {title: 'Частота'},
                            {title: 'Відстань'},
                            {title: 'Висота'},
                        ],
                        [
                            {title: '1-2 раз/тиждень'},
                            {title: 'до 12 км'},
                            {title: 'до 600 - 800 м'},
                        ],
                        {title: 'Щадно-тренувальний'},
                    ],
                    [
                        {title: 'Режим III (тренувальний)'},
                        [
                            {title: 'Частота'},
                            {title: 'Відстань'},
                            {title: 'Висота'},

                        ],
                        [
                            {title: '1-3 денні походи'},
                            {title: 'до 25 - 30 км'},
                            {title: 'до 2000 м'},
                        ],
                        {title: 'Тренувальний'},
                    ],
                    [
                        {title: 'Режим IV (інтенсивно-тренувальний)'},
                        [
                            {title: 'Частота'},
                            {title: 'Відстань'},
                            {title: 'Висота'},
                        ],
                        [
                            {title: '3 денні походи'},
                            {title: 'до 75 - 100 км'},
                            {title: 'до 2000 м'},
                        ],
                        {title: 'Інтенсивно тренувальний'},
                    ]
                ]
            ],
            [
                {title: 'Енергообгрунтованість'},
                [
                    [
                        {title: 'Режим I (щадний)'},
                        [
                            {title: 'Енерговитрати'},
                            {title: 'Належне максимальне споживання O2'},
                            {title: 'Енергетичний рівень'},
                            {title: 'Граничний вік'},
                        ],
                        [
                            {title: '100 ккал'},
                            {title: '25%'},
                            {title: '2,5 ккал/хв'},
                            {title: 'Чоловіки - 65р., Жінки - 60р'},
                        ],
                        {title: 'Щадний'},
                    ],
                    [
                        {title: 'Режим II (щадно-тренувальний)'},
                        [
                            {title: 'Енерговитрати'},
                            {title: 'Належне максимальне споживання O2'},
                            {title: 'Енергетичний рівень'},
                            {title: 'Граничний вік'},
                        ],
                        [
                            {title: '150 - 200 ккал'},
                            {title: '26 - 39 %'},
                            {title: '2,5 4 ккал/хв'},
                            {title: 'Чоловіки - 75 р., Жінки - 70р'},
                        ],
                        {title: 'Щадно-тренувальний'},
                    ],
                    [
                        {title: 'Режим III (тренувальний)'},
                        [
                            {title: 'Енерговитрати'},
                            {title: 'Належне максимальне споживання O2'},
                            {title: 'Енергетичний рівень'},
                            {title: 'Граничний вік'},
                        ],
                        [
                            {title: '260 - 300 ккал'},
                            {title: '40 - 59 %'},
                            {title: '4,1 - 5,0 ккал/хв'},
                            {title: 'Чоловіки - 55р., Жінки - 50р'},
                        ],
                        {title: 'Тренувальний'},
                    ],
                    [
                        {title: 'Режим IV (інтенсивно-тренувальний)'},
                        [
                            {title: 'Енерговитрати'},
                            {title: 'Належне максимальне споживання O2'},
                            {title: 'Енергетичний рівень'},
                            {title: 'Граничний вік'},
                        ],
                        [
                            {title: '301 - 400 ккал'},
                            {title: '60 -75 %'},
                            {title: '6,0 - 7,0 ккал/хв'},
                            {title: 'Чоловіки - 50 р., Жінки - 45р'},
                        ],
                        {title: 'Інтенсивно тренувальний'},
                    ]
                ]
            ]
        ]
    );
});

